{"title": "Dr. Craig Wright files statement of claim in libel suit v. podcaster Peter McCormack - CoinGeek", "url": "https://coingeek.com/craig-wright-statement-claim-peter-mccormack-libel-suit/", "birthday": "2019-05-05T19:25:15+00:00", "date": "2019-05-05 19:25:15", "year": 2019, "month": 5, "day": 5, "content": "Dr. Craig Wright’s libel action against Bitcoin podcaster Peter McCormack has taken another step toward resolution.In mid-April, Wright filed a formal claim of libel against McCormack, host of the What Bitcoin Did podcast. McCormack has very publicly accused Wright of being a fraud for maintaining that he is Satoshi Nakamoto, the pseudonymous identity behind the development and public release of Bitcoin technology.Last week, Wright’s attorneys filed their particulars of claim against McCormack in the UK High Court of Justice, Queen’s Bench Division. The document cites numerous examples of McCormack’s official Twitter account calling Wright a fraud, initially in response to tweets from CoinGeek founder Calvin Ayre, who announced that Wright had begun taking legal action against individuals denying his Satoshi claims.McCormack proceeded to publicly invite Wright to pursue legal action against him, going as far as to publish a physical address to which legal documents could be sent. McCormack also encouraged his Twitter followers to retweet his accusations that Wright was (a) not Satoshi and (b) a fraud for claiming so.McCormack only doubled down from there, publicly ‘demanding’ a lawsuit be filed against him, while accusing Ayre of “just trying to bully people into silence with empty threats.” When McCormack was served with legal papers from Wright’s attorneys, McCormack tweeted that he “absolutely” rejected the requirements specified in the correspondence, although he recommended that others not follow his lead.McCormack also claimed that Wright was a fraud for “promoting a fake version of bitcoin.” That allegedly ‘fake’ version McCormack describes would be Bitcoin Satoshi Vision (BSV), which Wright and Ayre support as the only blockchain-based technology with the on-chain scaling capacity required to become a truly global payment platform.In an April 16th interview with BlockTV.com, McCormack stated that he hopes the value of BSV “goes to zero” and urged investors to ditch their BSV holdings before that devaluation occurs and buy into Bitcoin Segwit Coin (BTC), the technology that McCormack publicly supports.In the same interview, McCormack stated that if Wright were to sign a message from the Bitcoin blockchain’s Genesis block, it would give “quite a substantial amount of credibility” to Wright’s Satoshi claims.But McCormack also stated that Wright signing such a transaction “does not prove [Wright’s claims] to me” and making an analogy in which McCormack might “steal my neighbor’s keys and drive their car … and claim it’s mine. But it’s not my car; I stole the keys.”In other words, McCormack is daring Wright to provide evidence that supports his Satoshi claims while simultaneously admitting that this evidence wouldn’t change McCormack’s mind. McCormack appears to be hedging his bet so that he can claim to have emerged victorious regardless of how the case proceeds in court.McCormack also stated that Satoshi’s true identity “doesn’t matter” and that, were this individual to emerge publicly without the Satoshi mask, his influence on the current cryptocurrency sector would be minimal.Here again, McCormack appears to be hedging his bets, undoubtedly with the knowledge that the general public’s interest in Satoshi’s identity would offer the individual behind that alias a major public platform to influence the crypto sector’s future.And if this Satoshi were to publicly declare that BSV is the only technology that honors the vision of Bitcoin laid out in Satoshi’s 2008 white paper, that would spell problems for the likes of BTC. So McCormack’s claims that he has ‘nothing to gain’ from his attacks on Wright appear as accurate as his claims that Wright is a fraud.Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Dr. Craig Wright and seminar on DACs now available on YouTube - CoinGeek", "url": "https://coingeek.com/dr-craig-wright-and-seminar-on-dacs-now-available-on-youtube-video/", "birthday": "2019-03-20T08:40:17+00:00", "date": "2019-03-20 08:40:17", "year": 2019, "month": 3, "day": 20, "content": "Dr. Craig Wright made a presentation at the Fourth International Congress on Information and Communication Technology (ICICT) 2019 in London last month regarding decentralized autonomous corporations (DAC). The work he has done on DACs was impressive enough to see Wright receive the “Best Paper” award at the ICICT and an edited version of his presentation is now available for viewing on YouTube. It’s a truly fascinating subject and one that should open the eyes of business owners and virtually everyone, regardless of industry. A DAC can be defined as a type of single corporation that spans multiple locations simultaneously; if one location or business point fails, the operations can continue without interruption.DACs offer the ability to create organizational structures that make optimal use of autonomous agents, artificial intelligence and other advanced technology. These technologies eliminate failure points and allow for the automatic implementation of certain policies and procedures in order to ensure their authenticity at all times.An autonomous agent is a computer system that is located in a certain environment, such as the Internet, and which is capable of autonomous actions in the environment in order to meet its design objectives. It is purely software that can receive and execute instructions, but cannot manufacture products, code or develop hardware.The agents work through secure multiparty computation (SMC) protocols. These allow a group of mutually distrusting parties to compute a joint function on their private inputs. They also provide a threshold group to safeguard confidential information.If it sounds like the idea is to create robotic industries, nothing could be further from the truth. On the contrary, the goal of DAC systems and autonomous agents is to put the control back in the hands of the people. As with all blockchain data and programs, every process, step, policy, contract and negotiating strategy is stored immutably. There can never be a question about the authenticity of the details surround a particular event, because all of the details are forever and indelibly engraved in the blockchain.This ultimately means that individuals will have the control. There wouldn’t be a question over the legitimacy of a legal claim or of a news article, because everything is registered and visible on the blockchain.Blockchain technology has begun to receive a significantly higher amount of attention and this is undoubtedly going to continue as it continues to prove itself. As further adoption occurs, DACs could potentially be the future of business.Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Have BSV, will travel - to Toronto - CoinGeek", "url": "https://coingeek.com/have-bsv-will-travel-to-toronto/", "birthday": "2019-03-21T12:43:00+00:00", "date": "2019-03-21 12:43:00", "year": 2019, "month": 3, "day": 21, "content": "CoinGeek’s Toronto conference in May is offering an amazing deal. Pay in Bitcoin SV (BSV) and save yourself enough for a night on the town. Yes, there’s a discount of more than a third of the price – CAD$150 off the CAD$399 ticket – just for paying in the original Bitcoin.And CoinGeek has made it easy to pay. Just register your details as you head for the checkout, to take advantage of this special bonus offer. When you’re paying, instead of the usual credit card option, just pick the button for BitcoinSV via CoinGate.When you’ve agreed to the terms and conditions and clicked Place order, you’ll find that, with a little help from our friends at CoinGate, you’re given the price in BSV – currently an absolute bargain at only 2.763289 BSV.Then comes the crypto magic: use the QR code or copy the address to send your payment. It’s as simple as that. You’re saving money, transaction fees and time – you won’t have to wait for your next credit card statement.The Toronto conference will be celebrating the achievements and the incredible potential of Bitcoin SV, so it wouldn’t make sense for its organisers not to “eat their own dog food”, as they used to say in the world of Internet startups.So whether you’re a BSV newbie or an old hand, take advantage of your access to BSV, to save some money – and prepare yourself for the future.Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "CoinGeek Conference Toronto after-party teaser - CoinGeek", "url": "https://coingeek.com/coingeek-conference-toronto-after-party-teaser-video/", "birthday": "2019-04-03T22:01:38+00:00", "date": "2019-04-03 22:01:38", "year": 2019, "month": 4, "day": 3, "content": "We are bringing the tropics to the cold North as CoinGeek founder Calvin Ayre throws an after-party with a Caribbean flavor at the CoinGeek conference in Toronto! Don’t miss out on the fun! Buy your tickets to the conference today!Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Bitcoin London meet-up recap: Moving forward with the original Bitcoin - CoinGeek", "url": "https://coingeek.com/bitcoin-london-meet-up-recap-moving-forward-with-the-original-bitcoin-video/", "birthday": "2019-04-05T17:05:06+00:00", "date": "2019-04-05 17:05:06", "year": 2019, "month": 4, "day": 5, "content": "The first Bitcoin London meet-up of 2019 took place in Finsbury Square on Tuesday evening, April 2nd, bringing together local professionals who wish to network and learn more about the technology outlined in the original Bitcoin whitepaper.Sponsored by CoinGeek.com, the event was entitled “Moving Forward with the Original Bitcoin” and featured five quick presentations, complimentary food and drinks, networking space and the presence of Bitcoin SV (BSV) leaders such as Dr. Craig Wright and Steve Shadders of nChain and Michael Hudson of Bitstocks.Shadders, nChain’s Lead Developer, hosted an audience Q & A, covering topics such as OP_RETURNs, BSV’s unique ability to massively scale, and the recent mining of a record-breaking 128MB block and how this achievement benefits miners.“What we’re going to start to see, pretty much from now, is miners having their behavior influenced by the economic incentives of Bitcoin. We’re 10 years in and Bitcoin is now starting to exhibit the properties that it was designed to exhibit. So its almost like a second birth of Bitcoin,” Shadders told CoinGeek.com.In addition to educating delegates on the latest in Bitcoin, events like Bitcoin London’s casual meet-ups are important for nurturing the Bitcoin ecosystem and creating a sense of physical comradery in an otherwise digital setting.“We just really want to be with people and network with people. At the CoinGeek Conference we met so many intelligent people, people that are building, people that are passionate. I just love being around people that are passionate about Bitcoin,” shared Meet-up speaker $marquee Mark Allison, Enterprise Software Architect.How to engage “regular people” in everyday Bitcoin use was another topic of discussion on the night, covered by Rafa Jiménez, Co-Founder of Handcash. Jiménez explained the philosophy behind HandCash wallet development and how they strive to create wallets that the “average Joe” can easily use.“The biggest thing that we found when we arrived to the ecosystem was to improve the backups, improve the way that we can send money to other people and having local currency [displayed], what the people are using to having. These were our biggest hypotheses at the beginning of the project,” Jiménez shared.Bitcoin London’s Darren Eggenschwiler served as the evening’s moderator and also took an active role in the overall organization of the meet-up, a unique opportunity to match names to faces.“Putting something in a physical location makes it kind of real, right? I have a lot of internet friends—a lot of people here have a lot of internet friends—that develops the community in one way, but we’re developing the community at a location in person. Its different face to face, its better,” said Eggenschwiler.“I think its important that we develop small communities all over the world that foster BSV building and BSV friend-making. I’m here to make friends and business partners and we’re going to build the future,” he added.For those who want to take part in the building of BSV’s future, the next opportunity to make a difference is May 29-30 in Toronto at the CoinGeek Conference. The benefits of massive on-chain scaling for businesses, developers, miners, consumers and more will be covered and anyone interested in learning more about BSV and the Satoshi Vision is welcome.Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Dr. Craig Wright speaks at Oxford on smart contracts, written agreements - CoinGeek", "url": "https://coingeek.com/dr-craig-wright-speaks-oxford-smart-contracts-written-agreements-video/", "birthday": "2019-04-16T09:45:59+00:00", "date": "2019-04-16 09:45:59", "year": 2019, "month": 4, "day": 16, "content": "Dr. Craig Wright recently gave a presentation at Oxford University in the UK on the power of Bitcoin for contracts and written agreements. The transition to a Bitcoin-based contract is the next logical progression for legal agreements, just as we have previously witnessed changes to authorize the use of electronic signatures, email communication and more in legal and binding contracts. However, Bitcoin is able to dramatically alter the legal scope of contracts and adherence because it provides permanent records that can never be altered, can never be forged and can never be lost.If Bitcoin contracts had been around before Bernie Madoff or Enron, billions of dollars of investors’ funds could have been saved. The financial ruin brought about by both was made possible because of the ability to maintain—and cook—separate financial accountability records, with Madoff at one time having as many as eight. Depending on whom he was speaking with, a separate record was presented.There have been cases in the past where the courts have determined that even simple back-and-forth communication through email is enough to justify the legitimacy of an agreement to the point that it could be considering a legal contract. According to the UK Interpretations Act of 1978, “in writing” is defined as “Typing, printing, lithography, photography and other modes of representing or reproducing words in a visible form and expressions referring to writing are construed accordingly.” This means that any communication that is verifiable in court can be used to validate a contract between two parties.This is certainly possible with Bitcoin and, in particular, the use of OP_RETURN codes in a transaction. These codes allow the inclusion of text that can be mutually-agreed upon by both parties in a contract, and, with the inclusion of a digital signature, enable a binding and legal contract once uploaded to the blockchain.Wallets already exist to easily facilitate this capability. Both HandCash and CentBee allow a link between a transaction’s identity and a signature and, as soon as a transaction is initiated, it becomes a part of the permanent Bitcoin history.Given that Bitcoin can legitimately cover all the requirements for a contract as established by current laws, there’s no need for new legislation—the technology is flexible enough to meet the laws as they’re now written. This will ultimately make it simpler during the transition from current legal contract parameters to what is coming, a blockchain-based legal system that is more efficient and immutable.Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Are you ready for the 2nd Bitcoin SV Meetup Manila on April 20? - CoinGeek", "url": "https://coingeek.com/are-you-ready-for-the-2nd-bitcoin-sv-meetup-manila-on-april-20/", "birthday": "2019-04-18T17:29:37+00:00", "date": "2019-04-18 17:29:37", "year": 2019, "month": 4, "day": 18, "content": "It hasn’t been long since Bitcoin Jeepney went for a spin around the busy streets of Manila to promote Bitcoin SV. Now, the project that promotes the original Bitcoin, which has been rebirthed in Bitcoin SV (BSV), is revving up once again to take on Makati for the 2nd Bitcoin SV Meetup Manila.The event, which will take place at the Handlebar Grill in Makati on April 20 from 4:30 p.m. to 8:30 p.m., is a casual gathering not just for Bitcoin enthusiasts, but also for the first timers in the space to know more about BSV and how it is enabling the world’s new money.🚨🚨2nd BitcoinSV Meet-up in Manila at Handlebar grill in MakatiApril 20 2019 4:30pm -8:30pmBring your #BSV wallet for special 1 peso drinks(only payable in BSV) please like share and RT Also first 50 guest that come we have custom shirts for you at the door. #WechooseSV #BSV pic.twitter.com/0t1h80IOwI— John Goldberg (@JGPI2017) April 9, 2019Back in January, BSV supporters in Manila rang in the New Year with a casual, relaxed gathering to celebrate the grown-up version of Bitcoin with Bitcoin SV. At the time, the event organizers promised to hold another event this April so more people can join the fun. And they’re making good on that promise.Attendees to the 2nd Bitcoin SV Meetup Manila on Saturday are encouraged to download the HandCash or Centbee wallet apps so you can receive free BSV and pay for your beers at the meetup. Make sure that you have your BSV wallets on hand because there are special PHP1 ($0.019) drinks available at the bar, which are payable only with BSV.The first 50 guests will also get custom shirts at the door, according to the organizers.And for those looking forward to hitching a ride with the now famous Bitcoin Jeepney, here’s your chance: the bright green vehicle will be running on a mini route around the event’s location for four hours during the meetup. If you see it, don’t hesitate to flag it down and take a picture, and make sure to tag the organizers with #BSVPH.While we’re at it, why not come celebrate the renewed life of Bitcoin, and all the developments happening with Bitcoin SV, with all the world leaders in on-chain scaling at the CoinGeek Toronto conference this May. It’s easy to register and pay with the world’s new money. You’ll even receive a discount too by using Bitcoin SV via Coingate.Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Dr. Craig Wright: Bitcoin will move to 3 billion transactions per second - CoinGeek", "url": "https://coingeek.com/bitcoin-will-move-to-3-billion-transactions-per-second-says-dr-craig-wright-video/", "birthday": "2019-04-22T08:53:37+00:00", "date": "2019-04-22 08:53:37", "year": 2019, "month": 4, "day": 22, "content": "Bitcoin is heading for 3 billion transactions per second and beyond, according to nChain Chief Scientist Dr. Craig Wright. And this will enable the technology to play a greater role in autonomous systems and processes at a global scale.Early this year, Dr. Wright was awarded ‘best paper’ at the 2019 International Congress on Information and Communication Technology (ICICT) for his work on decentralized autonomous corporations. He presented the paper in a lecture at Brunel University in London, titled ‘A Proof of Turing Completeness in Bitcoin Script’ as part of the event.In the presentation, he explained that Bitcoin was incredibly efficient as a Turing complete machine. Dr. Wright said Bitcoin follows Turing’s idea of a simple alphabet that acts as a predicate, which can be looped as required to perform desired functions.Dr. Wright said that the 1MB limit imposed by Bitcoin Core ignores the original focus of Bitcoin, and artificially limits these capabilities. When the artificial limits are removed, Bitcoin can perform as intended, including running more complex functions, which he said will enable Bitcoin to fulfill its true potential at mass scale.In the next 10 years, Dr. Wright expects Bitcoin will move to 3 billion transactions per second and beyond, which makes the platform ideally suited to mass consumer payments and beyond.In a subsequent presentation delivered at the University of Oxford on smart contracts and written agreements, Dr. Wright went further, arguing that Bitcoin will soon operate as a platform for commercial contracts and written agreements, offering independent, autonomous and immutable proof of agreement between contracting parties.In particular, he points to the case of convicted fraudster Bernie Madoff, who kept multiple different versions of ‘cooked’ accounts in order to defraud investors—a practice which would have been impossible if agreements were handled by bitcoin at the time, as a result of the need for consensus and the immutability of bitcoin records.He said that with OP_RETURN transactions, agreements in writing between two parties can be given legal effect on an agreed basis, demonstrable in court as an enforceable written agreement.Dr. Wright, has proven beyond a doubt to ownership of CoinGeek that he was the main architect of Bitcoin, and that it was he who conceived and used the pseudonymous name of Satoshi Nakamoto, has said that only Bitcoin SV allows this functionality, which echoes the intention of the original Bitcoin white paper.Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Crypto hardware wallet firm Ledger detects desktop phishing malware - CoinGeek", "url": "https://coingeek.com/crypto-hardware-wallet-firm-ledger-detects-desktop-phishing-malware/", "birthday": "2019-04-29T13:56:33+00:00", "date": "2019-04-29 13:56:33", "year": 2019, "month": 4, "day": 29, "content": "Ledger, the popular hardware cryptocurrency wallet, has detected a phishing malware that targets desktop users. The firm announced the discovery on Twitter, urging their users to be extra vigilant. The announcement read:“WARNING: we’ve detected a malware that locally replaces the Ledger Live desktop application by a malicious one. Users of infected computers are asked to enter their 24-word recovery phrase after a fake update.”Ledger further revealed that from its research, the malware was highly targeted, only infecting Windows machines. It had also not spread widely at the time of the announcement, only being detected on one computer. To be safe, Ledger users must not give their recovery phrase to anyone, the firm advised, “It cannot compromise your device or your crypto. It’s only a phishing attempt tricking you in entering your 24 words (never do that).”Ledger assured its users that it has designed its wallets to withstand such attacks. They wrote, “Hardware wallets have been designed to protect crypto assets against this kind of attacks. Funds are safe unless users themselves give their recovery phrase to the hacker (through social trickery). Education of users is paramount to mitigate this.”Previously, the Paris-based startup issued guidelines that its users must stick to to protect themselves from such an attack. In its blog post, it warned users against ever giving their 24-word recovery phrase to anyone, even the firm itself. This phrase is meant to enable a user to recover their cryptos in the case of loss or destruction of the physical wallet. It also enables the user to clone the wallet onto a new device, giving them more freedom.Ledger users should also never store their recovery phrase on a computer or smartphone as hackers can easily compromise these devices.The firm has been immensely successful and has been earmarked to become Europe’s first crypto unicorn. In 2017, the firm sold over one million devices, posting more than $25 million in profit. Its success has brought many investors on board including Samsung’s venture capital arm, Siemens, Boost VC and the Digital Currency Group.The current malware isn’t the first time Ledger’s security has been called into question. Last year, a teen digital security expert, Saleem Rashid, reported on his blog that he had unearthed a critical flaw with Ledger’s wallet. According to Rashid, malicious actors could exploit the flaw to steal users’ crypto holdings. Ledger dismissed his claims, but went on to release an update.Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Test your gambling applications on the Bitcoin SV Scaling Test Network - CoinGeek", "url": "https://coingeek.com/test-your-gambling-applications-on-the-bitcoin-sv-scaling-test-network/", "birthday": "2019-04-29T16:07:46+00:00", "date": "2019-04-29 16:07:46", "year": 2019, "month": 4, "day": 29, "content": "If your online gambling business is considering the jump to Bitcoin SV (BSV), but you want a kick at the tires first, there’s some great news. In a recent press release, the Bitcoin Association have announced the Bitcoin SV Scaling Test Network (STN) is now open for public use.The STN provides a valuable opportunity for enterprises to test the limits of their applications on the BSV blockchain, and prove for themselves that BSV’s unlimited scaling can improve their performance. Massive blockchain scaling, only available on this network, provides the opportunity for businesses to switch to a faster, more secure network for their business applications.The Bitcoin Association’s Bitcoin SV Node project is responsible for the STN initiative. It was developed by nChain, and had funding provided for it by CoinGeek. The Professional Stress Test team, nicknamed the Satoshi Shotgun, provides transaction traffic for the initiative, and any business that signs up can use that traffic to stress test whatever applications they are thinking of introducing.Currently, the BSV network is capable of handling 128MB blocks, already proven capable of handling 83,000 transactions in a single block, and Dr. Craig Wright, chief scientist at nChain, has said the plan is for 3 billion transactions per second or more. Steve Shadders, Director of Engineering at nChain and Technical Director of the Bitcoin SV Node project, said in the release:“In the coming months, we plan to increase the maximum block size of the Scaling Test Network to a massive 10 GB (10,000 megabytes) so that it can handle tens of thousands of transactions per second. We are moving past the era of filling up blocks and stepping into the realm of boundless growth. Our goal is not to push the limits, but to prove there are no limits.”For operators who are looking to handle thousands of deposits and withdrawals per minute, in addition to hundreds of thousands of game transactions every day, this network is capable of handling all of it, providing a high level of accountability while offloading the onerous costs of data centers to the blockchain. Blockchain and Bitcoin aren’t just buzzwords anymore, you know have a safe testing environment to see how you can use them to work to your advantage.Jimmy Nguyen, Founding President of Bitcoin Association, said of the news:“Big enterprises need a blockchain that can scale to handle their big transaction volume needs. The original Bitcoin, now back in the form of Bitcoin SV, always had that power, and we are now unlocking its massive scaling capability. We encourage businesses around the world to build applications on BSV, and are happy to provide the Scaling Test Network as a resource and safe environment for growing the BSV ecosystem.”If you’re interested in testing out the network, visit https://bitcoinscaling.io/ or email stn@bitcoinsv.io to find out more and give it a try.Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Microsoft hack reveals scheme to steal from Kraken accounts - CoinGeek", "url": "https://coingeek.com/microsoft-hack-reveals-scheme-to-steal-from-kraken-accounts/", "birthday": "2019-04-30T10:35:46+00:00", "date": "2019-04-30 10:35:46", "year": 2019, "month": 4, "day": 30, "content": "A recent breach of Microsoft email accounts now has a motivation behind it. Motherboard, an outlet of Vice, reports victims of the breach are discovering their cryptocurrency exchange wallets have been emptied.The original data breach allowed hackers to gain access to Outlook, Hotmail and MSN accounts. One user, John Ritmeester, talked about how the hackers used that opportunity: “The hackers also had access to my inbox allowing them to password reset my Kraken.com account and withdrawal [sic] my Bitcoin.”The way this worked was simple enough. The hackers used their access to set up a forwarding rule, sending any email with “Kraken” mentioned in the email to their own Gmail address. They then would use the “forgot my password” feature on Kraken to send themselves a link to change the password to something new, gaining access to the Kraken account.Ritmeester discovered the whole thing when checking his email account’s deleted items, finding both a password reset email and a withdrawal request. He lost 1 Bitcoin Core (BTC).Several other users have reported similar stories. Ritmeester noted that in his case, he did not have two-factor authentication turned on in his Kraken settings, which could have prevented the whole thing.In response to the new revelations, Microsoft wrote:“Customers who believe they have been impacted beyond what was outlined in the company’s notification should contact the Microsoft support team for assistance.”Victims of the hack feel like Microsoft is deliberately holding back full details of the hack to protect themselves from liability. Ritmeester told the outlet that he plans to file a police report, and is considering holding Microsoft liable for his lost funds.Questions should also be raised if Kraken shouldn’t have a stronger security system around password resets. Considering money is at play, simply having a link sent to an email address, that might already be compromised, simply isn’t enough when some customers have thousands of dollars saved in their exchange wallet. Some verification questions at a minimum would have helped save a few accounts from having losses.The lack of security on both of Microsoft and Kraken’s part is alarming. Both companies need to prove they can do better, and be more professional about their customers’ security.Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Moody’s warns of risks posed by private blockchains - CoinGeek", "url": "https://coingeek.com/moodys-warns-of-risks-posed-by-private-blockchains/", "birthday": "2019-04-30T12:20:04+00:00", "date": "2019-04-30 12:20:04", "year": 2019, "month": 4, "day": 30, "content": "Bond credit rating firm Moody’s has released a comprehensive blockchain report in which it warns of the risks associated with private blockchains. The New York-based firm also hailed the many benefits that accrue from blockchain implementation, especially for financial firms.The report, titled ‘Blockchain Improves Operational Efficiency for Securitizations, Amid New Risks,’ examined the differences between private and public blockchains, with each having its own set of benefits and risks.Public blockchains are easier to audit as well as collect and recover data. However, their decentralized nature makes them more susceptible to attacks. The firm thus advised firms that are exploring blockchain technology to consider private blockchains. However, they must be aware of the risks that come with it. These include a weaker consensus mechanism compared to public blockchains. The report added:“Private/centralized blockchains are more exposed to fraud risk because system design and administration remains concentrated with one or few parties.”Despite the risks posed by blockchain technology, its benefits are immense. The report looked at a number of industries which would benefit greatly by integrating blockchain technology, including the securities industry. The use of smart contracts could greatly streamline the creation and management of securities, the report deduced.We are still a long way from full-on blockchain integration, however. Currently, “applications, in the near-term, will remain experimental, limited to pilot phases with a small number of participants and/or parallel processing with conventional technologies,” the report concluded.In the future, smart contracts could revolutionize the legal industry, being applied in the development of legally binding agreements. In effect, this could replace law with code, at least partly. However, scripting language used to develop smart contracts means that they are less flexible than the current systems, the report explained:“A full replacement of natural language contracts by computer code is unlikely, because of a lack of flexibility with regards to the scripting language. Furthermore, parties to a smart contract should consider governance and control mechanisms to ensure that modifications to the original contract can be made at a later stage without greater difficulties.”Despite the hurdles that come with the new technology, institutions have greatly invested in its research and development. In the past week alone, Lenovo, Philip Morris and Volkswagen have all announced blockchain initiatives.Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Quebec guarantees more power, stable costs for crypto miners - CoinGeek", "url": "https://coingeek.com/quebec-guarantees-more-power-stable-costs-for-crypto-miners/", "birthday": "2019-04-30T14:30:36+00:00", "date": "2019-04-30 14:30:36", "year": 2019, "month": 4, "day": 30, "content": "Quebec is looking to provide a bit more stability for cryptocurrency miners. In a Canadian province that already has attractive electricity rates, they will guarantee a reserved portion of their power grid for a few lucky companies.In an April 29 announcement, the Régie de L’Énergie (Energy Board) of Quebec have created a new client category for crypto miners, and guaranteed Hydro-Quebec (the local power company) would set aside 300 additional megawatts, on top of the 368MW already committed, for their use.To be eligible for this sweet deal, companies have to apply for the new client category and prove they are worthy. To get admitted, the Régie will analyze the number of jobs the company creates, how much the plan to invest in the province, and how they will handle heat recovery from equipment that runs hot.They also rejected Hydro Quebec’s preference that crypto miners bid on power supply. Instead, miners will continue paying a tariff, very much like manufacturers in the province have to pay.Quebec initially had an anti-mining stance, banning the activity for fear that it would drive up energy costs in the province. In May 2018, it reversed that stance, possibly to capitalize on its status as a low-cost destination, while other countries also added their own bans.Since July 2018, Hydro Quebec has charged CAD 0.15 ($0.11) per kilowatt-hour for cryptocurrency miners, which is double the rate that residential customers pay.As a result of those relatively low costs, Quebec has become a prime destination for crypto mining. Even in mid-2018, the province said that a quarter of all its energy was going towards the activity. Bitfarms has since made a major investment there, buying out Volta Electrique and installing 6,500 ASICs.Quebec’s new policy of offering stability to mining firms, so long as their agenda lines up with that of the economic and environmental well-being of the province, looks like a win-win situation. Quebec gets a bunch of investment and well-paid jobs, and the miners get stable electricity costs, which can be difficult to come by otherwise.Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "HTC reveals plans for new-gen blockchain smartphone in 2019 - CoinGeek", "url": "https://coingeek.com/htc-reveals-plans-for-new-gen-blockchain-smartphone-in-2019/", "birthday": "2019-05-01T08:39:51+00:00", "date": "2019-05-01 08:39:51", "year": 2019, "month": 5, "day": 1, "content": "Smartphone manufacturer HTC has become the latest to pledge support for blockchain technology, following an announcement from the firm in recent days that it intends to launch a new blockchain phone.The Taiwan-based electronics giant unveiled the plans at the Taipei 101 investment forum late last week, in a keynote speech on decentralisation delivered by HTC Decentralized Chief Officer Phil Chen, according to Taiwan News. The phone, a second-generation blockchain device, is set to be commercially available by the second half of 2019, which the firm hopes will expand its presence within the global blockchain sector.Chen said that while blockchain technology was still developing, it was already changing the world, with the promise of “tremendous commercial potential” in the future.The HTC executive was quoted by the Central News Agency saying that the value of blockchain as analogous to the commercial value of petroleum from the early 20th century, in terms of the impact he expects blockchain to make on a global economic scale.He added that the core benefit of a blockchain phone was allowing access to data with absolute privacy, which Chen said underlined the value of the technology within the telecommunications sector.The launch follows HTC’s original blockchain phone, the HTC Exodus, which was launched at the end of 2018. Since then, the firm reports sales have kept pace with expectations, prompting the decision to continue to invest in new blockchain products.In his speech, Chen also indicated the firm was looking beyond the blockchain phone to other technologies and innovation, including a broader portfolio of digital assets and investment in cryptocurrency applications.The move follows another recent announcement from HTC that the firm had set aside $50 million in a fund dedicated to developing their blockchain phone products.HTC is far from alone amongst smartphone manufacturers in exploring innovations around cryptocurrency. Samsung is now bundling some new phones with a crypto-based payments app, with some reports suggesting the firm may look to launch its own crypto token in the near future.With demand for the latest device fueled by the increasing adoption of cryptocurrencies worldwide, the move looks set to position HTC as a leading manufacturer of blockchain-powered phones. Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Dr. Craig Wright on the double hash puzzle - CoinGeek", "url": "https://coingeek.com/dr-craig-wright-on-the-double-hash-puzzle/", "birthday": "2019-05-01T08:48:24+00:00", "date": "2019-05-01 08:48:24", "year": 2019, "month": 5, "day": 1, "content": "In a recent post on Medium, Dr. Craig Wright addresses double hashes and why they were used when creating Bitcoin. As with a number of Bitcoin’s characteristics, the true story behind double hashes has been chopped up and put into a blender until a result was achieved that had nothing to do with the original design. Wright continues to publish bits and pieces to provide the real story and help to finally set the record straight on what Bitcoin is and what it isn’t.Wright explains, “We can say that if we iterate a hash n times, it makes it n times as likely that a collision will occur. I am taking some liberty here, and the [math] involved in what I’ve explained is not completely accurate, but it is true that for each time we rehash a function using the same hash function, we lose collision security for the function. In fact, if we look at how addresses in Bitcoin are created, we see that the double-hashing function increases the effect even further. In other words, the hash of the hash in the scenario is more likely to lead to a collision than a single hash or even the hash of the same hash function (a double hash).”He goes onto explain that the Wiki on Bitcoin Core (BTC) is completely wrong in its description of double-hashing. It isn’t used to increase security, as indicated, although, in addressing, if one hash function is determined to be vulnerable, the other hash function will stay secure longer.One reason for the inclusion of the double-hash function in Bitcoin is to keep individual verification functions intact as Bitcoin Scales. Asserts Wright, “[A] value [can be] sent to a miner in a way that doesn’t allow them to broadcast a block without individual transactions. In a Merkle tree structure, we could have all of the block sent and solved apart from a single transaction. Doing so would allow us to construct an ASIC mining facility that does not host the data in blocks. The miner is now a distributed function.”The function also allows for the creation of a system that is able to be distributed and validated in accordance with laws. They can act in conjunction with local jurisdictions and “allows us to have immutable data storage that can be filtered with the hash being validated and a subsequent prune of illicit material being allowed in certain jurisdictions.”Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Amazon's Managed Blockchain now open to everyone - CoinGeek", "url": "https://coingeek.com/amazons-managed-blockchain-now-open-to-everyone/", "birthday": "2019-05-01T13:05:37+00:00", "date": "2019-05-01 13:05:37", "year": 2019, "month": 5, "day": 1, "content": "Amazon announced through Amazon Web Services (AWS), its cloud computing platform subsidiary, that Amazon Managed Blockchain (AMB) is now available for general use.According to the announcement, the platform will allow customers to set up a blockchain network within their organizations. Through this platform, customers will be able to use the Ethereum and Hyperledger open source frameworks.Rahul Pathak, the General Manager, Amazon Managed Blockchain at AWS said:“Customers want to use blockchain frameworks like Ethereum and Hyperledger Fabric to create blockchain networks so they can conduct business quickly, with a permanent record of transactions, but without the need for a centralized authority. However, they find these frameworks difficult to install, configure, and manage.”The blockchain-as-a-service (BaaS) will reportedly allow businesses to develop their networks more quickly and at a lower cost. It eliminates the need for provision hardware, creates and manages certificates for access control, installs software, and configures network settings. Pathak added:“Amazon Managed Blockchain takes care of provisioning nodes, setting up the network, managing certificates, and security, and scaling the network. Customers can now get a functioning blockchain network set up quickly and easily, so they can focus on application development instead of keeping a blockchain network up and running.”In addition, AMB provides simple APIs that allow customers to vote on memberships in their networks and to scale up or down more quickly.Amazon states that AMB can scale to support thousands to millions of transactions. So far, companies like AT&T Business, Nestlé and the Singaporean investment market, the Singapore Exchange, have signed on to use Amazons Platform.AMB is available immediately in North Virginia and will soon expand to other regions hopefully next year. Additionally, QLDB will be generally available in the coming months.Last year in November when announcing the platform, Andy Jassy, the Amazon CEO said that Amazon had spent a lot of time understanding why customers want blockchain rather than a database.Amazon combined the managed service with a centralized blockchain service, Amazon Quantum Ledger Database QLDB, that is reportedly a fully managed ledger database with a central trusted authority.Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Five Canadian banks turn to blockchain for identity verification - CoinGeek", "url": "https://coingeek.com/five-canadian-banks-turn-to-blockchain-for-identity-verification/", "birthday": "2019-05-03T06:02:15+00:00", "date": "2019-05-03 06:02:15", "year": 2019, "month": 5, "day": 3, "content": "Blockchain technology is very well suited for use in identity verification, and it appears as though that some prominent Canadian banks are keen to that idea. Five of the biggest Canadian banks now allow users to digitally verify their identity through blockchain.The five banks are as follows: Canadian Imperial Bank of Commerce (CIBC), Royal Bank of Canada (RBC), Scotiabank, Toronto-Dominion (TD) Bank and Desjardins Group. All five banks have partnered with an app called Verified.me, which is backed by Toronto blockchain startup SecureKey to offer safe and secure identity verification. According to a press release, additional financial institutions – such as National Bank of Canada, and Bank of Montreal (BMO), have signed on as well.The founder and CEO of Securekey, Greg Wolfond, spoke about the ever-increasing issues with cybersecurity when announcing the developments. Wolfond said:“Verfied.me simplifies the sharing of personal information to help with identity verification in a safe way” and described protecting our digital identity as “‘one of the most enduring challenges of our time.”Verified.me aims to empower individuals with control over their digital identity, by not only protecting personal information, but also allow individuals to control who to share their information with, and when. It is built on top of IBM blockchain technology. Customers download the mobile app, and it allows encrypted information to be shared without any actual information actually being stored within the Verified.me app. The idea is to allow users to safely and securely verify their identity from their smartphone to access various services.The app works because of a network built between various companies and organizations, including telecommunications agencies, financial institutions, and credit agencies. Wolfond wants his company to help allow individuals to access sensitive information in a verifiable and convenient manner. He adds: “They’re going to be able to share their data in a secure and trusted way, which they never really could before.”Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Criminal or not? The curious case of Bitcoin Cash ABC’s new privacy-centric P2P exchange", "url": "https://coingeek.com/criminal-or-not-the-curious-case-of-bitcoin-cash-abcs-new-privacy-centric-p2p-exchange/", "birthday": "2019-03-26T09:24:07+00:00", "date": "2019-03-26 09:24:07", "year": 2019, "month": 3, "day": 26, "content": "A peer-to-peer exchange is coming to serve Bitcoin Cash ABC (BCHABC) holders soon. The exchange promises to be privacy-oriented, which means, for all intents and purposes, that it’s bound to test the anti-money laundering (AML) governance around the world.The exchange is called Local Bitcoin Cash, and it’s the project of Roger Ver’s Bitcoin.com. The P2P trading platform, once launched, will allow users to directly exchange their BCHABC holdings in a private manner. It boasts of three “key” features: privacy, end-to-end side encryption, and security “as the service never touches your funds.”The goal, according to Bitcoin.com, is to have “a great resource” for the BCHABC community and also “to promote economic freedom to everyone across the globe by introducing them to the great benefits” of the crypto coin. But do those so-called “great benefits” also apply to criminals trying to avoid AML laws?Contrary to popular belief, Bitcoin is never intended to allow for anonymous transactions. Yes, it’s designed to incorporate privacy in order to give users better control over their crypto activities. And while this feature is attractive to drug dealers, terrorists and hobbyists, it would drive enterprise businesses to more regulation-compliant options.It’s also worth noting that cryptocurrency exchanges and wallets are now being required by many regulators around the world to report suspicious activities as well as identify anonymous users. Failure to comply with Know-Your-Customer (KYC) requirements could result in serious consequences—from license suspension to severe penalty, and even jail time, such as in the case of Charlie Shrem who went to prison in 2015 over his failure to report suspicious activities on his BitInstant crypto exchange.And yes, these AML directives also apply to anonymous exchanges. For example, Helsinki-based P2P crypto exchange LocalBitcoins announced in February that it’s planning to introduce requirements for identity verification of its users. The move is part of its effort to implement the European Union’s (EU) AML regulations, also known as the 5th Anti-Money Laundering Directive (5AMLD).The 5AMLD came into effect in July 2018, although EU member states have until January 2020 to update their regulatory framework so that it complies with the new requirements. By that time, anonymous crypto transactions will be considered criminal in nature.This brings us to our earlier question: With its privacy-focused P2P exchange in the works, is BCHABC—which is no longer Bitcoin as envisioned by the original Satoshi white paper—gunning to become the criminal branch of the Bitcoin chain?Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Calvin Ayre takes legal action against crypto trolls - CoinGeek", "url": "https://coingeek.com/calvin-ayre-legal-action-crypto-trolls/", "birthday": "2019-04-02T15:43:16+00:00", "date": "2019-04-02 15:43:16", "year": 2019, "month": 4, "day": 2, "content": "Calvin Ayre has a warning for the cryptocurrency world’s social media trolls: your words can and will be used against you in a court of law.On April 1, Ayre’s attorneys served legal papers on the publishers of the UK-based Coin Rivet crypto blog, warning them that their post titled ‘You’re heading down a dark alley, John McAfee warns Calvin Ayre’ was “highly defamatory” and resulted in “serious damage” to their client’s reputation.The article in question focused on Ayre’s recent trip to Cuba and his subsequent social media posts featuring photos and videos of himself with a local all-girl dance troupe hired to perform at a party he’d hosted.Coin Rivet’s article, one of a series of posts published following the release of Ayre’s photos and videos, described the girls as “pre-teen” i.e. below the legal age of consent, and quoted McAfee saying Ayre was “wandering down a dark alley” and “dragging down” the overall crypto world.The letter sent by Ayre’s attorneys to Coin Rivet pointed out that four of the five women in Ayre’s photos and videos were 18 years or older at the time of the party, while the youngest was 17.5 years old. In other words, none of the women was “pre-teen” and all of the women were well above the legal age of consent.Ayre’s attorneys noted that no one at Coin Rivet had approached Ayre for comment before the article was published. Furthermore, Coin Rivet’s social media channels amplified the article’s circulation by promoting it as “today’s most clicked article” and “our most clicked article over the weekend and currently occupying top spot in our Trending Now section.”Following receipt of the attorneys’ letter, Coin Rivet has taken the offending articles offline, but Ayre’s attorneys aren’t stopping there. The site had also claimed that Ayre had been referred to the likes of Interpol, various police departments and child abuse charities.But other articles reveal that it was Coin Rivet writer Helen Bennicke and one of her colleagues who had themselves “contacted the authorities after seeing what Calvin Ayre had posted,” claiming that “enough people are concerned that something needs doing about Calvin” and that “to do nothing would feel immoral.”This article, titled ‘The seedy world of Calvin Ayre needs tackling,’ has also been removed from Coin Rivet but copies remain posted to sites like Yahoo News due to Coin Rivet’s deal to repurpose its material to sites with larger audiences. (Please note the Yahoo News article has now been removed but to read a copy of the Coin Rivet’s attack, click here).Ayre’s attorneys have given Coin Rivet until April 8 to respond to their demands for redress, including publishing an apology to Ayre that acknowledges the falsity of the allegations. Failure to do so will result in proceedings against the site for libel.Ayre’s attorneys are also currently monitoring a number of other groups and individuals who amplified Coin Rivet’s libel and made libelous statements of their own. Anyone who leaves these ill-advised public utterances online or continues to engage in libelous activity will soon find themselves called upon to justify their actions in court.We reached out to Coin Rivet to allow them the opportunity to explain the true source of their antagonism towards Ayre but have received no response to date. Their silence speaks volumes regarding their newfound unwillingness to support these allegations when doing so might come at a personal cost.There’s a growing consensus that the current plethora of crypto options will eventually narrow down to a single universally accepted coin. This winner-takes-all contest is increasingly being waged like an episode of Game of Thrones, with some proponents relying on the strength of their product while others resort to duplicity and backstabbing worthy of Cersei Lannister.The unfounded allegations made by the likes of Coin Rivet against Ayre have been eagerly adopted by crypto backers opposed to the Bitcoin Satoshi Vision (BSV) protocol that Ayre publicly supports.Ayre has also taken flak over his support for Craig Wright, nChain’s lead scientist and BSV’s chief architect. Ayre has publicly supported Wright’s claim to be Satoshi Nakamoto, the inventor of Bitcoin, based on Wright having privately demonstrated unequivocal evidence to support such a claim.Ayre has also publicly voiced the view that the attacks against him are intended to damage BSV’s standing in the court of public opinion and thereby elevate BSV’s rivals to a position they don’t actually deserve on their technical merits.Anyone wishing to learn the truth about BSV should attend the next CoinGeek Conference; in Toronto on May 29-30. There they’ll discover a troll-free environment in which they can learn more about BSV’s capacity for massive on-chain scaling, a feature that leaves House BSV well-positioned to vanquish the pretenders to crypto’s Iron Throne.Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Elon Musk should stay away from cryptos - CoinGeek", "url": "https://coingeek.com/elon-musk-should-stay-away-from-cryptos/", "birthday": "2019-04-04T13:05:32+00:00", "date": "2019-04-04 13:05:32", "year": 2019, "month": 4, "day": 4, "content": "April 1 is a day for jokes, and this year was no exception. Dogecoin, the cryptocurrency that started as a joke, launched a poll for who should be their imaginary CEO. Elon Musk won by a landslide.What followed next amounts to proof that neither Dogecoin, which admits to be silly, nor Musk, should be taken seriously by crypto space. Musk proclaimed that the crypto might be his favorite, setting off a wave of hype, speculation, and memes. The Tesla CEO wasn’t too proud to participate in the memes himself, tweeting a picture of a dog and captioning it “Dogecoin rulz.”He then updated his Twitter bio to indicate he was the CEO of Dogecoin, and retweeted an article from The Onion from late 2017 which satirized the industry, mocking its “imaginary internet money.”One outlet then tied Musk’s brief stint as CEO to a 30% rise in the cryptos price, which is fun to say, but is much more likely just part of a bigger bump in crypto prices. What that outlet, and many others miss, from this whimsical story, is the serious consequences it has on the greater goal of cryptocurrency adoption.The big goal in the crypto space is to convert the world over to cryptocurrency. That could be for Bitcoin Core (BTC), Bitcoin SV (BSV), or one of the many other altcoins on the market. None of that is helped by courting a CEO who just plain doesn’t care about the industry, and instead makes a mockery of it.Musk has a huge social following. Many of his fans like Tesla cars, are excited about space travel with SpaceX, or find his Boring company amusing. A large number of his followers are not well informed cryptocurrency enthusiasts. What does it mean to them when he becomes the declared CEO of a joke coin, and shares a satirical article mocking all cryptos?What the cryptocurrency space needs is a true champion, who will show the world that with a digital currency, the world can be made a better place. Musk might have faith that cryptos will do that, but this recent silliness goes to show that he’s a terrible spokesperson for the cause. That seems to be the case when he takes any interest that isn’t electric cars or space travel, as the Thai cave rescue ordeal showed. After the price of Dogecoin increased this week, Musk changed his Twitter bio to “Former Dogecoin CEO,” before recently removing the reference entirely. That’s for the best. The cryptocurrency space would be best served if Musk sticks to the things he does best.Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Disinformation campaign v. Calvin Ayre claims crypto casualties - CoinGeek", "url": "https://coingeek.com/disinformation-campaign-v-calvin-ayre-claims-crypto-casualties/", "birthday": "2019-04-08T16:48:09+00:00", "date": "2019-04-08 16:48:09", "year": 2019, "month": 4, "day": 8, "content": "The libelous disinformation campaign targeting Calvin Ayre is claiming more casualties, except this time it’s the attackers who are paying the price.Last week, lawyers for CoinGeek founder Calvin Ayre launched a legal action against cryptocurrency news site Coin Rivet, which had published several articles alleging that Ayre was guilty of improper sexual conduct with underage girls during a trip to Cuba.On April 4, Coin Rivet editorial director Darren Parkin informed Ayre’s attorneys that the site had pulled the offending articles offline, along with Coin Rivet’s social media references to the articles, “as a gesture of goodwill.”It’s worth noting that, while Coin Rivet may have pulled its offending articles offline, partner content reposts of these same articles on mainstream news sites such as Yahoo remained online until Ayre’s own media sites pointed out this discrepancy.Parkin also claimed that an article written by Coin Rivet’s Helen Bennicke – who bragged about personally alerting law enforcement agencies regarding the allegations made against Ayre because “to do nothing would feel immoral” – was “withdrawn from publication within 15 minutes of being published.” Parkin further claimed that Bennicke had “left the employment of Coin Rivet just days” after the offending post was published.The removal of Bennicke’s “opinion” article doesn’t negate the fact that someone – and given Parkin’s status as editorial director, that dubious honor would appear to be his own – approved the article’s publication in the first place. The fact that the article made it online at all suggests at least some tacit approval of the article’s subject matter.Parkin’s letter claimed that Coin Rivet now considers the matter closed, but the site has yet to address Ayre’s pursuit of a public apology for spreading these false allegations, although such public contrition won’t undo the damage caused by what Parkin referred to as this “unfortunate episode.”Parkin and Coin Rivet CEO Sheba Karamat – as well as other individuals at crypto blogs that published similar articles – are about to discover that this ‘episode’ is anything but over, as Ayre’s attorneys have responded with a new letter seeking more info on “whether others at Coin Rivet were driven by a dishonest agenda” in deciding to publish these articles.Ayre is rightly outraged by the fact that these articles not only cast aspersions on his good name, they also sullied the reputations of the female members of the dance troupe in the social media images that sparked this unjustified uproar.Ayre has been publicizing similar ‘lifestyle’ promotional material for nearly two decades now, and the internet is awash in hundreds if not thousands of images and videos of Ayre with girls in bikinis. The fact that these recent images generated such controversy is both curious and revealing.Ayre is one of the major public proponents of the Bitcoin Satoshi Vision (BSV) protocol and its unique capacity for massive on-chain scaling. Ayre maintains that BSV offers the only real hope for a cryptocurrency becoming a truly global financial platform and not just another buy-and-forget form of ‘digital gold.’Ayre’s support for BSV has made him an easy target for supporters of rival cryptocurrencies, who clearly hope that any mud that sticks to Ayre will simultaneously tarnish BSV’s public image.Ayre’s latest CoinGeek Conference is scheduled to kick off in Toronto on May 29-30. Crypto trolls are welcome to attend, but we suspect they won’t, as spreading disinformation is a lot easier to do from the safety of one’s basement. For more open-minded and less conflicted individuals, the future of money awaits in Toronto.Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Dr. Craig Wright on the reason for law - CoinGeek", "url": "https://coingeek.com/dr-craig-wright-on-the-reason-for-law/", "birthday": "2019-04-09T09:39:21+00:00", "date": "2019-04-09 09:39:21", "year": 2019, "month": 4, "day": 9, "content": "The reason for having laws should be obvious to everyone, but sometimes people need even the simplest things explained. While cramming in all of the reasons into a short article would not be possible, Bitcoin creator Dr. Craig Wright takes a stab at explaining some of the reasoning in a recent Medium post, discussing how laws are a solid foundation that can make the distinction between evidence and hearsay.In supporting his explanation, Wright refers to documents that carry his signature, as well as those of other individuals. These are samples of documents that some have tried to use against him, claiming them to be forgeries or falsifications, despite no evidence to support those claims.Wright explains, “You are responsible for what you say and print. When you make a false allegation claiming that someone has engaged in fraud and that you have proof of it because of a claim made over Twitter or some other source, you better check the probity of the source before you decide to repeat it.”He rightfully adds, “When you take something that has not even been admitted as evidence, let alone proven to be true, and you decide to use it in defaming someone, you better have deep pockets, because in time, you who defame and slander and libel will face action.”Wright is about to start court proceedings related to charges against him. It’s going to consume a significant amount of his time, but he knows he has law on his side and has the documentation to back it up. Those who have chosen to try and drag him through the mud will learn the hard way how their lack of ability to concentrate on the facts, and only chat based on supposition and hearsay, are now going to have ramifications.Wright adds, “There is a reason people in groups like Wikileaks seek to attack me, promote lies about me, and defame me. Such groups seek a world where they have power. (…) They seek a world where records are altered, changed, and copied and where they can set the truth, come back, and change it at will. (…) Anonymous and the other groups that support Wikileaks have hated me and everything I stand for a long time. They have hated me not for what they claim, but for a system that provides immutable truth that cannot be altered, a system that provides a single record that stops corruption, a system that makes fraud expensive and stops all they are supported by. With Bitcoin and Metanet, there is no reason for WikiLeaks and no way for such anonymous cowards to hide.”Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Dr. Craig Wright: ‘Crypto’ devs seek complexity, end with chaos - CoinGeek", "url": "https://coingeek.com/dr-craig-wright-crypto-devs-seek-complexity-end-with-chaos/", "birthday": "2019-04-10T03:11:23+00:00", "date": "2019-04-10 03:11:23", "year": 2019, "month": 4, "day": 10, "content": "Dr. Craig Wright has argued for preserving the simplicity of Bitcoin, and development of the protocol in line with the original whitepaper.The respected academic, cryptocurrency commentator and notable bitcoin SV advocate explained the benefits of adhering to Satoshi’s whitepaper vision of Bitcoin, as demonstrated by Bitcoin SV. Crucially, he said Bitcoin Core (BTC) developers were trying to remove the key benefits of Bitcoin in pursuit of anonymity, effectively pushing its development in the wrong direction.In a post published on Medium, Dr. Wright said the Bitcoin ecosystem was being too prescriptive in shaping the future direction of the network. He wrote, “Here lies the problem in the ‘cryptocurrency’ development community; they seek complexity, and end with chaos. Like many technocrats, they want to control the outcome and not let it evolve.”He argues that protocol must fixed, rather than flexible, and that any divergence was creating a competing protocol which is not Bitcoin as originally defined.“Miners don’t set protocol, rather the protocol is set in stone. If you change the protocol, you move away from Bitcoin. Protocol changes are not forks but rather new competing protocols with a possible airdrop,” according to the nChain chief scientist. Wright has proven beyond a doubt to ownership of CoinGeek that he was the main architect of Bitcoin, and that it was he who conceived and used the pseudonymous name of Satoshi Nakamoto.He added, “If just over 50% of the miners want to increase the size of the cap, it will rise, and many miners who are rejecting the increase will go broke. It’s how the system works. Hobby miners are forced to compete, and if they cannot, they are forced out of the network. Bitcoin was never a system designed to allow everyone to run a node. It was always destined for data centres.”Criticising crypto developers for coveting anonymity over other features, Dr. Wright said this was completely at odds with the aims of Bitcoin.“As with all of such changes, the developers behind them are seeking to create an anonymous system. They are seeking to alter the protocol within Bitcoin and create something completely different. Bitcoin was never designed to be anonymous, and yet anonymity is what they are seeking,” he noted. He suggests those promoting anonymity are doing so with a view to using BTC for illegal transactions, such as buying drugs—a strategy destined for failure long term. According to Dr. Wright:“…it is a false promotion of something that does not exist as an issue so that they can create a system that cannot be tracked easily by government and, more importantly, can lead to something they believe will act as an anonymous currency allowing drug sales. The flaw in their argument stems, as always, from the fact that in a legal system, such a desired currency is easy to stop. To have value, bitcoin needs to be easily exchanged. To be able to do so, it needs to be legal.”Now that Bitcoin has been reborn as Bitcoin SV, it has once again taken its path as the blockchain that can revolutionize global industry through a stable protocol and massive blockchain scaling. If that’s exciting to you, come to the CoinGeek Toronto conference. Registering is fast and easy, and you can save money too by registering with Bitcoin SV via Coingate.Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Bitcoin industry needs to grow up fast - CoinGeek", "url": "https://coingeek.com/bitcoin-industry-needs-to-grow-up-fast/", "birthday": "2019-04-12T13:23:01+00:00", "date": "2019-04-12 13:23:01", "year": 2019, "month": 4, "day": 12, "content": "Crypto troll avengers are assembling after one of their own was hit with a defamation claim by computer scientist Dr. Craig S. Wright.On April 11, attorneys for Wright, the individual behind the Satoshi Nakamoto pseudonym, launched a legal action against the individual behind the @Hodlonaut Twitter account. Wright’s attorneys accuse @Hodlonaut of orchestrating a “targeted campaign” to harass and libel Wright with “highly defamatory and abusive tweets.”Later that same day, the Hodlonaut account went dark, apparently spooked by CoinGeek’s coverage of the legal tiff, which included two photos believed to be the individual behind Hodlonaut. The photos, both posted via @Hodlonaut, appear to show the individual behind the account and the distinctive tattoos on each of his arms.Hodlonaut’s online supporters took exception to Wright’s offer of US$5,000 in Bitcoin Satoshi Vision (BSV) as a reward for information that can help identify the individual behind the Twitter account. As a result, some of them have temporarily changed their Twitter avatars to match Hodlonaut’s cat-in-spacesuit image, adding a hashtag variation on the “I’m Spartacus” meme.Unfortunately, that analogy would only apply if Spartacus was famous for doing some really dumb things, like publicly accusing BSV supporter Calvin Ayre of being a pedophile without a shred of evidence to support that slur.Hodlonaut deleted those tweets – and others accusing Wright of being a “very sad and pathetic scammer” and “mentally ill” – after attorneys reminded him that libel is still a crime. You know, just like Spartacus agreed to give up his quest and return to his life of slavery after learning that the Romans also had swords.And Spartacus tried to give himself up to the Romans in order to spare his men, which is the polar opposite of the road taken by Hodlonaut, who simply vanished rather than have to legally justify some of his more dubious public positions. Viewed in that light, it might be more apt for Hodlonaut’s supporters to proclaim “I’m Osama,” although that probably wouldn’t offer them the specific rebel cachet they seek.Neither Wright nor Ayre seek to crucify Hodlonaut outside the gates of Rome, but they do want to set the record straight regarding Wright’s rightful place in history at the birth of Bitcoin. They also want to ensure that other social media motormouths learn there is a price to pay for taking legally sketchy stances in public.This whole episode is further evidence of the perpetual immaturity that plagues this industry, an arrested development that needs to end if this industry is to be taken seriously. BSV is dedicated to enterprise use for this very reason.Hodlonaut is/was a public booster of the Lightning Network, the off-chain appendage intended to add slightly more transaction capacity to the irredeemably constricted Segwit Coin. So he has a clear self-interest in targeting Ayre and Wright in the hope of diminishing the public profile of BSV and preventing people from learning of its capacity for massive on-chain scaling.If you want to learn the truth about BSV and its role in the future of money in a troll-free environment, we encourage you to check out the latest CoinGeek Conference going down in Toronto on May 29-30.Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Dr. Craig Wright ratcheting up legal fight with crypto critics - CoinGeek", "url": "https://coingeek.com/craig-wright-legal-fight-crypto-critics/", "birthday": "2019-04-14T14:55:30+00:00", "date": "2019-04-14 14:55:30", "year": 2019, "month": 4, "day": 14, "content": "Computer scientist Dr. Craig S. Wright is ratcheting up his legal fight against a defamatory campaign led by conflicted crypto critics.On March 29, Dr. Wright, the individual behind the Satoshi Nakamoto pseudonym and part of the team that created Bitcoin, filed legal papers targeting the individual behind the @Hodlonaut Twitter account. Hodlonaut was accused of waging a “targeted campaign” to harass and libel Wright with “highly defamatory and abusive tweets.”On April 12, Wright’s attorneys issued similar legal papers to two individuals – Bitcoin podcast host Peter McCormack and Ethereum co-founder Vitalik Buterin – and to cryptocurrency blog Chepicap, all of which he accuses of making similarly defamatory claims that Wright is a fraud for claiming to be Satoshi.Conveniently enough, mere hours before his papers arrived, McCormack publicly (via Twitter) ‘demanded’ to be the target of such a lawsuit. McCormack subsequently told his Twitter followers that the letter from Wright’s attorneys was “nonsense,” repeated his ‘Faketoshi’ slur against Wright and invited Wright’s attorneys to “please proceed with court proceedings.” As for that latter quote, word has it that McCormack’s request will be granted on Monday.Buterin has so far said little publicly about receiving his letter, while Chepicap has posted a few dismissive articles that primarily referenced the other recipients. All of those who received letters on Friday have been given until April 23 to make formal responses, after which Wright will decide whether to proceed with libel and harassment suits.Wright’s aim in targeting individuals and sites alleging fraud is to counter the ongoing dissemination of ‘proofs’ that purport to show the falsity of his claim to the Satoshi mantle. These incorrect or invalid proofs, often cherry picked from documents that may or may not have originated from Wright, along with other hearsay and fabrications, appear to be part of a deliberate effort to discredit Wright and thus diminish his influence on the Bitcoin sector.It’s time for the Bitcoin community to finally emerge from its extended adolescence and start behaving as a serious force in the world of global finance. This isn’t going to happen if the community continues to resemble a hyperbolic Reddit thread in which death threats are exchanged over whether Han or Greedo shot first.In a more adult world, the sector’s focus would be on the technology, particularly the Bitcoin Satoshi Vision (BSV) protocol, the only one capable of the massive on-chain scaling necessary to meet the demands of a global financial platform. But until that magical day when tech trumps name-calling, here we are.Where you should be if you want to have an open and honest discussion about the future of money and blockchain technology is the next CoinGeek Conference in Toronto on May 29-30. The CoinGeek event is inclusive and welcomes everyone interested in learning about Bitcoin SV and the Satoshi Vision, even if you also support other cryptocurrency or blockchain projects. Whether or not any of Wright’s adversaries make an appearance remains to be seen, but if they do show, they need to bring better arguments to support their respective alt-coins than they have to date.Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Dr. Craig Wright calls out Adam Back, ready to prove he’s Satoshi - CoinGeek", "url": "https://coingeek.com/craig-wright-defamation-suit-adam-back-blockstream/", "birthday": "2019-04-16T16:06:24+00:00", "date": "2019-04-16 16:06:24", "year": 2019, "month": 4, "day": 16, "content": "On April 16, Dr. Craig Wright, the man behind the pseudonym Satoshi Nakamoto and a member of the team that created Bitcoin, continued his legal fight to defend himself against harassment by filing legal papers against Adam Back, CEO of Blockstream, for defamation and libel.Back (pictured above left), who invented Hashcash in the 1990s and co-founded Blockstream, has said in the past that it’s clear “from a tech perspective” that Wright (pictured right) was not Satoshi. He then tweeted on April 10 that Wright had published “fake proofs” and forgeries while also alluding to the idea that Wright had committed tax fraud.It’s worth remembering that Back has long opposed Wright’s efforts to expand the size of individual blocks on the Bitcoin blockchain. Back preferred limiting the number of possible transactions per block and forcibly herding users onto Blockstream’s Lightning Network side-chain, a model that primarily benefited Blockstream, not end users.That’s why Wright’s attempt to prove he is Satoshi Nakamoto is so threatening, and why Back would attempt to deny it. With Satoshi himself providing guidance on what Bitcoin could be, Blockstream’s plan appears all the more misguided.Wright’s legal team’s request is simple and exactly what he’s requested of his other harassers. Back merely has to retract his statements, not make them again, apologize and acknowledge the statements were false. If Back doesn’t comply, Wright will be happy to take him to court.That might be that the only way to settle all of this, and end the harassment of Wright. That’s why Wright has turned to legal recourses not only against Back, but also against Ethereum co-founder Vitalik Buterin, who has also alleged that Wright is not Satoshi. Wright is ready to stand up in court and prove that he’s Satoshi, and he dares his detractors to be adults about the whole thing and face him in a court of law. It might prove to be an ugly affair, but it’s the fairest way to end this mess once and for all.The question is if Wright’s detractors will be willing to do just that. They have so much to gain by not allowing Wright to irrefutably prove his Satoshi identity that they may want to find a way out. As damaging as a market downturn would be, Satoshi revealing himself, and proving that his original vision, now reborn as Bitcoin SV (BSV), was the right course all along, would prove far more damaging to them in the long run.Wright will prove he’s Satoshi, either by telling his story in his own time, or stepping up in court. Regardless, BSV, through its massive on-chain scaling, will prove to be a superior protocol than either Blockstream’s Bitcoin Core (BTC) with its Lightning side-chain or Ethereum. BSV has already demonstrated that Satoshi’s original vision of massive scaling is not only possible, but is a successful strategy for electronic cash and immutable data ledgers.If that original Satoshi Vision sounds right to you, even if you currently support other cryptocurrency or blockchain projects, then attend the inclusive CoinGeek Toronto conference, happening May 29-30. You can register to hear about the massive scaling plans that the BSV development team has coming, and the opportunities they will bring. Better yet, you can save money on your registration by using Bitcoin SV through Coingate.Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Bitcoin SV is a utility platform and does not need casino-style crypto only exchanges - CoinGeek", "url": "https://coingeek.com/bitcoin-sv-is-a-utility-platform-and-does-not-need-casino-style-crypto-only-exchanges/", "birthday": "2019-04-21T13:53:08+00:00", "date": "2019-04-21 13:53:08", "year": 2019, "month": 4, "day": 21, "content": "There is so much confusion out there about what Bitcoin SV (BSV) is. Yes, most by now understand that it is the original Bitcoin following the original design, protocol and vision of Satoshi Nakamoto based on the white paper and other sources. Most everyone smart also by now agrees that Craig Wright is the inventor of Bitcoin.However, the distraction caused by the endless trolling and cyberbullying of Craig and his legal efforts to stop them are not what is important. What is important is to understand the different between Bitcoin SV and all other copycat platforms and why they are all so scared of Bitcoin SV.Binance and a cartel of these altcoin-dependent exchanges just launched a delist attack on Bitcoin SV under the guise of it being about Dr. Craig Wright. I am sure the young and inexperienced leaders of Binance and the cartel think this is smart. It is not.They are right that Bitcoin SV is an existential threat for them all. Bitcoin SV is designed to be the “power everything” platform, and can scale to do everything that all other blockchain and DLT project claim to do and far, far more. It can power Internet of Things Dr. Craig Wright’s greater vision of the Metanet, where Bitcoin SV subsumes and powers the entire Internet and monetizing all data.This means that if Dr. Wright’s vision comes to pass, the world will operate on a single global blockchain, just like we operate on a single public internet. There will be no other public blockchains or cryptocurrencies, and the only tokens other than BSV itself will be financial and other real world assets tokenized on top of BSV.The Bitcoin SV vision also means that the future of crypto exchanges will change. Currently, exchanges list far too many tokens in order to inflate fee revenue from trading as many cryptocurrencies as possible and generating casino-like fervor. This model will come to an end. The future is the model of FloatSV, a newly-launched and BSV-focused exchange. As stated on its website, FloatSV “only supports tokenized real assets” and does so “by committing to list only blockchains running Proof of Work SHA256 and real assets such as commodities and currencies.” The casino style speculative exchanges without banking will ultimately cease to exist.This is the real reason Binance and some other exchanges are afraid of Bitcoin SV, and why they illegally banded together to try to incite a mob mentality on social media to harm Bitcoin SV. Craig’s legal actions to defend himself from trolling was just the excuse they choose to justify this. That and his prior social media conduct when Craig is not even on Twitter anymore.But this is the amazing part. None of these youngsters in this cartel understand that Bitcoin SV does not need the casino-style exchange to succeed. We are building a blockchain that has real utility for businesses and consumers, to enable massive amounts of real payment and data transactions, to support the BSV token with real long-term value. Therefore, its “use case” is not trading against other cryptocurrencies to make money, like the speculative investment scheme for most other tokens. It is a utility platform for the BSV token to actually be used on BSV blockchain, so it only needs fiat on and off ramps. At some point, the BSV ecosystem will also need regulated secondary markets for security and commodity tokens of real world assets, such as FloatSV is anticipating. But at no point in its life does Bitcoin SV’s ecosystem need casino-style speculative exchanges for trading against large numbers of coins that are not real assets. Bitcoin SV is a utility backbone to run everything and this makes it unique as no other blockchain platform has this plan or ability.This means that in launching this attack, all these exchange guys have done is sped up the inevitable march of regulation over their actions. This was coming anyway as on June 19th, 2018, the fifth EU Anti-Money Laundering Directive (AMLD 5) was published in the official journal of the European Union. Among other things, the EU Directive extends all the traditional anti-money laundering laws to virtual currency platforms and wallet providers. I can’t wait for this Directive to be implemented in all EU countries. I’m sure the crypto exchange landscape will quickly change.Meanwhile, all Bitcoin SV needs is to finish restoring the original Bitcoin protocol, keep it stable and keep massively scaling. If it does that, big enterprises will come build on BSV what they cannot do on other platforms, and BSV will consume – by its superior technology – the entire crypto ecosystem of the world. This is Dr. Craig Wright’s vision and that is why it really does not matter who invented Bitcoin, because he sure as hell invented Bitcoin SV and in doing this he has changed the world for the better.Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Surprisingly, Africans use crypto more for speculation than for transacting - CoinGeek", "url": "https://coingeek.com/surprisingly-africans-use-crypto-more-for-speculation-than-for-transacting/", "birthday": "2019-04-24T09:44:14+00:00", "date": "2019-04-24 09:44:14", "year": 2019, "month": 4, "day": 24, "content": "You’ve probably heard this countless times before: Africans are turning to crypto to escape the high fees that banks charge them. Many reports have indicated that the number one reason cryptos are becoming popular in Africa is as an alternative financial service. This is partly true. Cryptos are helping millions of Africans find a cheaper and faster alternative to legacy money transfer services. However, surprisingly, Africans are using cryptos more for trading and speculative reasons than for transacting.As has been well documented, Africa is the most under-banked region in the world. According to the World Bank, 66% of Africans remain unbanked, the highest such proportion in the world. Due to this, the crypto gospel has found a fertile ground in the continent. Services such as Bitpesa, Centbee and Wala have been standout successes, utilizing cryptos to give their users seamless financial services platforms.However, a majority of Africans aren’t looking at cryptos to make payments and for remittances. Instead, they are using it for speculative purposes. I recently had a talk with Eugene Madondo, an executive at Coindirect, a crypto exchange that operates in several African countries including South Africa and Kenya. According to him, a majority of Africans are using cryptos to trade and in some cases, diversify their investment portfolios. Whenever crypto prices increase ever so slightly, the activity on African crypto exchanges rises significantly. This indicates that a huge chunk of Africans who hold cryptos use them to trade.Madondo’s observation is supported by the number and distribution of crypto payment options in the continent. In Kenya, the number of retailers that process crypto payments are just a handful. Those that have continued to accept crypto payments even during the crypto winter have also seen the numbers reduce by huge proportions in the past year. Betty’s Place, a restaurant located 150 kilometers from the capital Nairobi, has been one of the standout cases. The proprietor, Beatrice Wambugu, has received global recognition for not only accepting cryptos, but for conducting seminars where she teaches about cryptos and blockchain technology.Kenya also presents a unique challenge for crypto payments. The country is the birthplace of M-Pesa, a mobile payments service that is used by over 75% of the adult population in the country. The service processes transactions in less than five seconds. Agents who facilitate the payments can be found in even the most remote locations. On the other hand, Bitcoin Core (BTC) transactions take upwards of 10 minutes on average. Sometimes, they can take up to 45 minutes. This makes paying in BTC unrealistic for most Kenyans. There are some blockchains that are much faster, such as Bitcoin SV, which processes transactions in a few seconds. Ripple’s XRP and Dash are also fast; however, merchants accepting these cryptos aren’t as popular as BTC merchants.Nigeria has done a bit better than Kenya. In the West African country, the number of stores that accept cryptos is a bit higher. In a conversation I recently had with Nathaniel Luz, an executive at Dash Nigeria, he revealed that more crypto enthusiasts are choosing to pay in cryptos. Dash Nigeria is an advocacy group that lobbies for the adoption of Dash cryptocurrency. However, Luz told me that the numbers are still quite low, with many crypto users deciding to hodl until their tokens hit peak prices again.It’s still not a lost cause. Cryptos are making inroads in the continent that has traditionally lagged behind in terms of adoption. With the use of smartphones and internet penetration increasing with each passing day, cryptos will continue to become popular and in due time, they could become the predominant transactional method in Africa.Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Dozens convinced to try Bitcoin SV after second Manila meetup - CoinGeek", "url": "https://coingeek.com/dozens-convinced-to-try-bitcoin-sv-after-second-manila-meetup/", "birthday": "2019-04-23T12:48:02+00:00", "date": "2019-04-23 12:48:02", "year": 2019, "month": 4, "day": 23, "content": "The Bitcoin Jeepney made its second stop for a meetup in Manila on April 20. It dropped by the Handlebar Grill in Makati, and Bitcoin fans came together to have a great time and share their appreciation for the reborn Bitcoin, Bitcoin SV (BSV).The event was hosted once again by John Goldberg, the mind behind the Bitcoin Jeepney and creator of the Pixel Wallet and Forever Fund. Food and drinks were available for rock bottom prices, and Goldberg provided free jeepney rides around the neighborhood for anyone who wanted to try the vehicle out.Goldberg said of the event:“Tonight’s event was full of people having a good time, talking and using Bitcoin SV. We had many users get to experience Pixel Wallet which allows user to send Bitcoin SV encoded securely into an image. The platform works on popular sites like Facebook, Telegram, WeChat, Email and many others allowing users to connect globally.”All in all, 40 BSV enthusiasts showed up to the event, joining the 50 or so regulars at the bar. That’s a pretty good turnout for an Easter Saturday in Manila, when typically, everyone tries to leave town and enjoy some time in smaller towns or at the beach.The organizers of the event convinced the bar to show an interview of Bitcoin Ambassador and CoinGeek Founder Calvin Ayre, talking to CoinGeek’s own Becky Liggero.The enthusiasm of the BSV’ers was overflowing, and got the attention of the regulars at the bar. Nearly all of the onlookers decided to sign up to either Handcash or Centbee.The event was made possible by many of the businesses that have already adopted the digital currency of the future. Goldberg said, “We would like to thank CoinGeek, Handcash, Centbee, MoneyButton, Fivebucks, SimplyCash and Streamanity. These platforms, services and wallets that we can use Bitcoin SV daily we thank everyone for coming out.”The next wish by the group was to see greater BSV adoption in the Philippines, namely by the country’s biggest exchange platform, Coins.ph. “We hope to see companies like coins.ph to start accepting BSV in the Philippines,” said Goldberg.If you missed out on the fun because you were a little too far away, maybe you can join the CoinGeek Toronto scaling conference, running May 29-30. Registration is easier than ever, and discounts are available if you use Bitcoin SV through Coingate.Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Dr. Craig Wright discusses personal device security on blockchain - CoinGeek", "url": "https://coingeek.com/dr-craig-wright-discusses-personal-device-security-on-blockchain-video/", "birthday": "2019-04-24T09:05:09+00:00", "date": "2019-04-24 09:05:09", "year": 2019, "month": 4, "day": 24, "content": "nChain Chief Scientist Dr. Craig Wright has addressed the scope for more effective personal device security through cryptography and the blockchain, in a presentation at a prestigious industry conference in London.Dr. Wright presented his thesis at the International Conference on Information and Computer Technologies (ICICT) 2019, to a packed room of leading academics at Brunel University.In the presentation, he explained that cryptographic solutions to personal device security could deliver substantial improvements in security, reducing the scope for device hacking and providing more effective defenses for smartphones and tablets.According to Dr. Wright, one of the primary advantages of blockchain device security is the ability to record immutable logs, effectively preventing hackers from operating anonymously.Hackers rely on the ability to delete logs, covering their tracks to allow deeper access into internal systems—a process which often unfolds over a protracted time period. This is made impossible with logs immutably recorded on the blockchain, which can be used to trace the origins of hacks to a device, with no opportunity for cover-up or data manipulation.He also explained how private/public key pairs could be used in ECDSA personal device security, robustly protecting against unauthorized access through multiple authentication factors. This could be adapted to allow devices such as laptops and smartphones to automatically verify and authenticate users based on blockchain data.Dr. Wright explained that this could even be achieved without an exchange of data, eliminating the potential for ‘man in the middle’ style hacks and eavesdropping through encryption and decryption.Many of the features raised in the presentation can be implemented with standard functions, with OP_RETURN transactions an example of how this type of personal device security can be executed on the bitcoin blockchain.Brunel University becomes the latest high profile institution to host Dr. Wright, coinciding with another recent presentation at the University of Oxford. His recent presentations have covered topics including how legal contracts can be handled on the blockchain and the scalability of bitcoin to 3 billion transactions/second.Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Twitter user launches developer sponsorships for CoinGeek Toronto - CoinGeek", "url": "https://coingeek.com/twitter-user-launches-developer-sponsorships-for-coingeek-toronto/", "birthday": "2019-04-26T15:17:45+00:00", "date": "2019-04-26 15:17:45", "year": 2019, "month": 4, "day": 26, "content": "It’s almost a month until the CoinGeek Toronto scaling conference, which will be held between May 29-30. In an effort to get some of the most deserving developers to Toronto to attend, an anonymous Twitter user by the handle @Street5Wall, with support from @SatoshiEngineer, started a contest to send developers to the conference.@RealCoinGeek @JimmyWinMedia -This Coingeek 2019 conference https://t.co/xCpqzCUMUm is critical to BSV. I will pay $500 each towards expenses to sponsor five BSV only Developers to attend this conference, subject to @nChainGlobal approval. If you are a BSV Dev. please PM me. Tks.— WallStreet5 (@Street5Wall) April 22, 2019In total, the duo have sponsored 13 developers, putting $500 towards the expenses of each of them to attend the event. They had help from nChain in chosing the winners, who looked into the submission of each developer to determine their merits.We heard from @Street5Wall, and he helped explain his history in Bitcoin. His interest started when the market was peaking, but he quickly grew tired of the immaturity in the space. “First saw Dr. Wright’s YouTube video of his presentation at the Bitcoin Conference in Arnhem, Netherlands, and was completely hooked,” he wrote. “It was painfully obvious to me that Craig is indeed Satoshi, and answered every last question in my mind about where this crypto ecosystem should go.”He brings a lot of financial experience to the Bitcoin SV space as well, and wants to see it thrive. “Been working on Wall Street for 20+ years,” he revealed. “The Street has been good to me, but also provided unique insight into all the inherent bottlenecks and inefficiencies that can be solved with Bitcoin (SV).”In his opinion, this is a movement that is too irresistible to stay away from. “This is a once in a lifetime paradigm shift, and I’m thrilled to be a small part of the revolution that Dr. Wright started in 2008,” he wrote to us.So not only is he excited to be part of the Bitcoin Vision, but he’s sending a baker’s dozen of developers to the Toronto conference. They’ll make Developer’s Day, taking place on May 29, much more fun. They’ll have that workshop day to meet with other developers and show off what they’ve been working on.If you want to get a look at these new applications, and marvel in the blockchain scaling available with BSV, why don’t you come to CoinGeek Toronto scaling conference as well? You can register in just seconds, and save money on your entrance fee by using Bitcoin SV with Coingate.Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "BSV Meetup Haarlem coming this week - CoinGeek", "url": "https://coingeek.com/bsv-meetup-haarlem-coming-this-week/", "birthday": "2019-04-29T09:58:12+00:00", "date": "2019-04-29 09:58:12", "year": 2019, "month": 4, "day": 29, "content": "Bitcoin SV (BSV) meetups continue to gain steam and are becoming an integral part of the BSV ecosystem. There are meetups found now throughout the world from Canada to Australia and from the Philippines to the Netherlands, and popularity is on the rise. There has also been innovation within the meetups, such as the “Bitcoin Buddy” system that forges advanced relationships between different BSV meetup groups. The first Bitcoin Buddy pair was Sydney, Australia, and Haarlem in the Netherlands, and Haarlem is beginning to receive international recognition for its meetups. “Jeff” stated on Twitter over the weekend, “This is one of the best bio’s for a #Bitcoin SV meetup I have ever read.” He included a link to the next Haarlem BSV meetup page, which highlights some of the topics that will be discussed at the meeting. Among others, attendees can talk about the launch of the FloatSV exchange, the new RelayX mobile wallet, the OpenWifiSV project and new merchants that are popping up across the Netherlands that now accept BSV. The startup takes place this Wednesday, May 1, from 2-5 p.m. It will be held at Café Aimée, which is a BSV merchant. According to Haarlem’s meetup page, “Café Aimée has great food and drink specials. They currently accept BSV if that is how you would like to pay. This meetup is education focused on Bitcoin SV, (BSV). [The meetup] is open to beginners or advanced and sets out to be fun exciting and informative.”BSV fans in Haarlem held their first meetup in February and participation continues to grow. Last month, six new attendees showed up and this next gathering should prove to be even better. The BSV ecosystem continues to expand both in adoption and in innovation. Projects like OpenWifiSV and CalendarSV are showing the strength of the network and help to increase adoption. OpenWifiSV allows anyone to log into an open Wi-Fi source and pay using the MoneyButton and CalendarSV is an “experimental on-chain calendar service” on BSV. Anyone can create a calendar, which is then permanently—and immutably—stored on the blockchain. As pointed out by the Haarlem BSV meetup group, the Netherlands has a couple new additions to its list of BSV merchants. The Noble Savage High Voltage barbershop in Den Haag and Cafetaria De Spoorbrug in Sliedrecht are now onboard. Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Dr. Craig Wright talks about protocol stability at Bitcoin Wednesday - CoinGeek", "url": "https://coingeek.com/dr-craig-wright-talks-about-protocol-stability-at-bitcoin-wednesday/", "birthday": "2019-05-02T14:38:02+00:00", "date": "2019-05-02 14:38:02", "year": 2019, "month": 5, "day": 2, "content": "Bitcoin Wednesday assembles some of the brightest minds in digital currency to talk to a live audience the first Wednesday of every month in the Netherlands. This month, nChain Chief Scientist Dr. Craig Wright joined as a speaker, and he had a lot to say about Bitcoin, and his ongoing effort to prove his pseudonymous identity as Satoshi Nakamoto.He began his talk by discussing how much the development of Bitcoin has been set back by the Bitcoin Core (BTC) development team. Dr. Wright noted that, although he was not a public figure in 2013, he was working with a team to develop new things, but all of that was set back when BTC hijacked the protocol to take it in its own ways.“What does money need?” He asked the crowd. “It needs to be stable, right? … We want to build. It’s that simple.”That’s simply not possible with how the Core team has taken BTC. “Problem with Core is that you need to check with them on what the roadmap will be because it’s unstable,” Dr. Wright explained. Developers can’t build for the future because there is no way for them to know what the protocol will be a few months down the road. As a result, businesses can’t grow, because no business can work on plans that need to change every few months.The plan for Bitcoin, now reborn as Bitcoin SV (BSV), is comparatively simple. “What if we actually have something stable, and we have something that allows people to build,” he explained. He also laid out a clear vision for how long this stability can last:“What we’re going to do is very simple. We’re going to scale Bitcoin. And we’re going to have the protocol so that a transaction that was written in 2009, and signed, will run in the year 2100, that hasn’t been on the blockchain now, that can be sent then, and will still be accepted. Now you can say that’s backwards.”He also talked extensively about how he’s tried to maintain his privacy, and never really wanted to come out as Satoshi Nakamoto. It was demanded of him though, so now he’s proving his identity his way. “I, who didn’t want to talk about my past, will do it the way I want to,” Dr. Wright declared. “In court, the way people have real rules of evidence. Things that have been built up.”He very much understands that he might be his own worst enemy in convincing people of the truth, but he knows evidence is on his side. “I’m not a good marketer,” Dr. Wright said. “I’ve learned to be better with people. I’ve learned to be different. That’s the world.”Ultimately, Wright is not focused on proving he’s Satoshi to achieve any measure of power. He explains early in the video that he’s content to be rich, he doesn’t want to be famous. Instead, he is focused on fixing Bitcoin, and setting its protocol in stone, the way his white paper originally intended it to be.If you agree with that vision, and get excited when you think about the unlimited possibilities with Bitcoin SV, join the CoinGeek Toronto scaling conference. You can save money on your registration by using Bitcoin SV via Coingate, and help decide the winners of the first ever BSV hackathon contest.Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Shellbot cryptojacking malware shuts down other cryptominers - CoinGeek", "url": "https://coingeek.com/shellbot-cryptojacking-malware-shuts-down-other-cryptominers/", "birthday": "2019-05-03T08:02:09+00:00", "date": "2019-05-03 08:02:09", "year": 2019, "month": 5, "day": 3, "content": "Cryptojacking has continued to evolve, with the hackers seeking to find new ways to mine more crypto from their victims. And now, one cryptojacking malware is going a step further by shutting down the other cryptominers in a system. In doing so, it frees up more processing power for its own cryptojacking operation.Known as Shellbot, the malware targets Linux servers that are connected to the internet and that have a weak password. After locating its victim, it then uses the SSH brute force technique to break in. This is a technique in which hackers relentlessly try out thousands of common passwords until one of them pans out.According to a report by Boston-based cyber security firm Threat Stack, a new variant of Shellbot has added some new capabilities. Once the hackers install the malicious payload on a server, they can run commands remotely as well as check the status of the malware. Once installed, the malware begins mining Monero, a crypto that has proven popular with cryptojackers due to its ease of mining and supposed anonymity.The Shellbot malware, which was first discovered by cyber security firm Jask, sends the mined Monero tokens to a MoneroHash server. Threat Stack found that the malware was making $300 a day. As it infects more servers, this figure could skyrocket.The Threat Stack team also believes that the threat goes beyond cryptojacking. Shellbot’s ability to evolve and add new features could allow it to target its victims in more ways than one.Threat Stack’s chief security officer Sam Bisbee told TechCrunch:“The threat actors behind this campaign have shown the ability and willingness to update this malware with new functionality after it has gained a foothold on an infected system. They are fully capable of using this malware to exfiltrate, ransom or destroy data.”Threat Stack found the malware on a Linux server belonging to one of its clients. It withheld the client’s name, only revealing that it’s a U.S company with international operations. The infected server was shut down after the security team realized that the hackers were using it to target other vulnerable machines.Just recently, a report revealed that over 150,000 Electrum wallets have been infected with malware. The hackers have already stolen over $4.6 million worth of Bitcoin Core (BTC).Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "New Washington State law gives blockchain records legal validity - CoinGeek", "url": "https://coingeek.com/new-washington-state-law-gives-blockchain-records-legal-validity/", "birthday": "2019-05-03T08:13:57+00:00", "date": "2019-05-03 08:13:57", "year": 2019, "month": 5, "day": 3, "content": "Washington State has passed a bill that makes blockchain records legally valid. The bill officially accords the same validity to blockchain records that all the other electronic records have in the state.The bill also provides legal definitions for the ‘distributed ledger’ and ‘blockchain’, further cementing the validity of the technology in the state. It defines blockchain as a “cryptographically secured, chronological, and decentralized consensus ledger or consensus database maintained via internet, peer-to-peer network, or other similar interaction.”The bill, which was signed into law by Governor Jay Inslee, includes a clause that explicitly protects blockchain records from discrimination:“An electronic record may not be denied legal effect, validity, or enforceability solely because it is generated, communicated, received, or stored using distributed ledger technology.”The bill was introduced on January 25 by four Washington legislators. It sought to revise the longstanding “Washington Electronic Authentication Act” which guides the state’s law in matters relating to electronic records. After going through the mandatory readings, it was voted into law by an overwhelming 96-1 majority.The new law is expected to go a long way in encouraging more companies in the state to implement distributed ledger technology in their operations. It assures these companies that any records they store on the blockchain are legally valid.Washington becomes the latest state that seeks to become the leader in the advancement of blockchain technology. Last month, lawmakers in the state of Utah tabled a bill that seeks to exempt blockchain companies from being classified as money transmitters. This would free them of the scrutiny that such businesses face, especially due to the Money Transmitter Act. The bill also sought to create a taskforce that would be solely responsible for drafting blockchain-related regulations.Utah joined other pioneering states such as Wyoming, Pennsylvania, Ohio and Indiana, all of whom have kick-started processes that are meant to foster blockchain advancement.Wyoming in particular has taken the lead in blockchain regulation. The state passed five bills two months ago that seek to boost blockchain technology. The state even has a blockchain task force led by the former Morgan Stanley and Credit Suisse executive Caitlin Long. Their efforts haven’t gone unrewarded with startups like BeefChain, which recently acquired a USDA certification, springing up in the state. Furthermore, IOHK, the company behind Stellar cryptocurrency reportedly revealed it’s moving its offices from Hong Kong to Wyoming.Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "BitBoss releases javascript library for Bitcoin SV wallets - CoinGeek", "url": "https://coingeek.com/bitboss-releases-javascript-library-for-bitcoin-sv-wallets/", "birthday": "2019-05-06T00:44:50+00:00", "date": "2019-05-06 00:44:50", "year": 2019, "month": 5, "day": 6, "content": "There’s another exciting new release for the Bitcoin SV (BSV) blockchain. BitBoss, a company that specializes in blockchain gaming innovations, has released Keyring, a new collection javascript libraries for BSV.The Keyring libraries, hosted on GitHub and at npm at @keyring/bsv, will help developers to code apps that can create and sign BSV transactions, allowing them to easily create new wallets. Alex Shore, chief technical officer of BitBoss, told CoinGeek:“We built Keyring for our own needs while developing our online gaming ecosystem that runs on Bitcoin SV, however we plan to enhance this library in an effort to help the entire Bitcoin SV community of developers. All contributions of code, feedback, and feature requests are welcome. We will be using GitHub issues to track work and will monitor it closely.”Keyring has been designed to work with BSV first and foremost, and it uses all of BSV’s functionality, including support for larger OP_Return sizes. Their website states, “With KeyRing it is very easy to add new op returns and script templates because of how the library is designed to work with multiple chains.”This new addition to the BSV development community demonstrates once again the maturity and collaboration present in the Bitcoin industry. BitBoss are first and foremost game developers though, and their website has sneak peeks into several gaming innovations they are currently working on, including blockchain-based slots, lotteries and a sportsbook.This is a timely new resource for BSV, considering the Bitcoin Association recently announced the unveiling of the Bitcoin SV Scaling Test Network (STN). Developers and businesses now have easy to use code to help develop new applications with, and a professional test environment to fully stress test those applications for their business needs. Considering Keyring was built as a part of gaming development already, this is a perfect combination for gambling applications that need wallet applications tested on a massive scale.This also adds to the education tools already released by Money Button. Their CEO, Ryan X. Charles, announced a suite of resources for developers to learn from, which has expanded to over a dozen articles since its release in March.If you’re a developer who’s interested in using these new Keyring resources, you might be interested to join the upcoming CoinGeek Toronto scaling conference as well. Winners of the first BSV hackathon will be announced, and you can register now to be there. Save money on your entry too by paying with Bitcoin SV via Coingate.Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Beware of BCH troll miner posing as ‘Satoshi Nakamoto’ - CoinGeek", "url": "https://coingeek.com/beware-of-bch-troll-miner-posing-as-satoshi-nakamoto/", "birthday": "2019-05-03T11:54:10+00:00", "date": "2019-05-03 11:54:10", "year": 2019, "month": 5, "day": 3, "content": "A mysterious entity has suddenly begun mining significant volumes of Bitcoin Cash (BCHABC), leading to a wave of suspicion through the network.Going by the name of Satoshi Nakamoto, after the pseudonym used by Bitcoin’s creator, the miner has grown to control close to 40% of the overall hash rate of BCHABC, according to Coin.Dance data.The unknown miner first appeared around one week ago, and has already grown to account for a substantial share of the overall mining pool. This has led to the finger of suspicion being pointed at Bitcoin SV proponents, specifically nChain Chief Scientist Dr. Craig Wright and Calvin Ayre, as well as the suggestion that the CoinGeek mining pool is somehow involved. Ayre, however, has confirmed that neither he nor Wright—the real Satoshi Nakamoto—is involved in this shenanigan.nobody working on real #Bitcoin #BSV even has time to think about the dogs breakfast Alphabet soup has forked to…this is not me and I don't believe Craigs pool has that much hash. But this is funny in its stupidity.https://t.co/2ayvWhKcaG— Calvin Ayre (@CalvinAyre) April 30, 2019Posing as Satoshi Nakamoto to mine BCHABC is among the growing number of attempts to discredit Dr. Craig Wright as he continues his pursuit of justice against those who seek to deny his claim to being the individual behind the pseudonym. Dr. Wright has proven beyond a doubt to ownership of CoinGeek that he was the main architect of Bitcoin, and that it was he who conceived and used the pseudonymous name of Satoshi Nakamoto.In late 2018, some group took it upon themselves to create a Craig S Wright coin—clearly another attack on Dr. Wright by the Ethereum crowd. It’s worth noting that Vitalik Buterin, co-founder of Ethereum, is already facing libel charges following his defamatory comments against Dr. Wright. Buterin has made several statements in the past, in which he called Wright a fraud and questioned why the industry allowed him to speak at conferences.It’s evident that the attacks against Dr. Wright are primarily intended to trash the Bitcoin Satoshi Vision (BSV) protocol that the nChain chief scientist supports. Wright maintains that BSV is the real target due to its capacity for massive on-chain scaling, which represents an existential threat to the future of other cryptocurrencies.If you want to learn more about the future of cryptocurrency with no limits, join the upcoming CoinGeek Conference in Toronto on May 29-30. Expect lively debates among crypto advocates in a troll-free environment that will focus on the technology and innovation.Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Square sets a record revenue, profits still low - CoinGeek", "url": "https://coingeek.com/square-sets-a-record-revenue-profits-still-low/", "birthday": "2019-05-03T08:20:17+00:00", "date": "2019-05-03 08:20:17", "year": 2019, "month": 5, "day": 3, "content": "US payments company Square announced its highest-ever revenue from its sale of Bitcoin Core (BTC). The company revealed in its report to investors that it had generated $65.5 million in BTC revenue in the first quarter of this year. The figure represents a 25 percent increase from the previous quarter where the company generated $52.4 million in revenue from BTC sales.However, the unaudited report revealed that the firm is still struggling with a small profit margin. From its $65.5 million in sales, it only generated $832,000 in profits. While the profit is still 70 percent higher than it was in the last quarter of 2018, it’s yet to hit the figures many expect from the operation. The company also revealed that its total revenue grew 43 percent to stand at $959 million.The report by Square goes against the grim picture that many crypto skeptics have painted. According to them, interest in cryptos has fizzled out in the past year. However, it seems that it hasn’t and interest is growing at a high rate. What’s more, Square has recorded a rising interest in its BTC product for the past four quarters. In 2018, the company sold more than $166 million worth of BTC.Crypto researcher and analyst Ryan Todd took to Twitter to explain just how significant the announcement by Square was. According to him, accounting for the change in BTC prices, the volume on Square is up more than 70 percent.Square just reported a record $65.5m in quarterly bitcoin sales. Assuming average BTC prices in 1Q19 (not perfect) that translates to ~ 17K worth of BTC volume, up over 70% since 4Q and +5x volumes in 1Q18. Impressive considering April's run hits 2Q's numbers pic.twitter.com/6oV2OnnNW2— Ryan Todd (@_RJTodd) May 1, 2019Founded by Twitter CEO and co-founder Jack Dorsey, Square has done more than just offer a crypto purchasing platform. Recently, Jack announced that Square Crypto would hire engineers to develop a better crypto ecosystem. The engineers would report to him directly and would be paid in crypto.Despite all the efforts, not everyone has been impressed with Square’s efforts. To some, Jack has managed to manipulate the crypto community into becoming die-hard Square fans. One of the people who share this opinion is Cobra Bitcoin, the anonymous owner of Bitcoin.org. He took to Twitter to criticize Jack and Square:Gotta respect how hard @sqcrypto is pandering to Bitcoiners. Very clever how @Jack has embedded himself in the community; in return the community promotes @CashApp, which gives that service a small but dedicated and activist group of early users.— Cøbra (@CobraBitcoin) April 10, 2019Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Crypto market daily report – May 3, 2019 - CoinGeek", "url": "https://coingeek.com/crypto-market-daily-report-may-3-2019/", "birthday": "2019-05-03T08:27:42+00:00", "date": "2019-05-03 08:27:42", "year": 2019, "month": 5, "day": 3, "content": "The cryptocurrency markets demonstrated some good movement on Friday morning with Bitcoin Core (BTC) breaching the $5,600 mark briefly on the back of high turnover. However, that positive movement of around 3% was not actually replicated in other currencies which continued showing signs of slow momentum. Ethereum (ETH) was up by around 2% to the $164 level, whilst Ripple (XRP) was practically flat at just over the $0.30 level. Bitcoin SV (BSV) was also up by around 2% to touch the $55 level on the back of increased interest and turnover.Other coins with larger market caps also demonstrated slight gains with BCHABC up by around 2% to the $275 level, whilst Litecoin (LTC) was up by around 3% to the $75 level. EOS rose by a similar percentage and seemed to be touching the $5 level quite soon where it was trading at around $4.90 at press time on Friday. NEO was up by around 2% to the $9.95 level and was poised to break the $10 mark at any time. Conversely, Stellar Lumens (XLM) was rather flat at just over the $0.10 mark on the back of a 0.7% increase. Cardano (ADA) was up by around 4% to the $0.071 level, whilst IOTA continued languishing after its massive rise at the beginning of the week on the back of its partnership announcement with Land Rover and was trading at around $0.286 at press time on Friday.Currencies with smaller market caps had mixed performances with most registering good increases although others fell behind. Amongst the best performers were ATOM and QTUM, which were up by 9 and 7% respectively, whilst BAT, MATIC and FET all dropped with their decreases ranging from 2% to 9% respectively. Other coins that showed positive movement were Ethereum Classic (ETC) which was up by around 1% to the $5.85 level, and Binance Coin (BNB) which continued recovering from its recent slump and was trading at around $23.90 or an increase of 7% at press time on Friday.Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Bitmain's S9 architect jumps ship, possible signal of trouble ahead - CoinGeek", "url": "https://coingeek.com/bitmains-s9-architect-jumps-ship-possible-signal-of-trouble-ahead/", "birthday": "2019-05-03T09:32:07+00:00", "date": "2019-05-03 09:32:07", "year": 2019, "month": 5, "day": 3, "content": "As quickly as it rose to prominence, cryptocurrency mining giant Bitmain has fallen. It has had an extremely rough 12 months and has had to shutter many of its operations this year as its losses mount. It was also forced to back out of its planned initial public offering (IPO) over financial concerns, which hasn’t left investors too happy, and the company still doesn’t appear to be able to find its footing. Now, the architect behind its S7 and S9 mining rigs is out, which could signal another nail in the coffin for the company.According to Twitter user BTCKING555, who routinely provides the inside scoop on Bitmain’s activities, tweeted, “Sources say Dr. Yang who led S7 and S9 and left to start Shenma has better chip on 8/10nm node. Letting Dr. Yang and his team go was probably as dumb as selling all of the [Bitcoin Core] and going all in for BCH [Bitcoin Cash].”If that is the case, Bitmain has lost one of its most important sources of talent. The move doesn’t bode well for the future of the company. BTCKING555 also made another telling revelation that could be a further example of the troubles Bitmain is experiencing. He said, “Breaking: TSMC [Taiwan Semiconductor Manufacturing Company] did not give Bitmain capacity! All given to 5G customers. There is nothing until Q4. Bitmain has ruined reputation and TSMC puts it in “low priority” customer list. Antminer 17 will be in very limited capacity – OK yield wafers perhaps 1200 at most! That’s peanuts.”The move isn’t surprising, given that Bitmain at one point had an outstanding debt of $1 billion with the tech company. It took a year to make good on $700 million of the amount owed. TSMC has also reportedly run out of 7nm-capacity processors, which Bitmain needs for its rigs, because it sold them to companies that paid their bills—Apple, Huawei, AMD, Qualcomm and others.Bitmain has been facing several lawsuits and is reportedly deep in debt. The company has allegedly been cherry-picking S15 miners, from a pool of 1,000, to try and show off its wares to investors in order to raise capital. That would mean that it doesn’t feel comfortable trying to impress potential investors with any of its new stock. Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Facebook moving on crypto payments solution, codenamed Libra - CoinGeek", "url": "https://coingeek.com/facebook-moving-on-crypto-payments-solution-codenamed-libra/", "birthday": "2019-05-03T09:59:27+00:00", "date": "2019-05-03 09:59:27", "year": 2019, "month": 5, "day": 3, "content": "Facebook’s plans to introduce a blockchain-based payment system and an accompanying cryptocurrency are apparently kicking into overdrive. According to a report by the Wall Street Journal, the company has begun to recruit financial firms and merchants to assist in the launch of its crypto payments system, which is reportedly being dubbed Project Libra.Facebook has been in touch with Visa and Mastercard, as well as First Data Corp, a payment processor, according to sources. It is also looking to receive around $1 billion in investment funds, which would be used to protect the company’s new digital currency, the Facebook Coin, from volatility. The social media giant is also apparently in discussion with ecommerce merchants about accepting the coin and is willing to accept small investments from those merchants to help it reach its investment goal.How the system will play out isn’t completely understood. Facebook has been relatively silent, offering only that it is exploring different options. There has been talk that users could earn crypto for their activity on the platform—as well as for watching advertising—and that the system would allow for crypto transactions across a variety of platforms owned by Facebook, including WhatsApp, Messenger and Instagram.In a blanket statement offered by Facebook previously, it only stated, “Like many other companies Facebook is exploring ways to leverage the power of blockchain technology. This new small team is exploring many different applications. We don’t have anything further to share.”One of the biggest concerns being raised is whether or not Facebook will be able to manage a blockchain solution adequately. Its track record of protecting customer data is anything but stellar and it has repeatedly suffered breaches or internal glitches that have exposed the personal information of millions of its customers. There is nothing to say that the same wouldn’t happen with a blockchain project such as Libra.However, some argue that the only way for Facebook to overcome its issues is by embracing the blockchain. One of these is Henry Liu, a former company employee who is now a managing partner of blockchain investment firm YGC. He argues, “Payments and commerce are Facebook’s only way out from its freemium, advertisement business model.”Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "World Gold Council responds to #DropGold campaign - CoinGeek", "url": "https://coingeek.com/world-gold-council-responds-to-dropgold-campaign/", "birthday": "2019-05-03T10:08:53+00:00", "date": "2019-05-03 10:08:53", "year": 2019, "month": 5, "day": 3, "content": "Grayscale Investments launched a campaign recently that lobbies for investors to dump gold in favor of cryptocurrencies. The campaign, #DropGold, has the World Gold Council (WGC) in a frenzy and the group has now responded in an effort to try and prevent any major switches from the precious metal to the precious currency. The WGC most likely feels threatened by the solid arguments offered by Grayscale. For example, the DropGold website asserts, “Ever tried to pull your weight in gold? We’re living in a digital world, a new financial era where bitcoin is displacing gold. While a gold bar weighs around 25.7 pounds, bitcoin is weightless and can be bought, sold, and transferred as easily as a text message.”In an effort to support Gold as the real king, WGC Manager of Investment Research Adam Perlaky penned a blog post entitled, “Cryptocurrencies are no replacement for gold.” He starts off by saying, “Although cryptocurrencies and blockchain technology look promising as a whole, they clearly do not represent a substitute for gold either in theory or in practice” and provides several reasons to support his position. He points out that gold is less volatile, has a liquid market, is traded in according with established regulations and is a “safe-haven investment.”What he leaves out is that gold’s value can be—and has been—manipulated time and time again. According to a report by NASDAQ from 2018, “There are several variations to the theory, but the general belief is that precious metals like gold and silver are under the thumb of central banks and other large banks, which use high frequency trading (HFT) as well as derivatives (aka naked shorts) to tamp down prices. There are also worries about discrepancies between paper gold and physical bullion in systems such as the London Bullion Market Association (LBMA) Gold Price.”That same “central bank” is the one that manipulates fiat prices, as well. This was part of the reason Bitcoin was first conceptualized, allowing users to regain control over their money, without relying on central banks or governments that can change values virtually on a whim.At least Perlaky was nice enough to give credit to blockchains and crypto in his post. He concluded that the MGC continues “to acknowledge the innovation taking place in the cryptocurrency and blockchain spaces and believe there will be a role for this technology in the future,” but that they feel that “cryptocurrencies are not a replacement for gold and gold should remain a component in all investment portfolios.”Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "New Zealand church under fire for allegedly helping OneCoin scam - CoinGeek", "url": "https://coingeek.com/new-zealand-church-under-fire-for-allegedly-helping-onecoin-scam/", "birthday": "2019-05-03T10:11:16+00:00", "date": "2019-05-03 10:11:16", "year": 2019, "month": 5, "day": 3, "content": "Cryptocurrency scams can have no limits for what types of communities they affect. OneCoin, a project which has already been called out for the scam that it is in multiple countries, has now been linked to a New Zealand church, but they deny all involvement in the scheme.The Samoan Independent Seventh Day Adventist Church (SISDAC) in New Zealand was linked to the OneCoin Ponzi scheme by a police report, and then specifically called out by Samoa’s Central bank, reports RadioNz. In their investigation, they found that hundreds of Samoans were scammed out of their money, and three in particular had lost NZ$28,000 (US$18,500).“It makes you happy and believe that this is a future for the family,” said one woman, talking about the hopes and dreams their investment gave them. “We don’t believe anything anymore.”Another victim told the outlet, “I really want to just put it to a stop, just to the people that have been affected.”SISDAC was tied to the scam because a OneCoin employee used the church “to reach a vast network of would-be investors.” New Zealand authorities specifically accused the church of participating in the scam. OneCoin was banned in Samoa in 2018, and much of the investment seen around SISDAC came after the ban went into place.SISFAC has fired back, publishing a letter on their Facebook page, denying that they knowingly participated in the Ponzi scheme. They denied any participating in the scam, writing:“SISDAC has never knowingly participated or colluded in any way shape or form with any individual or organisation in this type of illegal activity.”Not happy to just deny the accusation, SISDAC is also exploring legal action against the Samoan government for defamation.OneCoin investigations are happening around the world. Two were charged in Singapore in April for promoting the scam, and four more were charged in China in May last year. The leaders of the scheme have been charged in the United States for starting the Ponzi scheme. It’s estimated that the operation roped in more than 3 million members by the time the crackdown started getting serious.Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "South Korea regulator adds 9 blockchain firms in new sandbox cohort - CoinGeek", "url": "https://coingeek.com/south-korea-regulator-adds-9-blockchain-firms-in-new-sandbox-cohort/", "birthday": "2019-05-03T10:29:57+00:00", "date": "2019-05-03 10:29:57", "year": 2019, "month": 5, "day": 3, "content": "South Korea’s financial regulator has announced nine new firms to be included in its latest regulatory sandbox cohort, including firms specializing in blockchain and related technologies.The Financial Services Commission (FSC), which is responsible for overseeing financial services regulation in the country, announced the companies, which will benefit from a relaxed compliance regime for the duration of the program.According to the regulator, the sandbox is designed to allow companies to innovate and develop new products, without having to meet the same compliance standard as non-sandbox operators. The FSC hopes the program will encourage firms with commercial potential by providing a more suitable regulatory environment for testing new products and technologies on consumers, whilst still operating in a live environment.The program, which was launched in January 2018, allows firms up to four years in the sandbox, and the lack of regulatory restrictions makes winning approval a significant advantage for blockchain companies.The regulator said some 105 companies had applied to take part in the program since its launch, and the news that blockchain firms are included within the cohort is another vote of confidence in the huge commercial potential of blockchain. As of May 2, 18 services have already been approved to be tested in the financial regulatory sandbox, according to the FSC.The specific companies included have not yet been specified, though further announcements are expected in the coming days.Regulatory sandbox schemes have become increasingly common, with regulators in jurisdictions worldwide choosing to use a similar, relaxed regulatory environment for blockchain startups.The news from South Korea comes just days after the U.K. Financial Conduct Authority (FCA) announced the companies named in its latest regulatory sandbox cohort, where blockchain companies were again overrepresented.Among them, ecommerce payments firm Nuggets and Diro Labs, “an identity verification service that can verify any person or document online directly from the original source”, were amongst the blockchain companies to win their place in the sandbox program.During the sandbox period, the Financial Services Commission will work closely with firms to determine the legal boundaries of their testing, while ensuring the firms have room to innovate freely in developing their products.Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Canada, Singapore central banks trial cross-border blockchain payments - CoinGeek", "url": "https://coingeek.com/canada-singapore-central-banks-trial-cross-border-blockchain-payments/", "birthday": "2019-05-03T10:38:39+00:00", "date": "2019-05-03 10:38:39", "year": 2019, "month": 5, "day": 3, "content": "Central banks in Canada and Singapore have successfully sent funds via a cross-border blockchain transaction, in the first trial of its kind ever held by central banking authorities.The Monetary Authority of Singapore, the de facto central bank of Singapore, teamed up with the Bank of Canada for the pilot transaction, which saw the banks link their existing experimental blockchain infrastructure to facilitate the transaction.The success is all the more remarkable that the banks had joined payment networks built on two different DLT technologies, Project Ubin and Project Jasper.The project was conducted with support from Accenture and JP Morgan, and was developed on the Corda infrastructure. Scott Hendry, Bank of Canada Senior Special Director, Financial Technology, said the trial could lead to reduced costs and improved traceability in central bank payments in future. He noted:“The world of cross-border payments is complicated and expensive: our exploratory journey into the use of DLT to try to reduce some of the costs and improve traceability of these payments has yielded many lessons.“The importance of international cooperation through projects such as this one cannot be underestimated. Only through continued collaboration and fundamental research will it be possible for this technology to mature and for policy-makers to fully understand its potential.”Sopnendu Mohanty, Chief FinTech Officer of the Monetary Authority of Singapore, said the next focus was on global central bank cooperation around distributed ledger technology.“The next wave of central bank blockchain projects can make further progress by bringing technology exploration together with policy questions about the future of cross-border payments. It is challenging work, and we welcome other central banks to join us in this global collaboration, to bring benefit to consumers, businesses and the broader financial industry,” he explained.Cross-border blockchain payments allow parties to transfer funds with quicker, at a lower cost and with more accountability, amongst the many other advantages afforded by the technology.With the first transaction now hailed a success, no doubt more central banks will be looking at their own blockchain research more closely.Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "NYPD and crypto companies unite against crypto scam - CoinGeek", "url": "https://coingeek.com/nypd-and-crypto-companies-unite-against-crypto-scam/", "birthday": "2019-05-03T12:16:01+00:00", "date": "2019-05-03 12:16:01", "year": 2019, "month": 5, "day": 3, "content": "An increase of crypto-related crimes has forced the New York Police Department (NYPD) to bring onboard companies that operate crypto ATMs.According to the announcement, police in New York will allow these companies to participate in their crypto related investigations. This follows the recent crypto scams in the area. The police explained:“Victims are contacted by the ‘Social Security Administration’ and advised that their Social Security number has been used to open numerous accounts or is involved in some sort of drug trafficking or money laundering operation. To protect their money or to avoid being arrested, victims have to send various sums of money to help resolve the situation. The most common forms of payment requested are prepaid gift cards, Bitcoin and bank wire transfers.”To combat all these activities, the NYPD want help from players in the industry. Police explained that they will be working with crypto ATM providers “regarding their electronic scam messaging and texts and placing NYPD Scam Alert Cards at stores where machines are located.”Authorities further explained:“In many of the cases, a person posing as a ‘Police Officer’ or ‘Law Enforcement Official’ will intimidate or threaten victims to gain compliance. Victims are told that they will be arrested and/or their assets will be frozen. Scammers have claimed to be NYPD, FBI, NYS Police, Texas PD, and LAPD.”The most recent case happened in Berkeley, California. A man claiming to be Officer Neil Matthew, with the Berkeley Police Department, called a young woman, claiming that she was being investigated for drug trafficking and fraudulent activities. The man demanded she sends him Bitcoin Core (BTC) to avoid being arrested. The man called her with multiple numbers, some well concealed to look like a real police lines.These tactics are used to exploit more from victims. Criminals are targeting people with little or no knowledge of cryptocurrencies. Authorities have asked members of the public to be more vigilant when instances like this happen to them. Victims should contact authorities or seek help from a person with enough knowledge about digital currencies. Authorities recommend contacting local police before making any payments.In their announcement, the NYPD wrote to the public:“Individuals will never be contacted by the NYPD, Social Security Administration or any Law Enforcement Agency and be asked to submit money or information over the phone. If contacted by anyone claiming to represent any such agency and asking for money, New Yorkers should immediately hang up the phone.”Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Blockchain firm Vanbex sues ex-contractor for defamatory statements - CoinGeek", "url": "https://coingeek.com/blockchain-firm-vanbex-sues-ex-contractor-for-defamatory-statements/", "birthday": "2019-05-03T13:19:33+00:00", "date": "2019-05-03 13:19:33", "year": 2019, "month": 5, "day": 3, "content": "Canadian blockchain and cryptocurrency consulting firm Vanbex has filed a suit against one of its former contractors. The suit alleges that Kip Warner, who worked briefly with the firm, made false and defamatory statements against the firm.Warner made the statements to one of his associates in the Vancouver Police Department. He also allegedly spread the false information to the Royal Canadian Mounted Police (RCMP). The suit was filed in the Supreme Court of British Columbia. It alleges that Warner either made the statements knowing they were false or “alternatively, with reckless indifference to whether they were true or false, and for the main purpose of harming Kevin Hobbs, Lisa Cheng, and their company Vanbex.”In a press release announcing the suit, Vanbex further pointed to Warner’s history of being a conspiracy theorist. In April last year, he was one of the plaintiffs in a lawsuit that accused Google of collecting information on its users without their consent. He is also a 9/11 conspiracy theorist, having written a long public letter to the government accusing a group of bankers with the horrific attacks.The information that Warner gave to the authorities has caused great damage to the company, Vanbex further pointed out:“Warner knew the information he gave them was false and misleading. The suit further alleges that based on false information provided and perpetuated by Mr. Warner, the British Columbia Director of Civil Forfeiture filed a claim against Vanbex. Hobbs and Cheng have vigorously denied the Director’s allegations.”Due to the investigations, Vanbex has falsely been portrayed a crypto scam.The founders, Hobbs and Cheng, concluded by reiterating that they would defend themselves and their employees against the malicious accusations:“Vanbex has great employees and great products. We will defend ourselves vigorously with the truth. We will defend our business and the right to do our business. Our company is entirely lawful. We have acted properly. This is an insult to our 26 employees and their hard work.”Last month, Canadian police reportedly froze assets owned by the company as part of its investigation against fraud committed by the firm. As we reported, the founders of the firm were looking at spending time in jail if the fraud claims were proven.Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "US prosecutors move to detain crypto shadow banking defendant - CoinGeek", "url": "https://coingeek.com/us-prosecutors-move-to-detain-crypto-shadow-banking-defendant/", "birthday": "2019-05-03T13:27:24+00:00", "date": "2019-05-03 13:27:24", "year": 2019, "month": 5, "day": 3, "content": "Two US prosecutors have filed to detain one of the defendants in a shadow banking case. The defendant, Reginald Fowler was arrested on April 30 in Chandler, Arizona. According to the two prosecutors, Fowler should be detained as he “poses a serious flight risk and presents a risk of continued economic danger.”In a filing with the Arizona district court, the prosecutors stated that detention is appropriate since Fowler has significant resources and ties to other countries, has taken steps to impede the investigation and there’s evidence of his involvement in other criminal schemes. The nature of his crime also warrants detention, the prosecutors, Elizabeth Strange and Gary Restaino, pointed out.As we reported on May 1, the New York District Attorney charged Fowler and his partner Ravid Yosef of operating a shadow banking ring for crypto exchanges. The two allegedly opened bank accounts for the exchanges, enabling them to offer fiat services. They failed to obtain money transmitting business license despite handling millions of dollars for the exchanges. Yosef is still at large.In making their case, the prosecutors claimed that the possible long sentence Fowler faces could serve as an incentive to flee the country. The evidence against him is also quite strong, further making him a big flight risk.The prosecutors also believe that Fowler has committed many other crimes for which he is yet to be charged. They include attempting to obtain bank loans by presenting fraudulent documents that inflated his worth. Fowler allegedly presented bond certificates worth billions of dollars which were later found to be fraudulent.In a twist, Fowler is reportedly involved in the $850 million Bitfinex and Tether scandal. A report by The Block alleged that Fowler’s company, Global Trading Solutions was one of the agents linked to Crypto Capital. As we have reported, Crypto Capital is the company alleged to have either stolen or lost $850 million belonging to Bitfinex crypto exchange. The exchange ended up taking some of the cash reserves belonging to Tether, its sister company. The two companies are under investigation by New York’s Attorney General (NYAG).The report further alleges that the investigation by the NYAG is the genesis of Fowler’s indictment. If found guilty, Fowler could provide big clues on the mysterious Bitfinex and Tether case.Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
{"title": "Crypto market daily report – May 6, 2019 - CoinGeek", "url": "https://coingeek.com/crypto-market-daily-report-may-6-2019/", "birthday": "2019-05-06T07:39:53+00:00", "date": "2019-05-06 07:39:53", "year": 2019, "month": 5, "day": 6, "content": "After a relatively positive weekend, the cryptocurrency markets retreated Monday with most major currencies down by single digits. Bitcoin Core (BTC) was down by around 2%, trading at around $5,720 at press time. Ethereum (ETH) was also down by around 3% to the $161 level after having flirted with the $170 mark over the weekend. Ripple (XRP) continued to lose ground and was once again below the $0.30 level, trading at the $0.298 mark at press time.Other coins with larger market caps also suffered considerable declines with the main three dropping being BCHABC, Litecoin (LTC) and EOS. The former was down by around 4% to the $285 level, whilst LTC suffered an even more precipitous drop of around 6% to the $73 level, and EOS was down by 5.5% to the $4.72 mark. Bitcoin SV (BSV) was also down by around 2% to the $53 mark as selling pressure continued to tell. NEO also exhibited a steep drop of around 7% to the $8.95 level dropping below the $9 mark for the first time since February.Stellar (XLM) was also down by around 4% to the $0.095 level, whilst IOTA practically reversed all the gains it had made on the back of the Land Rover announcement last week and was down by around 6% to the $0.266 level.Coins with smaller market caps also saw a rout with several dropping by considerable margins. BAT and MATIC were down by 8% and 9% respectively, whilst Ethereum Classic also practically reversed all the gains made last week and was trading at $5.53 at press time or a 5% decrease. ONT was down by around 6% to the $1.037 level, whilst XMR, QTUM, IOST and ZIL experienced more conservative drops ranging from 4 to 2%. WAVES and DASH were down by 3% and 1% respectively with the latter still holding strong above the $117 mark.Note: Tokens on the Bitcoin Core (SegWit) chain are referenced as BTC coins; tokens on the Bitcoin Cash ABC chain are referenced as BCH, BCH-ABC or BAB coins.Bitcoin Satoshi Vision (BSV) is today the only Bitcoin project that follows the original Satoshi Nakamoto whitepaper, and that follows the original Satoshi protocol and design. BSV is the only public blockchain that maintains the original vision for Bitcoin and will massively scale to become the world’s new money and enterprise blockchain."}
