{"url": "https://www.cnbc.com/2019/05/03/bitcoin-price-cryptocurrency-markets-rally.html", "title": "Bitcoin rallies to a six-month high, other cryptocurrencies also jump", "content": "\nMehmet Ali Ozcan | Anadolu Agency | Getty Images\nBitcoin is on a tear Friday, climbing to a fresh six-month high.The world's best-known cryptocurrency jumped more than 7% Friday to around $5,750, according to CoinDesk data, its highest level since November 14.The reason for the upward move wasn't immediately clear. The virtual currency is now up more than 50% since the start of the year.Other digital assets, including ether and XRP, also climbed. Ether moved about 5% higher to just shy of $170, while XRP was up nearly 2% at a price of 31 cents.\n\nThe entire market has added nearly $10 billion in value over the last 24 hours, according to CoinMarketCap.Cryptocurrencies are still well off their late-2017 highs, with bitcoin still about 70% off its near-$20,000 all-time peak. The market suffered a massive slump last year, but sentiment appears to be improving in 2019.Mati Greenspan, senior market analyst at social trading firm eToro, said the move was likely a  \"continuation\" of an early April surge. \"Overall crypto market participants have been getting continuously bullish lately,\" he said by email.\n", "birthday": "2019-05-03T10:43:40+0000", "date": "2019-05-03 10:43:40", "year": 2019, "month": 5, "day": 3}
{"url": "https://www.cnbc.com/2019/02/19/elon-musk-says-tesla-wont-be-getting-involved-with-cryptocurrency.html", "title": "Elon Musk says Tesla won't be getting involved with cryptocurrency", "content": "\nTesla CEO Elon Musk and Shanghai's Mayor Ying Yong attend the Tesla Shanghai Gigafactory groundbreaking ceremony in Shanghai, China January 7, 2019.Aly Song | Reuters\nDespite tweeting about bitcoin, Elon Musk says his electric car company is steering clear of cryptocurrencies.The world's first and largest digital currency is  \"interesting,\" and could be a valuable way to transfer money, Musk said in a podcast released Tuesday. But not for Tesla.“Bitcoin’s structure is brilliant but I don’t think it would be a good use of Tesla’s resources to get involved in crypto,” Musk told Cathie Wood of ARK Invest, which has holdings in the electric car company.The Tesla founder tweeted about bitcoin in October 2018, sparking speculation by bitcoin fans on social media that it was more than just a joke. Musk assured Wood that the comment was tongue in cheek, and said his account got temporarily suspended because  \"there's some automatic rule about selling bitcoin.\" \"I was just joking,\" Musk said.Bitcoin gained mainstream notoriety and an enthusiastic group of investors at the end of 2017 as it soared to almost $20,000. The price has dropped more than 80 percent since, and was trading near $3,900 on Tuesday, according to data from CoinDesk.Musk highlighted bitcoin's ability to bypass currency controls and replace paper versions. But he also pointed to flaws, including the energy involved with  \"mining.\" To create new bitcoin, people use high-powered computers to solve a complex math problem. The winner receives a small amount of bitcoin. \"Paper money is going away and crypto is a much better value for a transfer of value than pieces of paper but it has its pros and cons,\" Musk said. \"It's very energy intensive to create bitcoin at this point.\"The bulk of Musk's conversation with Wood and ARK Invest analyst Tasha Keeney centered around Tesla's future in automation and electric vehicles. Musk said he expects the company will have the technology needed to essentially operate vehicles without drivers by the end of the year.\n", "birthday": "2019-02-19T23:39:04+0000", "date": "2019-02-19 23:39:04", "year": 2019, "month": 2, "day": 19}
{"url": "https://www.cnbc.com/2019/02/11/a-bitcoin-etf-is-virtually-certain-finance-expert-ric-edelman-says.html", "title": "ETF Edge", "content": "\nVIDEO3:2303:23Bitcoin ETF 'virtually certain,' finance expert Ric Edelman saysETF Edge\nThe road to a bitcoin ETF has seen many roadblocks, but one finance expert said it's an inevitability. \"It's virtually certain. The only question is when,\" Ric Edelman, founder of Edelman Financial Engines, said Monday on CNBC's \"ETF Edge \" at the Inside ETFs Conference in Hollywood, Florida. \"The SEC has several legitimate thoughtful concerns that the industry has to overcome but I'm confident they will. Eventually we will see a bitcoin ETF and it's at that stage that I will be much more comfortable recommending that ordinary investors participate.\"The Securities and Exchange Commission has long had concerns over the cryptocurrency market and how to regulate it. For one, bitcoin trading lacks a secure chain of custody like other financial markets. Secondly, the SEC has little control over price manipulation given it has no governance over overseas trading platforms.Major financial institutions' interest and investment in finding a solution should mean a bitcoin ETF eventually comes to market, Edelman contended. \"We've got some serious players. Fidelity has made a major announcement in the custody issue. We've got Kingdom Trust and a number of other very serious players on the custody side. I'm confident that in very short order VanEck or Bitwise will satisfy the custody concern to the SEC,\" said Edelman.Tom Lydon, editor-in-chief of ETFTrends.com, said he's already seen massive demand for a product like a bitcoin ETF. \"There is pent-up demand. We interview advisors all the time. Seventy-four percent say they've talked to clients about their interests in bitcoin so they need to step up when this happens because that money is going to go elsewhere,\" Lydon said Monday on \"ETF Edge.\"The Cboe refiled an application for a VanEck and SolidX bitcoin ETF to the SEC in late January. It had pulled the ETF submission roughly a week earlier on concerns the partial government shutdown would cause delays.\n (function(d,s,id){var js,fjs=d.getElementsByTagName(s)[0];if(d.getElementById(id))return;js=d.createElement(s);js.id=id;js.src='https://embed.playbuzz.com/sdk.js';fjs.parentNode.insertBefore(js,fjs);}(document,'script','playbuzz-sdk'));\n\n\n", "birthday": "2019-02-11T21:37:40+0000", "date": "2019-02-11 21:37:40", "year": 2019, "month": 2, "day": 11}
{"url": "https://www.cnbc.com/2019/02/14/venezuela-crisis-bitcoin-trading-volumes-hit-an-all-time-high-.html", "title": "Bitcoin trading in crisis-stricken Venezuela has just hit an all-time high", "content": "\nNicolas Maduro, Venezuela's president, speaks next to a stack of 12 Kilogram gold ingots during a news conference on the country's cryptocurrency, known as the Petro, in Caracas, Venezuela, on Thursday, March 22, 2018.Carlos Becerra | Bloomberg | Getty Images\nThe amount of bitcoin traded in crisis-stricken Venezuela has exploded to reach an all-time high.It comes at a time when tensions are reaching boiling point, with the country in the midst of the Western Hemisphere's worst humanitarian crisis in recent memory.In the last week, the amount of Bitcoin traded in the oil-rich, but cash-poor, country has soared by 30 percent to 2,454 bitcoins, according to crypto data tracker Coin Dance. That's equivalent to approximately $8.95 million per week and $1.29 million per day. Bitcoin is currently trading at $3,553.\n \nThe dramatic spike in weekly bitcoin trading volumes through to February 11 appears to show residents in Venezuela are opting to hold the world's most popular cryptocurrency instead of their own national currency as a store of value.Peer-to-peer trading volumes for Bitcoin have risen sharply in recent weeks, with the bolivar currency rendered practically worthless amid soaring hyperinflation.\nPetro\nPresident Nicolas Maduro has presided over Venezuela's spiral into its worst-ever economic crisis, with hyperinflation forecast to reach 10 million percent this year.As a result, some 3 million Venezuelans have fled abroad over the past five years to escape worsening living conditions.The rising interest for bitcoin and other digital assets in Venezuela has been driven, in large part, by the fast-moving political and economic collapse in the South American country.In early 2018, Maduro sought to bring an end to a prolonged period of economic turmoil by introducing the so-called petro cryptocurrency.The petro was designed to help Venezuela's government keep up with international financial obligations at a time when the country's collapsing economy was hit by sanctions from the U.S. and European Union.Critics have since widely discredited the move, calling the currency a  \"scam.\"\n", "birthday": "2019-02-14T12:55:37+0000", "date": "2019-02-14 12:55:37", "year": 2019, "month": 2, "day": 14}
{"url": "https://www.cnbc.com/2019/02/13/digital-currency-group-ceo-says-most-cryptocurrencies-will-fail-but-bitcoin-is-still-king.html", "title": "Digital Currency Group CEO says most cryptocurrencies will fail, but bitcoin is still king", "content": "\nBarry Silbert, Founder and CEO, Digital Currency Group David A. Grogan | CNBC\nA bear market could be just the beginning of the pain for most cryptocurrencies, according to one widely followed industry expert.Barry Silbert, CEO and founder of Digital Currency Group and Grayscale Investments, said besides bitcoin the majority of the once blazing hot crypto market will eventually be worthless. \"I'm not a believer in the vast majority of digital tokens and believe most will go to zero,\" Silbert told CNBC in a phone interview following a call with Grayscale investors.The rise in initial coin offerings helped bring the industry's market capitalization to more than $800 billion at the start of last year, according to CoinMarketCap.com. Bitcoin made up roughly 50 percent of that total, with its price climbing to nearly $20,000 in December 2017. Amidst the buying mania, Initial coin offerings, or ICOs, became a popular way to raise money from eager retail investors. But they often touted a project that wasn't live yet, or in some cases turned out to be outright fraud. \"Almost every ICO was just an attempt to raise money but there was no use for the underlying token,\" Silbert said. \"The vast majority of what's out there will be eliminated.\"That elimination is already starting. The Securities and Exchange Commission cracked down on the fundraising method last year, and Chairman Jay Clayton repeatedly urged crypto founders to register with the agency. Silbert applauded the SEC's actions and said most of the tokens were illegal offerings.Bitcoin's price, along with that of other other major cryptocurrencies, came crashing down last year. The world's first and best-known digital currency is down more than 80 percent since its peak and was trading near $3,572 as of Wednesday.Still, Silbert said he is  \"as bullish as he has ever been\" on bitcoin. As an early investor, he lived through multiple price plunges, all of which were followed by a full recovery. Despite bitcoin's relatively short 10-year existence, it's already on its third bear market plunge of 80 percent or more. The most recent one has yet to bounce back.Although bitcoin has seen  \"a really ugly technical chart,\" Silbert said there's still a high degree of interest from institutional investors. Digital Currency Group has made the most active seed investments in the industry, more than three times the amount of Andreessen Horowitz, according to Pitchbook. The company owns and operates bitcoin brokerage firm Genesis Trading, and the largest digital currency asset management firm, Grayscale Investments.Grayscale also started the first publicly traded bitcoin investment vehicle, the Grayscale Bitcoin  Trust, which trades under the symbol GBTC on over the counter markets.Part of the upside Silbert sees in bitcoin is based on its potential to replace gold as a safe haven asset. \"As far as I'm concerned bitcoin has won the race to be digital gold,\" Silbert said.Younger investors don't view gold as the same non-correlated, safe haven as their parents, Silbert said. He quoted an Accenture statistic on the investor call, that $30 trillion of baby boomer wealth is going to be handed down in the next 20 years. Some of that is currently in gold, which Silbert is predicting a younger generation would convert to bitcoin as a hedge instead. \"I'm convinced that whatever money is in gold is not going to stay in gold,\" Silbert said. \"That gets handed down to millennials -- I'm highly confident a lot of that will go into bitcoin.\"He said the speculation use case has been proven for bitcoin as a  \"buy and hold strategy.\" But the question of when meaningful institutional money starts flowing in still remains. Silbert said that heading into 2019, the infrastructure for that to happen safely is finally in place. Fidelity's custody solution and other investment opportunities like a futures market from the Intercontinental Exchange, parent company of the New York Stock Exchange, are all set to go live early this year.If and when sentiment changes, Silbert predicted bitcoin prices would  \"snap back hard.\" \"There are certainty institutional investors that have put money to work and many more are are considering it,\" Silbert said. \"Until now they wanted to make sure they're not catching a falling knife.\"\n", "birthday": "2019-02-13T22:28:23+0000", "date": "2019-02-13 22:28:23", "year": 2019, "month": 2, "day": 13}
{"url": "https://www.cnbc.com/2019/02/14/crypto-exchange-binance-profitable-despite-bear-market-cfo-says.html", "title": "Crypto exchange Binance says it's still profitable 'even in this bear market'", "content": "\nA photo illustration of the digital Cryptocurrency, Bitcoin, is seen on September 13 2018 in Hong Kong, Hong Kong. Yu Chun Christopher Wong | S3studio | Getty Images\nBinance, the world's largest cryptocurrency exchange by trading volume, is still profitable despite last year's market meltdown, its chief financial officer said.Last year saw the prices of major virtual currencies plunge dramatically. Bitcoin, the most valuable crypto, is down 80 percent from a near-$20,000 record high it set in December 2017. \"To date, even in this bear market, we still run a profitable business,\" Binance CFO Wei Zhou told CNBC in a phone interview Wednesday.The company doesn't disclose its financials publicly, he said, and media outlets have been publishing estimates based on publicly available metrics.One report, by industry publication The Block, estimates Binance made $446 million last year, based on an analysis of how much it spent to buy back units of its token, called BNB, using its net profits.The start-up's Chief Executive Changpeng Zhao told Bloomberg in July that Binance was targeting a net profit of between $500 million and $1 billion in 2018.The company has only been around since July 2017, but has become a dominant force in the nascent sector. It raised $15 million in its initial coin offering — a funding alternative to venture capital where start-ups sell new crypto tokens instead of equity.\n\nFast forward to 2019, and Binance's trading volume — though significantly lower than it was during late 2017's mega-rally — is the envy of other major venues. It is the largest virtual currency exchange by volume, according to CoinMarketCap, hosting $715 million in trades in the last 24 hours.The firm hired Wei Zhou to take charge of its finances in September 2018. The executive has previously served in CFO roles at Chinese jobs site Zhaopin and TV ad company Charm Communications, navigating both businesses through their respective initial public offerings.Asked whether Binance could seek a stock market listing of its own, given his background, he said there were  \"no plans\" in the short term.Wei Zhou is also credited as having orchestrated Chinese tech group Beijing Kunlun Tech's acquisition of the gay dating app Grindr last year.On the subject of potential mergers and acquisitions, he said  \"we're always on the lookout for high quality products.\"Last year, the company bought crypto wallet maker Trust Wallet for an undisclosed amount and invested $2.5 million in Australian start-up TravelbyBit, which lets users book flights with cryptocurrency.\n", "birthday": "2019-02-14T08:10:26+0000", "date": "2019-02-14 08:10:26", "year": 2019, "month": 2, "day": 14}
{"url": "https://www.cnbc.com/2019/02/11/plunge-in-crypto-sets-stage-for-facebook-and-other-tech-giants-to-hire-blockchain-experts.html", "title": "Blockchain", "content": "\nTwo technicians work at a bitcoin mining facility in Quebec.lars Hagbarg | AFP | Getty Images\nThe drop in cryptocurrency prices is meaning job losses for some, but it may carve out an ideal hiring opportunity for tech giants.Some blockchain start-ups, regardless of having talented teams of engineers, haven't been able to prove a use case and are struggling to fund operations as the price of cryptocurrencies nosedives. Employees are slowly becoming free agents, which is good news for companies like Facebook.The social media giant recently scooped up employees from start-up Chainspace, according to a report by Cheddar. Facebook confirmed to CNBC that it had hired a handful of employees but said it did not buy the company or its technology.Chainspace is a crypto startup founded by PhD researchers from University College of London. Two of these founders are now listed as Facebook employees on LinkedIn. According to its website, the start-up is focused on  \"giving people ownership of their personal data\" through a project called \"DECODE.\"In a note to clients last week, RBC internet analyst Zachary Schwartzman highlighted blockchain as a threat to Facebook and other major tech companies. The Internet is still at the  \"embryonic stages of a potential massive paradigm shift\" to computing on public blockchains, according to Schwartzman. That shift \"could be a long term risk to Facebook's underlying business model,\" he said.Schwartzman categorized Facebook's move as an  \"acqui-hire\" — a popular Silicon Valley term for when a company acquires a company only to recruit its employees. \"On the surface, it may appear that Facebook purposefully hired the technical team related to DECODE. But we don't believe this was the case,\" Schwartzman said. \"Our view is that this was simply an acqui-hire to expand Facebook's internal crypto team's expertise.\"Facebook is on a growing list of tech companies testing out the blockchain space, with former PayPal executive David Marcus leading its charge. Amazon, IBM, Microsoft and J. P. Morgan are among others looking at use cases for the technology, which supporters call more transparent and more secure than existing data systems.But like the internet, the best way to monetize it might not be obvious immediately.  \"Acqui-hiring\" gives tech giants a way to quickly get blockchain experts that are already working together to find that use case, according to Satya Bajpai, head of blockchain and Digital Assets Investment Banking at JMP Securities. \"It will take some time,\" said Bajpai, who advises blockchain companies on early stage M&A. \"But as the technology matures and becomes more relevant to more customers, you'll see a snowball effect with more public deals and partnerships.\"\nCrypto mania\nEngineers and other entrepreneurs flocked to the blockchain and cryptocurrency space as prices hit record highs at the end of 2017. The flagship cryptocurrency bitcoin rallied to almost $20,000 at the end of that year.There was plenty of venture capital money to get these companies off the ground in 2018. More than $2.6 billion was spent on deals for 301 companies last year, according to Pitchbook. That was more than three times the total blockchain and crypto deals completed 2017.But the clock may have run out for venture funding, according to Bajpai. Bitcoin's price nosedived 80 percent since then.Even at the peak of their fundraising, many of these companies still hadn't launched a real product. In the case of EOS, the company raked in $4 billion from an initial coin offering without having a live product. Those coins for the most part have struggled alongside bitcoin. The industry's market capitalization is around $121 billion, down from more than $800 billion at the peak.Bajpai likened it to the dot-com years. Start-ups that had a convincing idea were able to raise venture capital money. But those that couldn't prove sustainability were shaken out in the process. \"In order for them to raise more capital, they need to show progress on customer adoption and revenue, which is where a lot of these companies fall short,\" Bajpai said. \"If you don't do that, it's hard to go back to your investors and ask for more.\"WATCH: You earn 'sweatcoin' just by working out\nVIDEO2:4102:41You earn 'sweatcoin' just by working outDigital Original\n\n", "birthday": "2019-02-11T20:17:31+0000", "date": "2019-02-11 20:17:31", "year": 2019, "month": 2, "day": 11}
{"url": "https://www.cnbc.com/2019/02/28/blockchain-sets-its-sights-on-electronic-gaming.html", "title": "Blockchain, already disrupting the finance industry, sets its sights on electronic gaming", "content": "\nmatejmo | iStock | Getty Images\nBlockchain has its sights set on electronic gaming after disrupting the financial services industry and becoming a bedrock of the cryptocurrency movement.As gamers increasingly purchase digital avatars and tokens to customize their experience, a growing number of observers think blockchain technology will play a bigger role in the explosive growth of electronic sports. \"We see blockchain adding a whole new dimension to the gaming industry on many different levels — to extend the life of a game, to make it more interesting to gamers and to provide experiences that couldn't have been provided before,\"\" said Steve Grossman, CEO of Planet Digital Partners, a digital securities-funded game publisher.In fact, blockchain's buzz in the gaming community could have wide-reaching implications for the entire industry, some observers say. One example is in a cooking simulator game  \"Cooking Mama,\" where players are tasked with completing recipe challenges.Grossman said the private keys generated for users, which are essentially a series of numbers and letters known solely to the user, can allow players to change expression algorithms in the game.In turn, players can customize the characters, as well as alter in-game recipes. The private key's knowledge and accessibility solely to the user also means that players can claim full digital ownership of their creations. In addition, users can share their creations with the  \"Cooking Mama\" community at large, deriving a public key that can then be used to transfer those digital assets between players. \"Digital assets moving around in the PC world have been huge for years, [but] consoles have mainly blocked that,\" Grossman said. With blockchain, however, \"we found a way to let users work with digital assets on private, key-driven elements … for unique 'Cooking Mama' experiences.\"\nEnhance the gaming experience\nTeam Liquid's Alienware Training Facility in Los Angeles.Source: David Chen/Dell\nAs esports capture more of the public's imagination, some think blockchain could disrupt the industry. Rahul Sood, CEO of esports betting company Unikrn, believes that blockchain could allow digital assets to be traded between different games.The idea is particularly useful given the rise of the free-to-play business model in gaming, according to Sood. In an FTP game, the vast majority of revenue comes from in-game purchases on the platform since users don't have to buy the game to play. \"The ability to liquidate or trade … assets into other games would be great, and blockchain could really allow for that,\" Sood told CNBC. \"Blockchain could disrupt the space in that these virtual items could be traded over blockchain and their whole virtual economy could be built on it.\"Proponents of blockchain say the technology can help promote accountability and transparency in gaming. In Unikrn's case, over 850,000 accounts have the ability to bet on esports games.Yet it also means that Unikrn has a large number of transactions to account for, and the sheer volume of those accounts and transactions demands a high-level method of tracking activity.Blockchain  \"really is the best way to track transactions,\" Sood said, adding that there were \"a ton of applications\" for its use. \"We can do forensic wallet-tracking, we can see where money is coming from on the platform and we can stop anyone who cheats or games the system,\" he said.\nRahul Sood gestures as he speaks during a news conference at the new Microsoft store in Berlin, Nov. 7, 2013.Krisztian Bocsi | Bloomberg | Getty Images\nHowever, the digital securities-side of blockchain has also given way to a different avenue for investing in games.Planet Digital Partners essentially funds games through digital offerings of preferred shares that can be purchased to fund a basket of 10 games — and  \"Cooking Mama\" is just one game in the basket. As revenue is raised from those games, investors receive returns thanks to their initial purchase of those preferred shares.Grossman and his team essentially launched the system to democratize the games investment. He said there are different sectors of the gaming market, and a good chunk of the sector involves the billion-dollar blockbuster releases that typically see  \"returns of investment of tens of millions of dollars.\"Yet there's also a midtier market that has also managed to create hit titles. The presence of digitally offered preferred shares allows for investors to tap into that market as the gaming industry grows. \"The midmarket sector has always been there,\" Grossman said. \"It's not a new dynamic, but it's a dynamic that's becoming more magnified and [makes the sector an increasingly attractive] investment target.\"Yet gaming participants cautioned that blockchain isn't necessarily one size fits all for the sector. While it can be used in esports to reduce instances of cheating, or players taking advantage of game glitches, it shouldn't be  \"shoehorned\" into every circumstance. \"Where I see potential use for blockchain in esports is if a team were to create part of their governance around voting, and you want to vote on what's happening with the team, player contracts and trading contracts. But it's an idea that won't happen in volume,\" Sood said.He stressed that blockchain adds to the gaming experience — but it won't take precedence over the ideas and elements that make a quality game. \"Blockchain is a cherry on the cake, it helps take it to another level,\" he said.Subscribe to CNBC on YouTube.\n", "birthday": "2019-03-02T16:00:09+0000", "date": "2019-03-02 16:00:09", "year": 2019, "month": 3, "day": 2}
{"url": "https://www.cnbc.com/2019/02/25/warren-buffett-still-likes-stocks-but-sees-no-value-in-bitcoin.html", "title": "Warren Buffett likes stocks, sees no value in bitcoin and admits he messed up with Kraft", "content": "\nVIDEO2:4202:42Buffett: I would buy the S&P 500 in a secondSquawk Box\nBillionaire investor Warren Buffett said Monday he finds stocks attractive for the long haul and that he almost made a huge acquisition last quarter. He also called bitcoin a  \"delusion.\"Buffett, 88, made his comments in a wide-ranging interview with  \"Squawk Box\" co-host Becky Quick from Omaha, Nebraska.He explained why he tempered his buying when the market was so much cheaper in final three months of 2018, and the Federal Reserve was signalling that rates would not be going too much higher. \"I thought stocks were a buy in the fourth quarter, just like … the third and second and first quarter[s]. But sometimes we have other things in mind, too, that may use a lot of money. And sometimes they work out and sometimes they don't,\" said the chairman and CEO of Berkshire Hathaway.  \"We had at least one deal possible that would have been very large.\" \"I liked stocks in the fourth quarter. I would like buying a business even better, \" he added, echoing the sentiments he expressed in Saturday's annual letter to Berkshire shareholders, in which he wrote that \"prices are sky-high for businesses possessing decent long-term prospects\" but he remained on the hunt for an \"elephant-sized acquisition.\"Buffett also said if he had to choose an investment to hold over 10 years, he would put his money in the S&P 500 instead of the 10-year Treasury bond.\nVIDEO4:1904:19Watch Warren Buffett break down his takes on big name stocksThe Bottom Line\nAs much as he likes stocks, Buffett said the last eight years or so have been a tough environment for active investors to beat the S&P 500 index.In fact, he told CNBC that Berkshire investment managers Ted Weschler and Todd Combs have trailed the S&P 500 by a  \"tiny bit\" since each joined the company.Combs, in his late 40s, arrived in 2010 after a three-year search by Berkshire for someone to help manage its massive portfolio of stocks. Weschler, in his late 50s, joined Berkshire two years later, after paying a combined $5.3 million to win the 2011 and 2010 auctions for an annual charity lunch with Buffett.However, Buffett pointed out that Combs and Weschler — both former hedge fund managers, and each managing about $13 billion of the Berkshire portfolio — have done better in the market than he has over the same time period.Berkshire — whose stock holdings, including the top six by market value Apple, Bank of America, Wells Fargo, Coca-Cola, American Express and Kraft Heinz — was worth nearly $173 billion at the end of 2018.In the wake of Friday's 27 percent decline in shares of Kraft Heinz after the company announced a $15 billion write-down of two key brands, Buffett said,  \"We overpaid for Kraft,\" which in 2015 Berkshire and Brazilian private equity firm 3G Capital merged with H.J. Heinz, the global ketchup powerhouse it purchased in 2013.As for Apple, Buffett told CNBC on Monday,  \"If it were cheaper, we'd be buying it. We aren't buying it here.\" He added, \"I don't see myself selling — the lower it goes, the better. I like it, obviously.\"While government filings show that Berkshire trimmed its Apple stake in the fourth quarter, Buffett said it was Weschler or Combs, he didn't specify, who decided to sell some Apple to make a new investment.Buffett doubled down on his bitcoin criticism, saying the world's biggest cryptocurrency has  \"no unique value at all\" and  \"attracts charlatans.\" He is not alone. Many business leaders, including J.P. Morgan chief Jamie Dimon, have also expressed skepticism.Bitcoin was trading around $3,800 per unit midday on Monday. It had soared from under $1,000 at the beginning of 2017 to about $19,000 by mid-December of that year. But since then, it's been falling rather steadily — about 80 percent from those all-time highs.Looking at the political landscape, Buffett said he would support Mike Bloomberg if the 77-year-old former three-term New York mayor were to run for president in 2020 against Republican incumbent Donald Trump.  \"If Mike Bloomberg announced tomorrow that he was a candidate, I would say I'm for him,\" Buffett said.There are indications that the billionaire businessman Bloomberg, who switched his party affiliation from independent to Democrat in October, is thinking about running for the Democratic presidential nomination. He was an independent in his third mayoral term. He was a Republicans in the first two.Buffett hopes billionaire businessman Howard Schultz, 65, does not run for president as an independent. In January, the former Starbucks chief said he was considering a third-party bid.Making no evaluation of Schultz as a potential candidate, Buffett added,  \"I think generally [that] third-party candidates, they're going to hurt one side or the other, and they're more likely to hurt the side that they actually favor, because they're closer to that view, and so they pull more people away that would otherwise go with the second-best with that view.\"Buffett said he's never been a card-carrying Democrat, pointing out that he's voted for Democratic and GOP candidates over the years.However, Buffett has been more aligned with Democrats than Republicans on the issue of taxing the wealthy, an issue he's been speaking out about for years.  \"The wealthy are definitely undertaxed relative to the general population,\" he said.Sens. Elizabeth Warren, 69, and Bernie Sanders, 77 — both Democratic presidential hopefuls — have called for higher taxes on the rich. Democratic Rep. Alexandria Ocasio-Cortez, the 29-year-old freshman firebrand from New York, has also proposed that wealthy Americans pay more in taxes. \"That probably means more taxes for guys like me, and I'm fine with it,\" Buffett said.WATCH: Here's the full CNBC interview with iconic investor Warren Buffett\nVIDEO1:59:4701:59:47Watch CNBC's full interview with iconic investor Warren BuffettSquawk Box\n\n", "birthday": "2019-02-25T18:59:00+0000", "date": "2019-02-25 18:59:00", "year": 2019, "month": 2, "day": 25}
{"url": "https://www.cnbc.com/2019/02/25/warren-buffett-says-bitcoin-is-a-delusion.html", "title": "Warren Buffett says bitcoin is a 'delusion' and 'attracts charlatans'", "content": "\nVIDEO3:0703:07Warren Buffett: 'Bitcoin has no unique value at all'Squawk Box\nBillionaire investor Warren Buffett is doubling down on his bitcoin criticism. \"Bitcoin has no unique value at all,\" Buffett told CNBC's Becky Quick in a  \"Squawk Box \" interview Monday. \"It is a delusion, basically.\"The Berkshire Hathaway CEO said he is sympathetic to optimists who bought the world's largest cryptocurrency in hopes that  \"it would change their lives.\" Bitcoin has lost more than 80 percent of its value since reaching a high near $20,000 at the end of 2017. The cryptocurrency was trading near $3,781 on Monday, according to CoinDesk. \"It attracts charlatans,\" Buffett said. \"If you do something phony by going out and selling yo-yos or something, there's no money in it — but when you get into Wall Street, there's huge money.\"\nWarren Buffett, Chairman and CEO of Berkshire Hathaway.David A. Grogan | CNBC\nBuffett has been a long-time critic of cryptocurrency. He called bitcoin  \"probably rat poison squared,\" ahead of the 2018 Berkshire Hathaway annual shareholder meeting. A \"mirage,\" \"not a currency,\" and \"tulips\" are among the descriptors Buffett has used for bitcoin, according to CNBC's Warren Buffett Archive.In the interview Monday, he did point to potential in bitcoin's  \"important\" underlying technology blockchain but said its success does not depend on cryptocurrency.Buffett is not alone in his skepticism. Business leaders including Bill Gates, economists Nouriel Roubini and Robert Shiller, and fund managers Ray Dalio and Howard Marks are among those who have questioned bitcoin's legitimacy. J.P. Morgan CEO Jamie Dimon was also a vocal critic of bitcoin. Yet earlier this month, J.P. Morgan became the first major bank to launch its own proprietary cryptocurrency for cross-border payments.\n", "birthday": "2019-02-25T13:52:24+0000", "date": "2019-02-25 13:52:24", "year": 2019, "month": 2, "day": 25}
{"url": "https://www.cnbc.com/2019/02/26/sofi-to-launch-cryptocurrency-trading-in-partnership-with-coinbase.html", "title": "SoFi to launch cryptocurrency trading in partnership with Coinbase", "content": "\n\nOnline finance start-up SoFi is moving into cryptocurrency.The San Francisco-based company will allow users to buy digital currencies through a partnership with popular exchange Coinbase, SoFi announced on Tuesday. The crypto capability will be available to SoFi users in the second quarter of this year. \"Our target audience wants to see what the price of cryptocurrency is, and to buy it,\" SoFi CEO Anthony Noto told a group of reporters at the firm's New York offices Tuesday. \"They have a desire to do that and in many cases they already are.\"Noto, Twitter's former chief operating officer and a former managing director at Goldman Sachs, joined SoFi last January. He declined to specify which digital coins will be available. The buying, selling, and price-checking of whichever cryptocurrencies they allow will be enabled by a partnership with popular trading platform Coinbase, valued at $8 billion after its most recent funding round. Fidelity has a similar arrangement with Coinbase, where users can view digital asset balances as part of their portfolio. But Fidelity doesn't offer the ability to buy or sell a digital coin.Cryptocurrency trading will be available under the umbrella of SoFi Invest, which went live earlier this month. SoFi Money, another new arm of the company, will offer a 2.25 percent APY cash account with no fees — joining a list of peers increasingly competing for customer deposits. Both products became more widely available on Tuesday. On Monday, the start-up filed for two index exchange traded funds that will waive management fees for the first year, encroaching on an a market dominated by Vanguard and BlackRock's iShares. Through SoFi Invest, the firm will also offer  \"active\" investing with the help of a broker and automated, or \"robo\" advising.The company is re-launching its home loans product March 1 and Noto said SoFi plans to offer a credit card in the back half of 2019. Later this year, it will also release joint accounts,  \"saving vaults,\" and round ups -- similar to Acorns' core product --- \"to make SoFi money even more useful.\"As for an initial public offering, Noto said it's  \"not a priority\" in 2019. But long-term, he said an IPO remains on the roadmap.SoFi, short for social finance, was founded in 2011 with a focus on millennial student-loan refinancing. It has since expanded offerings to the demographic with personal and mortgage loans, mortgage refinances and wealth management services. It acquired banking start-up Zenbanx in 2017, enabling it to offer debit, payments and money transfers.The company was last valued at $4.4 billion and has raised $1.9 billion to date from names like SoftBank Capital and Peter Thiel, according to data from PitchBook.SoFi's move into cryptocurrency comes as the price of bitcoin and other digital assets have come crashing down. Bitcoin has lost more than 80 percent of its value since skyrocketting to almost $20,000 at the end of 2017. Still, Noto said SoFi customers are interested and could see the volatility as  \"two-sided coin.\" \"Some people may see it as an opportunity,\" Noto said.\n", "birthday": "2019-02-26T17:01:04+0000", "date": "2019-02-26 17:01:04", "year": 2019, "month": 2, "day": 26}
{"url": "https://www.cnbc.com/2019/02/28/facebooks-crypto-team-works-an-office-off-limits-to-other-employees-nyt.html", "title": "Facebook's crypto team reportedly works in an office off-limits to other company employees", "content": "\nFacebook likes logo are seen on an android mobile phone.Omar Marques, SOPA Images | LightRocket | Getty Images\nFacebook is keeping its cryptocurrency plans under wraps, even when it comes to other company employees.The social media giant silos off its secretive cryptocurrency team in an office that requires entirely different key-card access so that other Facebook employees can't enter, according to a New York Times report, citing two Facebook employees.Facebook's blockchain and cryptocurrency efforts are being run by former PayPal president David Marcus. It has been steadily building out its team, recently hiring a group of employees from blockchain start-up Chainspace. The tech giant hasn't publicly said what the team is working on. But Bloomberg reported in December that Facebook is looking to introduce mainstream users to digital currencies by allowing them to send money through WhatsApp, which Facebook owns.The option would allow Facebook users to send money to friends and family instantly, the Times said, citing five people briefed on the effort. Facebook's cryptocurrency project is at the point that it has discussed selling  \"Facebook coin,\" to consumers with major cryptocurrency exchanges, according to the Times report.Cryptocurrencies became a household name at the end of 2017. The investing mania was led by bitcoin, which rallied to nearly $20,000 by the end of 2017 after starting that year at less than $1,000. It has come crashing down 80 percent since, and was trading near $3,800 on Friday. Bitcoin has largely failed as the type of currency people might use to buy a cup of coffee or instantly pay a friend. Its more popular use case is as a store of value, or  \"digital gold.\"Projects by Facebook, Telegram, Signal, and other messaging apps would look to solve that speed-bump by making cryptocurrencies an accessible peer-to-peer payment, according to the report.— Read the entire New York Times report here.\n", "birthday": "2019-02-28T17:50:38+0000", "date": "2019-02-28 17:50:38", "year": 2019, "month": 2, "day": 28}
{"url": "https://www.cnbc.com/2019/03/08/fidelitys-new-cryptocurrency-company-is-up-and-running-despite-a-bear-market-for-digital-coins.html", "title": "Fidelity's new cryptocurrency company is up and running despite a bear market for digital coins", "content": "\nJames Leynse | Corbis Historical | Getty Images\nAn ongoing cryptocurrency bear market is not dampening interest for Fidelity's new institutional cryptocurrency products.Fidelity Digital Assets, a new company created by the investing giant last year, has quietly rolled out its cryptocurrency custody and trade execution operations. In the past few months it has been up and running with institutional investors like hedge funds and family offices, according to its top executive.The collapse in cryptocurrency prices over the last year  \"haven't had an impact\" on getting up and running, Tom Jessop, head of Fidelity Digital Assets told CNBC at the DC Blockchain Summit this week. \"If you started a crypto fund at the height of the market you're probably hurting right now.\"Bitcoin, along with thousands of other digital coins, sparked a buying frenzy among retail investors in late 2017. The world's largest cryptocurrency has dropped more than 80 percent since its high of almost $20,000 at the end of 2017 and was trading near $3,789 on Friday.Still, Jessop said there's long-term interest from institutional investors to add some form of cryptocurrency to their portfolios. It's often seen as an uncorrelated risk, or a store of value in a crisis. Others see a trading opportunity given the sector's volatility. Fidelity commissioned research to gauge the level of that interest.The firm interviewed roughly 450 institutions, everyone from wealthy families to hedge funds, pensions and endowments. About 22 percent of the respondents already own cryptocurrency, according to the findings. Those that already own it expect to double their allocation over five years. \"If anything, they are as encouraged now as they were when prices were higher,\" Jessop said.Fidelity's new company will execute trades on multiple exchanges for these professional investors. It also handles custody, or the safe storage of digital assets. Until Fidelity, there had been a noticeable lack of a big U.S.-based company in that business.Jessop said while the company is live, certain aspects are still a work in progress. Fidelity is expanding the jurisdictional coverage of where it can do business. And its offerings are not one-size-fits-all. Some customers were using the platform in January, while for other customers, it was March. Others may wait until September, he said. \"It really depends on the facts and circumstances of each client,\" Jessop said.Fidelity, a roughly 72-year-old family-controlled firm, is known for managing retirement plans and mutual funds. But it also spends $2.5 billion per year on technologies like artificial intelligence and blockchain. The new digital asset company was born out of the Fidelity Center for Applied Technology, or FCAT as employees call it.Jessop said many institutional investors are still in  \"wait and see\" mode when it comes to putting money into crypto. \"At some point, there will be an attractive entry point,\" Jessop said. \"But by the same token people don't want to be early even if we're well off the highs.\"Much of that hesitation has to do with volatility, he said. The digital currency market has been known to jump or sink by 10 percent in a single day. While prices in 2019 have been relatively stable, institutions are still wary of those sudden price moves, according to the Fidelity survey. That issue should be solved as the market structure matures, Jessop said.Education is another roadblock to greater acceptance by investors. Jessop said the more educated a firm was on the topic, the more likely they were to be holding cryptocurrency. \"They've approached us wanting to learn, which is an encouraging sign,\" Jessop said. \"That's not to say that there's a cohort of people that once they get educated will still have a negative view.\"WATCH: How to start your very own cryptocurrency\nVIDEO3:1303:13How to start your very own cryptocurrencyDigital Original\n\n", "birthday": "2019-03-08T16:06:07+0000", "date": "2019-03-08 16:06:07", "year": 2019, "month": 3, "day": 8}
{"url": "https://www.cnbc.com/2019/03/11/facebooks-cryptocurrency-could-be-a-19b-revenue-opportunity-barclays-says.html", "title": "Facebook's cryptocurrency could be a $19 billion revenue opportunity, Barclays says", "content": "\nA facebook display during the China International Import Expo (CIIE), at the National Exhibition and Convention Center in Shanghai, China, November 5, 2018. Aly Song | Reuters\nOne Wall Street firm sees major upside for Facebook if its secretive cryptocurrency plan works out.The social network is reportedly developing a cryptocurrency that could be part of a multibillion-dollar revenue opportunity, Barclays internet analyst Ross Sandler said in a note to clients Monday.Sandler forecasted as much as $19 billion in additional revenue by 2021 from  \"Facebook Coin.\" Conservatively, the firm sees a base-case of an incremental $3 billion in revenue from a successful cryptocurrency implementation. \"Merely establishing this revenue stream starts to change the story for Facebook shares in our view,\" Sandler said.Facebook is reportedly developing a cryptocurrency for global payments that will be tied to the value of traditional currencies and available to use through its messenger  \"WhatsApp,\" according to Bloomberg and The New York Times. Facebook has not publicly commented on the reports.Price volatility has been one major roadblock to bitcoin's widespread adoption as an everyday payment option. But Facebook's digital currency, a  \"stable coin,\" would likely be less attractive to speculators because of its fixed price tied to a currency like the U.S. dollar.\nVIDEO1:1001:10Facebook reverses ban on cryptocurrency adsPower Lunch\nFacebook's current business model came under fire from consumers, politicians and advertisers last year. Its share price tanked after a series of high profile setbacks. For one, British political consulting firm Cambridge Analytica collected data on more than 50 million Facebook users without their permission. Still, Facebook earnings have continued to increase, and the share price has rallied roughly 30 percent this year.Expanding into payments could give Facebook a lifeline if investors suddenly become less forgiving. Using some form of cryptocurrency could generate a new revenue option — something  \"sorely needed at this stage of the company's narrative,\" Sandler said. \"Any attempt to build out revenue streams outside of advertising, especially those that don't abuse user privacy are likely to be well-received by Facebook's shareholders,\" Sandler said.Barclays based its Facebook revenue estimates off of Google's digital distribution service, which is also the official app store for Android's operating system.  \"Google Play,\" as it's called, generates $6 in \"net\" revenue per user now. Facebook could see a \"similar cadence,\" across its nearly 3 billion users in 2021.A Facebook virtual currency would allow for more premium content to find its way back to Facebook, Sandler said, as companies re-establish themselves on the social network as a strategic partner.\nPaying through Facebook\nSandler pointed to Facebook's original payment ambitions almost a decade ago. The Menlo Park, California-based company created a virtual currency in 2010 called  \"Facebook credits,\" similar to modern-day cryptocurrency. Users would prepay for these virtual coins using domestic currencies, and then use those credits for in-app-purchases. The company required a user to pay using a debit or credit card upfront, and each virtual credit cost about 10 cents.The major problem, according to Sandler, was that Facebook had to bear the interchange cost,  \"which negatively impacts the profitability of the business, especially when making high volumes of lower-value transactions.\"Since then, Facebook and the cryptocurrency sector have matured. The company has a much larger user base, and more mega-apps like Instagram and WhatsApp to which it can distribute content. The company's new cryptocurrency plan could potentially  \"re-invigorate that business strategy,\" Sandler said. \"Based on our checks, the first version of Facebook Coin may be a single purpose coin for micro-payments and domestic p2p money transfer (in-country), very similar to the original credits from 2010 and Venmo today,\" Sandler said.\nDavid Marcus, vice president of Messaging Products at Facebook, speaks on stage during the annual Facebook F8 developers conference in San Jose, California, April 18, 2017.Stephen Lam | Reuters\nThe scope of this project, according to Sandler, is larger than those previous ambitions. He pointed to the leader of Facebook's blockchain and cryptocurrency efforts — former PayPal President David Marcus. Facebook has been steadily building out its blockchain team, recently hiring a group of employees from start-up Chainspace.Challenges remain. Facebook needs to demonstrate a value proposition for users  \"above what is available today in payments\" and build trust after its laundry list of issues in 2018, Sandler said. Global payments systems also tend to bring more regulatory scrutiny.But if the stable coin is successful, Sandler said, he sees no reason why Facebook couldn't get into consumer lending, remittance and physical payments  \"eventually.\"\n", "birthday": "2019-03-11T17:07:35+0000", "date": "2019-03-11 17:07:35", "year": 2019, "month": 3, "day": 11}
{"url": "https://www.cnbc.com/2019/03/18/cboe-to-stop-listing-bitcoin-futures-as-interest-in-crypto-trading-cools.html", "title": "Cboe to stop listing bitcoin futures as interest in crypto trading cools", "content": "\nA trader works in S&P 500 stock index options pit at the Chicago Board Options Exchange (CBOE) in Chicago, Illinois.Jim Young | Bloomberg | Getty Images\nThe major U.S. exchange company that paved the way for bitcoin futures has had a change of heart.Cboe Global Markets, which rolled out the first bitcoin futures contracts in December 2017, has decided to stop adding new ones. In a statement last week, the Cboe Futures Exchange said it will not add new bitcoin futures in March. It did not rule out the possibility of other cryptocurrency derivatives, though, and  \"is assessing\" its approach for how it plans to continue.In the meantime, active bitcoin contracts are still available to trade, but the last of them expires in June.Futures are a way for investors to bet on whether the price of a commodity — in this case bitcoin — will rise or fall. The contracts expire each month, meaning an exchange has to continuously list more if it wants to keep the market alive.The move by Cboe highlights cooling enthusiasm for bitcoin after an all-out mania led by retail investors in 2017. When the  \"XBT\" futures launched in December of that year, bitcoin was trading near $17,000. Not long after, it shot to almost $20,000. Prices have come crashing down by 80 percent since. Bitcoin was trading near $4,000 as of Monday afternoon.Cboe was not the only exchange to try to capitalize on the bitcoin frenzy. Its Chicago-based rival CME Group debuted its own cash-settled bitcoin contracts, also denominated in U.S. dollars, and has not announced any changes. CME's version has historically seen more trading volume. CME bitcoin futures' 30-day average volume is more than four times larger than Cboe's.When they were introduced, futures gave investors a way to buy and sell cryptocurrency in a regulated marketplace. Those in favor of it said it would be a way to usher institutional investors into the bitcoin marketplace. There has been little evidence of that happening in the form of crypto derivatives.\n", "birthday": "2019-03-18T16:20:12+0000", "date": "2019-03-18 16:20:12", "year": 2019, "month": 3, "day": 18}
{"url": "https://www.cnbc.com/2019/03/22/majority-of-bitcoin-trading-is-a-hoax-new-study-finds.html", "title": "Majority of bitcoin trading is a hoax, new study finds", "content": "\nA smartphone displays the Bitcoin GBP market value on the stock exchange via the Yahoo Finance app.Guillaume Payen | LightRocket | Getty Images\nNew research is casting even more doubt on the legitimacy of bitcoin trading.An analysis published by Bitwise this week shows that 95 percent of bitcoin spot trading is faked by unregulated exchanges. The survey, first reported by The Wall Street Journal, echoes concerns by regulators that cryptocurrency markets are still ripe for manipulation.Bitwise, an asset manager in the process of trying to list the first-ever bitcoin exchange-traded fund, said it met with the Securities and Exchange Commission on Tuesday to discuss its application. As a part of the process, it submitted analysis that could help regulators cut through the noise. \"People looked at cryptocurrency and said this market is a mess; that's because they were looking at data that was manipulated,\" said Matthew Hougan, global head of research at Bitwise. \"When you cut away the echo chamber of these nonsense numbers, it should be an efficient, well-arbitraged market.\"\n\nThe analysis showed that  \"substantially all of the volume\" reported on 71 out of the 81 exchanges was wash trading, a term that describes a person simultaneously selling and buying the same stock, or bitcoin in this case, to create the appearance of activity in the market. In other words, it's not real.Those exchanges report an aggregated $6 billion in average daily bitcoin volume. The study finds that only $273 million of that is legitimate. \"The idea that there's fake volume has been rumored for a long time; we were just the first people to systematically look at which exchanges were delivering real volume,\" Hougan told CNBC.The San Francisco-based firm compared at Coinbase Pro, which reports about $27 million in average daily volume in bitcoin. Its median  \"spread,\" or difference between the price a seller wants and the price a buyer wants, for bitcoin was about 1 cent. That scenario passed Bitwise's test for having real volume.But in another stark comparison, CoinBene — the biggest reported exchange on CoinMarketCap.com — has a nearly $15 spread. Hougan said they found other extreme examples of exchanges with a spread of more than $300. \"It is surprising that an exchange with almost 18 times the volume of Coinbase Pro would have a spread that is 1,500 times larger,\" Bitwise said in the report.Exchanges may have an incentive to report fake volume. Bad actors may look to attract listings for new initial coin offerings, or ICOs, who want their cryptocurrency on an exchange where more trading goes on, Bitwise said. Those fees can run from $1 million to $3 million per listing, according to data from Autonomous Next.U.S. regulators have taken a cautious approach to making bitcoin mainstream for traders. The SEC highlighted the risk of manipulation as reason for rejecting applications for other cryptocurrency ETFs. The office of New York Attorney General also flagged the issue in a recent report warning that exchanges are vulnerable. Because most cryptocurrency trading platforms don't use the same monitoring tools as stock exchanges, SEC Chairman Jay Clayton has warned that investors may not get a fair assessment of bitcoin's price. \"What investors expect is that trading in the commodity that underlies that ETF makes sense and is free from the risk of manipulation,\" Clayton said in November at the Consensus Invest Conference in Manhattan. \"It's an issue that needs to be addressed before I would be comfortable.\"Hougan said this also explains why trading volume for regulated bitcoin futures has seemed weak. Chicago-based CME and Cboe began listing bitcoin derivatives at the end of 2017 but have had much lower volumes than the $6 billion reported by unregulated exchanges. \"When you realize the size of the real bitcoin market, the CME starts to look a lot more significant,\" Hougan said.\n", "birthday": "2019-03-22T15:58:21+0000", "date": "2019-03-22 15:58:21", "year": 2019, "month": 3, "day": 22}
{"url": "https://www.cnbc.com/2019/03/28/wells-fargo-mastercard-ceos-say-blockchain-has-yet-to-live-up-to-the-hype.html", "title": "Wells Fargo, Mastercard CEOs say blockchain has yet to live up to the hype", "content": "\nTim Sloan, CEO of Wells FargoAdam Jeffery | CNBC\nTwo CEOs whose companies are experimenting with blockchain say the technology's reality has yet to catch up to its hype.The chief executives of Wells Fargo and Mastercard told CNBC's Andrew Ross Sorkin at the Fintech Ideas Festival on Wednesday that they see potential long term, but that blockchain's business use-case is still unclear. \"Blockchain has been way oversold,\" Wells Fargo CEO Tim Sloan said on stage at the conference in San Francisco. \"I think the fundamental technology is very interesting, but it's been very slow to roll out.\"Sloan pointed to a pilot the U.S. bank did with Commonwealth Bank in Australia, using blockchain for trade transactions. That and other blockchain  \"consortiums and pilots\" within the bank have yet gain real adoption, he said, adding that the Australia pilot resulted in just one transaction. \"If you turned the clock back a few years ago, it should have completely changed the industry — that's just not the way it works,\" Sloan said. \"Over time, I think it'll have an impact.\"Blockchain is also known as a distributed ledger, essentially a database that can't be altered or changed, and can be seen by all participants using it. Its use cases range from tracking lettuce on a supply chain to storing health records. The technology also underpins cryptocurrencies like bitcoin.Around the time bitcoin was climbing to nearly $20,000, blockchain was also becoming a corporate buzz word. In one case, a public company saw its stock soar 200 percent after announcing it was pivoting to blockchain. Executives have largely embraced blockchain, while very few have openly backed bitcoin.Mastercard CEO Ajaypal Banga also had reservations about the technology, even though it has the third most blockchain patents. \"I think blockchain could be interesting, but the business model is not proven,\" Banga said on stage with Sloan. \"A lot of this has to improve and change over time.\"Still, Mastercard is  \"deeply invested\" in a few blockchain ideas, he said, pointing to its potential to improve supply chains and problems with counterfeit goods. \"There are interesting possibilities with blockchain and to ignore that would be a bad idea,\" he said. \"We're just saying we don't know the business model yet.\"The sentiment echoes comments from a top executive at Bank of America, which has the most blockchain patents. The bank's tech and operations chief, Cathy Bessant, told CNBC she was  \"open-minded\" but on her \"private scoreboard, in the closet,\" she is \"bearish.\"\n", "birthday": "2019-03-28T10:52:04+0000", "date": "2019-03-28 10:52:04", "year": 2019, "month": 3, "day": 28}
{"url": "https://www.cnbc.com/2019/03/14/another-bitcoin-bull-market-is-coming-in-2019-fundstrats-tom-lee.html", "title": "Futures Now", "content": "\nVIDEO4:5504:55Another bitcoin bull market is coming in 2019, says Fundstrat's Tom LeeFutures Now\n2019 could mark the return of bitcoin, according to one bitcoin bull.The digital currency has had a difficult run since hitting its all-time high, sinking from its peak near $20,000 per coin in late 2017 to its current trading price of less than $4,000. The CME bitcoin futures curve is up nearly 6 percent year to date but has also fallen significantly from the 2017 peak.But Fundstrat Global Advisors strategist and known bitcoin bull Tom Lee — who in December valued bitcoin between $13,800 and $14,800 — says this year could bring about a comeback for the cryptocurrency, thanks to favorable macroeconomic trends. \"I think 2019's a year about repair,\" Lee said Thursday on CNBC's  \"Futures Now.\"  \"We have a risk-on rally in global markets that's positive for bitcoin; it was a headwind last year. And the dollar isn't surging like it was last year. That's a headwind that's gone away.\"And while Lee also noticed that bitcoin's technical indicators are stabilizing, with the digital currency managing to hold above its 200-week moving average, his thesis centered on the bigger picture. \"The real story is the fundamental one, that bitcoin's becoming quite useful,\" he said. \"We've seen the launch of digital currencies by not only J.P. Morgan and Mizuho Bank, but also Facebook and some social media companies gearing up. And, of course, in places like Venezuela, where bitcoin's become very large and widely used, turmoil is causing adoption growth. So I think these are really setting up for a strong ... year. \"Increased awareness around cryptocurrencies may also bring them closer to becoming an official asset class, a shift that is already starting to take shape, Lee said. \"Fidelity's launching digital custody. Bakkt is going to launch an exchange. We've already seen some high-profile endowments, and pension funds actually invest new money this year,\" he said. \"So I think, as an asset class, it's still the earliest days, but I think it's too glib to dismiss the macro.\"For the near term, Lee told prospective buyers to keep an eye on the 200-day moving average. If bitcoin maintains its current trading price around $4,000,  \"it'll cross above its 200-day by August,\" which could help it regain the ground it lost during its price collapse in late 2018, Lee said. \"I think the damage that needs to really be repaired is that collapse from $6,000 to $3,100, which came after the fork wars with Bitcoin Cash, \" he said. \"I think it really undermined investor confidence in sort of the dynamics around the market, so I think that bitcoin's going to spend a lot of time below $6,000 sort of fixing itself.\"But that might not take too long, Lee said:  \"I think the outside window is five or six months before bitcoin starts to look technically like it's back in a bull market.\"Disclosure: There is a possibility that Tom Lee and/or Fundstrat will from time to time have long or short positions in, and buy or sell, the securities or derivatives referred to in his research.\n\n", "birthday": "2019-03-14T19:26:34+0000", "date": "2019-03-14 19:26:34", "year": 2019, "month": 3, "day": 14}
{"url": "https://www.cnbc.com/2019/03/25/bank-of-america-skeptical-on-blockchain-despite-having-most-patents.html", "title": "Bank of America tech chief is skeptical on blockchain even though BofA has the most patents for it", "content": "\nCathy Bessant, chief operations and technology officer for Bank of America Corp., speaks during a Bloomberg Television interview in New York, U.S., on Wednesday, April 20, 2016.Michael Nagle | Bloomberg | Getty Images\nFor half a decade, Bank of America has quietly been preparing for a future in which the world of finance migrates to the blockchain.Under tech and operations chief Cathy Bessant, the giant bank has accumulated the most patents for the technology of any financial services company, for inventions ranging from blockchain-powered ATMs to storage for cryptocurrency keys.But Bessant now says she's grown doubtful that blockchain — the distributed ledger software behind cryptocurrencies like bitcoin — will amount to anything in the near term. Or possibly ever. \"What I am is open-minded,\" Bessant said recently in an interview at the bank's New York tower. \"In my private scoreboard, in the closet, I am bearish.\"Bessant is wading into the debate about the blockchain, whose proponents have claimed will be as significant as the internet. A blockchain is an encrypted database that runs on multiple computers, potentially cutting out the need for centralized authorities like banks or governments to settle transactions between parties.Economist Nouriel Roubini has called it  \"the most overhyped \" technology in history. Others have said that blockchain merely needs time to evolve and could eventually upend entire industries from finance to cloud computing and health care.As the mania over cryptocurrencies died down in the past year amid a bear market, attention and dollars have funneled into blockchain start-ups. Venture capital firms poured $5.4 billion into blockchain start-ups last year, compared with $1.5 billion in 2017, according to Autonomous Research.\n'Show me the use case'\nThe technology got a boost from rival J.P. Morgan Chase, which revealed last month that it created the first cryptocurrency backed by a major U.S. bank to facilitate blockchain-related payments.But Bessant, who oversees 95,000 technology workers and was named the most powerful woman in banking last year, is a pragmatist. She started out at Bank of America in 1982 as a commercial banker, eventually rising to a series of top roles, including head of corporate banking and chief marketing officer. She has run the bank's global technology and operations division since 2010.Most of what she sees doesn't make sense for finance or significantly improve upon existing methods. She said it's a technology in search of a use case, rather than something designed specifically to solve existing problems. \"I haven't seen one [use case] that even scales beyond an individual or a small set of transactions,\" Bessant said. \"All of the big tech companies will come and say 'blockchain, blockchain, blockchain.' I say, 'Show me the use case. You bring me the use case and I'll try it'.\" \"I want it to work,\" she added. \"Spiritually, I want it to make us better, faster, cheaper, more transparent, more, you know, all of those things.\"\nPatent stockpile\nThe bank has applied for or received 82 blockchain-related patents, more than any other financial firm, including payment companies Mastercard and PayPal, according to intellectual property law firm EnvisionIP. By comparison, J.P. Morgan has six patent applications.Bessant said most of the patents allow Bank of America's systems to plug into blockchain should the need arrive. Think of it as future-proofing the second biggest U.S. bank against the threat of being relegated to the sideline. \"Basically, we want to be ready,\" she said. \"We want to reserve our place in the IP chain for, or if, blockchain fulfills what some people believe its potential is.\"She is most skeptical of the prospects for public blockchains (bitcoin runs on one), where anyone can set up an account and participate. Private blockchains, which require intermediaries to give permission to users, could help financial institutions serve clients better and at lower cost  \"at some point,\" Bessant said.\nJPM Coin\nIt's a less radical version of blockchain because banks and other established firms control who gets to use it. Only J.P. Morgan clients who have been vetted for regulatory reasons will be able to transact with JPM Coin, for instance. Even there, Bessant has her doubts. \"I will be curious to see what the actual volume of usage is on the JPM Coin in a year,\" she said.Others see more potential for blockchain, especially for areas like trade finance. Blockchain will begin to have an effect there in three to five years, Joyce Chang, J.P. Morgan's chair of global research, said in a Jan. 24 research note.During the wide-ranging interview, Bessant also talked about the bank's efforts to retrain its 95,000 technology workers. Last year, she dispatched executives to Google, Oracle and IBM to understand how those firms train their employees in new skills. The bank formed internal universities with more than 80,000 courses to help its workers stay relevant.Bessant also addressed the so-called techlash against companies like Facebook and Google, in part because of high-profile scandals involving the use of customer data.Lenders are more heavily regulated than technology companies in the U.S., and Bank of America is working to protect customers at the moment financial transactions happen with more robust authentication methods, she said. That will help prevent fraud even if users' private data has been stolen, she added. \"We've all, as a society, given up data far in advance of knowing how it was going to be used,\" Bessant said. \"Regulation will come to other sectors. I believe the need is there. I believe that consumers and users will demand it.\"\n", "birthday": "2019-03-26T10:58:38+0000", "date": "2019-03-26 10:58:38", "year": 2019, "month": 3, "day": 26}
{"url": "https://www.cnbc.com/2019/04/28/bitcoin-bull-tom-lee-says-new-crypto-highs-likely-by-2020.html", "title": "Futures Now", "content": "\nVIDEO7:3107:31Bitcoin bull Tom Lee says the 'crypto winter' is over, says new all-time highs by 2020 'likely'Futures Now\nBitcoin is back, according to longtime bull Tom Lee.Despite the cryptocurrency's drop in early Friday trading — a symptom of worries around the legitimacy of another digital currency called tether — it's going higher, and may even be in a bull market already, Lee tells CNBC. \"Last year was a terrible year for crypto, a massive bear market, and we published a piece this week just highlighting … 11 signs that historically only take place in a bull market. So I think the evidence is mounting that there's a bull market,\" Lee, who is managing partner and head of research at Fundstrat Global Advisors, said Thursday on  \"Futures Now.\"Of the 11 signs that the  \"crypto winter\" is over, Lee's top bullish drivers for bitcoin have to do with blockchain, technical indicators and trading volumes.The first sign came in January, when Lee's team noticed that trading volumes on the blockchain — a technology some use to buy and sell bitcoin — turned positive year over year. That boost was helped by turmoil in Venezuela and Turkey, where people losing faith in their countries' currencies may have turned to bitcoin as an alternative, Lee explained. \"Just taking those two countries, they're close to 30% of the increase in on-chain activity, so it's meaningful,\" he said. \"People are saying, 'Look, I don't trust using these local currencies. I don't trust the banks. I'm going to start using bitcoin.' And that's what's causing on-chain volume to really take off.\"The second sign came in April, when bitcoin closed above its 200-day moving average, a widely accepted technical indicator of bullish momentum.The third sign stemmed from a Fundstrat survey of over-the-counter brokers, who Lee said are  \"really important in terms of how institutional investors trade crypto.\" They told the firm that activity levels based on number of clients saw a 60% to 70% increase, and that trading per client surged. \"I think you're seeing signs that fundamentals are improving, technicals are improving, and now there's real activity by, essentially, crypto hodlers,\" Lee said, using an industry term that refers to people who hold cryptocurrencies rather than trading or selling them.Lee's eight other bullish signs include shrinking supply; a swing to the positive in Fundstrat's Bitcoin Misery Index; consensus among  \"original\" bitcoin bulls that the bottom has been put in for bitcoin; and a recent \"golden cross\" for bitcoin, or when the 50-day moving average overtakes the 200-day.All this, he said, goes to show that bitcoin's not done climbing, and that these catalysts are  \"likely\" to drive it to new all-time highs \"around\" 2020.Lee, who predicted a 2019 bull market for bitcoin in March, added that the cryptocurrency's standard deviation from the S&P 500 — which this year is about 2.5 — could also help push it higher. \"One thing to keep in mind is whenever the S&P has made a big move, ... it's almost always led to a big move in crypto later in the year,\" he said. \"So I think … a 2.5 standard deviation move for bitcoin would take it to $14,000. I'm not saying that's where it's going to go, but that's the magnitude of move that would be a catch-up.\"Bitcoin traded in a wide range Friday on account of weakness in the broader cryptocurrency market, settling in roughly the $5,100 per coin range. Lee noted in a Friday call with CNBC that tether's issues don't have  \"much effect on bitcoin,\" since most people are \"long tether because [they] don't want to be long bitcoin.\"\n\n", "birthday": "2019-04-28T18:00:24+0000", "date": "2019-04-28 18:00:24", "year": 2019, "month": 4, "day": 28}
{"url": "https://www.cnbc.com/2019/04/02/bitcoin-spike-blamed-on-an-april-fools-joke-but-thats-not-why-it-rallied.html", "title": "Bitcoin spike blamed on an April Fools' joke — but that's not why it rallied", "content": "\nVIDEO1:3201:32Bitcoin surged 20 percent overnight thanks to a 'mystery buyer'The Bottom Line\nBitcoin wasn't immune to April Fools' Day jokes.One prank in particular got some credit for boosting the price of the world's largest cryptocurrency. After bitcoin broke above $5,000 on Tuesday, its highest level of the year, some blamed trading algorithms designed to buy or sell based on news. As some speculated, robots triggered a buying frenzy after an April Fools' Day article by Finance Magnates outlined an  \"emergency meeting\" by regulators over the weekend to approve a bitcoin exchange-traded fund.But multiple experts say the buzz was not responsible for bitcoin's recovery. Hunter Horsley, whose company Bitwise was mentioned in the April Fool's Day report, said there was no truth to the ETF rumor. \"It's absurd to believe this market move is the result of confusion about the Bitcoin ETF filings,\" said Horsley, CEO of Bitwise, which is in the process of applying for the first-ever bitcoin ETF. \"Though ETFs and April Fools are topical, there are lots of reasons this is an unlikely explanation.\"The most likely explanation, he said, is a Reuters report of a private buyer purchasing more than $100 million worth of bitcoin over a short period. Given the small daily trading volume of bitcoin,  \"that order would be enough to have an impact,\" he said. \"Crypto is famous for a long history of volatility like this. It's always hard to pin down the true impetus, and often the real source is not obvious,\" Horsely said.Another rumor was that Berkshire Hathaway CEO Warren Buffett — one of bitcoin's most vocal critics — was diversifying into the asset class. As founder and CEO of BKCM Brian Kelly put it,  \"there's no way\" that's the reason.A more realistic possibility is that bitcoin hit a key technical level, he said. Kelly pointed to a key $4,200 price level triggering a stop-loss trade. In bitcoin and other assets, traders will often set a certain level for when they automatically cover their short. It may also be a sign that fundamentals are improving and bitcoin is running out of sellers, according to Kelly. \"Everyone who panicked and sold is already out,\" Kelly told CNBC on Tuesday.Arca Chief Investment Officer Jeff Dorman, a former trader for Lehman, Merrill and Citadel, said even if buying by trading algorithms kicked off the euphoria, that would have reversed quickly if investors were eager to sell. Instead, the rally boosted bitcoin to its highest level since November. This particular rally was caused by a  \"simple\" imbalance of more buyers than sellers, he said. \"The large magnitudes of the moves in crypto make it more interesting of a story, but it's not that different than any other asset class,\" Dorman said. \"Buyers outweighed sellers, and market makers felt the pressure so they took their markets higher, which triggered stop losses and liquidations, which added more buy pressure.\"Bitcoin prices have seen a relatively calm 2019 after a year of volatility. The cryptocurrency fell roughly 75 percent last year after climbing to a high of almost $20,000 at the end of 2017. It has yet to recover to anywhere near that since and was trading near $4,766 as of 4 p.m. ET Tuesday.But still, Dorman said some investors may be looking to get back in. \"The fact that every small dip has been bought immediately in the last few weeks shows that investors are not scared of sell-offs, they are hoping for them so they can buy more,\" he said. \"This certainly raises the near-term floor, but this sentiment can change on a dime too.\"\n", "birthday": "2019-04-02T18:00:55+0000", "date": "2019-04-02 18:00:55", "year": 2019, "month": 4, "day": 2}
{"url": "https://www.cnbc.com/2019/04/02/bitcoin-rallies-14percent-to-its-highest-level-since-november-last-year.html", "title": "Bitcoin rallies 15% to its highest level since November", "content": "\nVIDEO1:3201:32Bitcoin surged 20 percent overnight thanks to a 'mystery buyer'The Bottom Line\nBitcoin jumped suddenly on Tuesday, following months of relatively low volatility in an asset once known for its wild price swings.The price of the world's largest cryptocurrency bounced more than 15 percent higher to $4,766 as of 4 p.m. ET Tuesday.  That marks its highest level since late November, according to CoinDesk. Earlier Tuesday, bitcoin briefly touched the $5,000 mark on the Luxembourg-based Bitstamp exchange. The digital asset has added over $14 billion to its market value in the last 24 hours, according to CoinMarketCap.The reason for the sudden price jump wasn't immediately clear. Other virtual currencies were also higher, with ether and XRP rising 10 and 9 percent, respectively.\nVIDEO3:0703:07Jack Dorsey spends $10K a week on bitcoin, predicts a 'massive' bitcoin boomFast Money\nExperts attributed the price hike to a breakout from a closely-watched resistance level of $4,200. Bitcoin had been hovering around the $4,000 mark for several months. \"Bitcoin's break above $4,200 this morning was critical, as the market had been watching that level for a while,\" Mati Greenspan, senior market analyst at trading platform eToro, told CNBC. \"No doubt some entry orders and stop losses were grouped right above.\" Meaning that certain algorithmic trades had kicked in after it reached this higher level.\n\nIt comes after a massive slump for the cryptocurrency market last year. Bitcoin fell over 76 percent in 2018, and is still well below an all-time high near $20,000 it notched in December 2017. \"Bitcoin has been trading range bound for a while now and shaking off some of the negative sentiment that it accrued in 2018,\" Charles Hayter, chief executive of digital currency comparison firm CryptoCompare, told CNBC. \"This trigger was through volume-led price action driving the price and triggering algos on a breakout.\"\n\n\n\n\n\n\n\n\n\t\t\t\n\t\t\ta {color: #fff;}\n\t\t\t\n\t\t\t.widget-container {\n\t\t\t\tbackground-color: #1c2b33;\n\t\t\t\twidth: 100%;\n\t\t\t\tpadding: 10px;\n\t\t\t}\n\t\t\t\n\t\t\t.widget-container p {\n\t\t\t\tcolor: #fff;\n\t\t\t}\n\t\t\t\n\t\t\t.widget-container a {colour: #337ab7;}\n\t\t\t\n\t\t\t.widget-header {\n\t\t\t\tmargin-bottom: 40px;\n\t\t\t}\n\t\t\t\n\t\t\t.widget-header > img {\n\t\t\t\t\tmax-width: 490px;\n\t\t\t\t}\n\t\t\t\n\t\t\t.bodycontent {\n\t\t\t\tmargin-bottom: 20px;\n\t\t\t\t\n\t\t\t}\n\t\t\t\n\t\t\t.form-field {margin-bottom: 10px;}\n\t\t\t\n\t\t\t@media only screen and  (max-width: 780px) {\n\t\t\t\t.widget-header > img {\n\t\t\t\t\twidth: 100%;\n\t\t\t\t\tmax-width: 100% !important;\n\t\t\t\t}\n\t\t\t}\n\n\t\t\nvar w=window;if(w.performance||w.mozPerformance||w.msPerformance||w.webkitPerformance){var d=document;AKSB=w.AKSB||{},AKSB.q=AKSB.q||[],AKSB.mark=AKSB.mark||function(e,_){AKSB.q.push([\"mark\",e,_||(new Date).getTime()])},AKSB.measure=AKSB.measure||function(e,_,t){AKSB.q.push([\"measure\",e,_,t||(new Date).getTime()])},AKSB.done=AKSB.done||function(e){AKSB.q.push([\"done\",e])},AKSB.mark(\"firstbyte\",(new Date).getTime()),AKSB.prof={custid:\"411582\",ustr:\"cookiepresent\",originlat:\"0\",clientrtt:\"182\",ghostip:\"65.158.115.6\",ipv6:false,pct:\"10\",clientip:\"166.111.68.231\",requestid:\"1364e3d\",region:\"26767\",protocol:\"\",blver:14,akM:\"e12\",akN:\"ae\",akTT:\"O\",akTX:\"1\",akTI:\"1364e3d\",ai:\"265598\",ra:\"false\",pmgn:\"\",pmgi:\"\",pmp:\"\",qc:\"\"},function(e){var _=d.createElement(\"script\");_.async=\"async\",_.src=e;var t=d.getElementsByTagName(\"script\"),t=t[t.length-1];t.parentNode.insertBefore(_,t)}((\"https:\"===d.location.protocol?\"https:\":\"http:\")+\"//ds-aksb-a.akamaihd.net/aksb.min.js\")}\n\n\nEach morning, the “Beyond the Valley” newsletter brings you all the latest from the vast, dynamic world of tech – outside the Silicon Valley.\nSubscribe:\n\n\n\n\t\t\t<!--\n\t\t\tfunction validate_signup(frm) {\n\t\t\t\tvar emailAddress = frm.Email.value;\n\t\t\t\tvar errorString = '';\n\n\n\n\t\t\t\t\tif (emailAddress == '' || emailAddress.indexOf('@') == -1) {\n\t\t\t\t\terrorString = 'Please enter your email address';\n\t\t\t\t}\n\n\n\t\t\tvar els = frm.getElementsByTagName('input');\n\t\t\tfor (var i = 0; i < els.length; i++)\n\t\t\t{\n\t\t\t\tif (els[i].className == 'text' || els[i].className == 'date' || els[i].className == 'number')\n\t\t\t\t{\n\t\t\t\t\tif (els[i].value == '')\n\t\t\t\t\t\terrorString = 'Please complete all required fields.';\n\t\t\t\t}\n\t\t\t\telse if (els[i].className == 'radio')\n\t\t\t\t{\n\t\t\t\t\tvar toCheck = document.getElementsByName(els[i].name);\n\t\t\t\t\tvar radioChecked = false;\n\t\t\t\t\tfor (var j = 0; j < toCheck.length; j++)\n\t\t\t\t\t{\n\t\t\t\t\t\tif (toCheck[j].name == els[i].name && toCheck[j].checked)\n\t\t\t\t\t\t\tradioChecked = true;\n\t\t\t\t\t}\n\t\t\t\t\tif (!radioChecked)\n\t\t\t\t\t\terrorString = 'Please complete all required fields.';\n\t\t\t\t}\n\t\t\t}\n\n\n\n\t\t\t\tvar isError = false;\n\t\t\t\tif (errorString.length > 0)\n\t\t\t\t\tisError = true;\n\n\t\t\t\tif (isError)\n\t\t\t\t\talert(errorString);\n\t\t\t\treturn !isError;\n\t\t\t}\n\n\n\t\t\t//-->\n\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBy signing up for newsletters, you are agreeing to our Terms of Use and Privacy Policy. \n\n\n\n\n\n\n\n", "birthday": "2019-04-02T07:34:59+0000", "date": "2019-04-02 07:34:59", "year": 2019, "month": 4, "day": 2}
{"url": "https://www.cnbc.com/2019/04/02/bitcoin-bull-says-digital-currency-is-bottoming-could-run-to-6000.html", "title": "Futures Now", "content": "\nVIDEO6:3406:34Bitcoin bull says surge above $5,000 could just be the beginningFutures Now\nBitcoin may have just bottomed, according to one investor.The digital currency's unexpected surge on Tuesday caught Wall Street by surprise, spurring rumors of a deep-pocketed mystery buyer. Bitcoin prices climbed as much as 20 percent, trading above $5,000 for the first time since November.Tuesday's moves were notable — bitcoin's best one-day gain since April 2018 — but one self-proclaimed bull wasn't too surprised. \"Sentiment has shifted here,\" Brian Kelly, founder and CEO of digital currency investment firm BKCM, told CNBC's  \"Futures Now\" on Tuesday.  \"All indications that we have — whether it be fundamentals, technicals, the quantitative analysis we do — all suggest that we probably have at least started to put in the bottoming process.\"Kelly, who also appears as a trader on CNBC's  \"Fast Money,\" pointed out that bitcoin's past trading cycles have looked  \"very similar\" to its current pattern. \"You have that one last flush-out, and then the market starts to trade higher,\" he said. \"What's interesting about this move is it's happening on improving fundamentals and improving institutional sentiment.\"And while Tuesday's big buyer remains anonymous, more broad-based institutional interest is one of the main drivers for Kelly's bitcoin bull case. \"Even high net worth individuals, family offices, are starting to take a serious interest\" in bitcoin, Kelly said. \"There's a couple major brokerage firms that are rolling out some custody solutions. So there's quite a bid going on under the surface.\"That bull case, which also hinges on increasing trading volume, improving fundamentals and an uptick in short sellers  \"covering,\" or cashing out of, their positions in bitcoin, could send bitcoin back to prices not seen since last November, Kelly said. \"Probably a reasonable target is close to $6,000 for this move,\" he said, noting that he wouldn't call bitcoin overvalued until it reached the $6,500 to $6,800 range.Bitcoin prices traded in a wide range Tuesday, eventually stabilizing at roughly $4,700 a share, according to Bitstamp.\n\n", "birthday": "2019-04-02T19:02:53+0000", "date": "2019-04-02 19:02:53", "year": 2019, "month": 4, "day": 2}
{"url": "https://www.cnbc.com/2019/04/09/china-says-it-wants-to-eliminate-bitcoin-mining.html", "title": "China says it wants to eliminate bitcoin mining", "content": "\nA bitcoin mine near Kongyuxiang, Sichuan, China on August 12, 2016.Paul Ratje | The Washington Post | Getty Images\nChina's state planner wants to ban bitcoin mining, according to a draft list of industrial activities the agency is seeking to stop in a sign of growing government pressure on the cryptocurrency sector.China is the world's largest market for computer hardware designed to mine bitcoin and other cryptocurrencies, even though such activities previously fell under a regulatory grey area.The National Development and Reform Commission (NDRC) said on Monday it was seeking public opinions on a revised list of industries it wants to encourage, restrict or eliminate. The list was first published in 2011.The draft for a revised list added cryptocurrency mining, including that of bitcoin, to over 450 activities the NDRC said should be phased out as they did not adhere to relevant laws and regulations, were unsafe, wasted resources or polluted the environment.It did not stipulate a target date or plan for how to eliminate bitcoin mining, meaning that such activities should be phased out immediately, the document said. The public has until May 7 to comment on the draft.State-owned newspaper Securities Times said on Tuesday that the draft list  \"distinctly reflects the attitude of the country's industrial policy\" towards the cryptocurrency industry.\n\nLast week, the price of bitcoin soared nearly 20 percent in its best day since the height of the 2017 bubble, and breaking $5,000 for the first time since mid-November, though analysts and traders admitted that they were puzzled by the surge.On Tuesday, bitcoin was trading at $5,190.The cryptocurrency sector has been under heavy scrutiny in China since 2017, when regulators started to ban initial coin offerings and shut local cryptocurrency trading exchanges.China also began to limit cryptocurrency mining, forcing many firms — among them some of the world's largest — to find bases elsewhere.Chinese companies are also among the biggest manufacturers of bitcoin mining gear, and last year three filed for initial public offerings in Hong Kong, looking to raise billions of dollars.\nVIDEO5:3005:30Trader bets bitcoin rally isn't overFutures Now\nHowever, the two largest, Bitmain Technologies, the world's largest manufacturer of bitcoin mining gear, and Canaan Inc, have since let their applications lapse.People familiar with the deals said that Hong Kong regulators had many questions about the companies' business models and prospects.According to Canaan's IPO prospectus filed last year, sales of blockchain hardware primarily for crypto currency mining in China were worth 8.7 billion yuan ($1.30 billion) in 2017, 45 percent of global sales by value.The prospectus forecasts that sales in China would rise to 35.6 billion yuan by 2020.\n", "birthday": "2019-04-09T09:38:03+0000", "date": "2019-04-09 09:38:03", "year": 2019, "month": 4, "day": 9}
{"url": "https://www.cnbc.com/2019/04/11/coinbase-launches-debit-card-in-uk-to-pay-by-crypto.html", "title": "Coinbase launches a debit card in the UK to make it easier to pay with cryptocurrencies", "content": "\nCoinbase launched its own debit card in the U.K. on Thursday, in an effort to promote the use of cryptocurrencies in payments as well as investing.Coinbase\nDigital currency exchange Coinbase launched a debit card in the U.K. on Thursday to make it easier for customers to pay in stores and online with cryptocurrencies like bitcoin, ethereum and litecoin.The Coinbase Card is a contactless Visa debit card that syncs directly with a user's Coinbase account. The card will be accepted at any retailer around the world that accepts, Coinbase U.K. CEO Zeeshan Feroz told CNBC in an interview in London. He said the card will give users the ability to spend and invest cryptocurrencies from one common platform. \"There's a real advantage in actually being able to deposit crypto and interact with crypto because the crypto ecosystem is so much more than the investment aspect,\" Feroz said.\n\nRetailers themselves would not actually be taking payments in cryptocurrencies, Feroz said.Instead, Coinbase charges users a small fee of about 2.5 percent to convert fiat money, such as the British pound, into a cryptocurrency, like ethereum.Users can decide which crypto wallet they would like to use for the payment through a new Coinbase Card app, the company said. The amount of the selected cryptocurrency would then be withdrawn from a customer's Coinbase account. \"We've tried to keep the fees as competitive as possible,\" Feroz said.Coinbase said it has an e-money license in the U.K. to enable the payments. Feroz added the company is also applying for a European e-money license and hopes to expand to other European countries by mid-April. It opened an office in Dublin last year as part of a contingency plan ahead of Brexit.\nVIDEO3:3403:34What is fintech?CNBC Explains\nMany fintech companies are working on solutions to try to make crypto payments and trading more accessible. Revolut in the U.K. and Square in the U.S. offer crypto trading on their platforms. Facebook is reportedly developing a cryptocurrency for global payments to use through WhatsApp.One of Coinbase's biggest rivals Binance, meanwhile, made a push of its own into debit and credit card payments via a partnership with fintech firm Simplex earlier this year.Coinbase said it would give the first 1,000 cards away for free to U.K. customers who sign up on a waitlist. After that, each card will cost roughly 5 pounds ($6.60).There are no monthly fees to keep the card open or to hold a Coinbase account, the company said. Customers will also be able to withdraw up to 200 pounds per month from ATMs using the card.\n", "birthday": "2019-04-10T23:36:30+0000", "date": "2019-04-10 23:36:30", "year": 2019, "month": 4, "day": 10}
{"url": "https://www.cnbc.com/2019/04/23/masayoshi-son-invested-in-bitcoin-and-reportedly-lost-130-million.html", "title": "SoftBank's Masayoshi Son got caught up in the bitcoin frenzy and reportedly lost $130 million", "content": "\nCorp. Chief Executive Officer Masayoshi Son speaks during a joint announcement with Toyota Motor Corp. to make new venture to develop mobility services in Tokyo, Japan, 04 October 2018.Alessandro Di Ciommo | NurPhoto | Getty Images\nJapanese billionaire Masayoshi Son, the founder of conglomerate SoftBank, personally lost over $130 million when he sold his position in bitcoin, the Wall Street Journal reported on Tuesday.Son made the investment in late 2017 the report said, near the digital currency's record high near $20,000 in December of that year. Bitcoin has traded around $5,000 in recent weeks. While it is unknown exactly how much bitcoin Son bought, he sold early last year after the speculative digital currency's value collapsed.The move reportedly followed Son receiving a recommendation by a  \"bitcoin evangelist.\" SoftBank had bought the investment firm of that person earlier in the same year, the report said. Despite his reputation as a keen investor, the bet on bitcoin is not the first such quick, risky bet by Son. He is known widely as someone who will make multi-million dollar investments in companies after only spending a short time with founders and CEOs.SoftBank is the largest venture capital firm in the world, with a total net asset value estimated as high as $190 billion. Son's focus on long-term investments in tech companies helped him lead the $100 billion SoftBank Vision Fund, with stakes in Uber, Nvidia, Flipkart, WeWork, OneWeb and more.Read the full report here.\n", "birthday": "2019-04-23T13:23:28+0000", "date": "2019-04-23 13:23:28", "year": 2019, "month": 4, "day": 23}
{"url": "https://www.cnbc.com/2019/05/02/facebook-recruiting-partners-for-crypto-payments-project-libra-wsj.html", "title": "Facebook is reportedly looking for allies to support its planned cryptocurrency payment service", "content": "\nFacebook CEO Mark ZuckerbergMarlene Awaad | Bloomberg | Getty Images\nFacebook has been in talks with dozens of financial firms and e-commerce companies to support a cryptocurrency payments plan that it is developing, according to The Wall Street Journal.The social company has spoken with various companies, including Visa and Mastercard, about what it calls Project Libra, according to Thursday's report.The project would include a digital currency, underpinned by blockchain technology and pegged to the U.S. dollar, which users of Facebook's WhatsApp messaging service could use to send money to one another, according to the Journal and a December report by Bloomberg.The company has been recruiting e-commerce companies and apps to accept the Facebook currency, the Journal said. One idea under consideration is rewarding Facebook users with fractions of the digital currency in exchange for looking at advertisements, the report said. Facebook may also seek to embed its payment system in third-party websites and apps, similar to how third parties use Facebook today.Facebook is undergoing a major shift to focus on privacy, and CEO Mark Zuckerberg has talked at length about how important payments and private commerce will be to its future. Zuckerberg has said that if e-commerce takes off on Facebook's various apps, that could drive brands to spend more on advertisers. The company could also eventually create new revenue streams from financial services if users adopt its payments features. \"Payments and commerce are Facebook's only way out from its freemium, advertisement business model,\" said Henry Liu, a former Facebook employee and managing partner of YGC, an enterprise blockchain investment firm.Read the full report in the Wall Street Journal.WATCH: Here's how to see which apps have access to your Facebook data — and cut them off\nVIDEO1:1001:10Here's how to see which apps have access to your Facebook data — and cut them offDigital Original\n\n", "birthday": "2019-05-02T23:46:45+0000", "date": "2019-05-02 23:46:45", "year": 2019, "month": 5, "day": 2}
{"url": "https://www.cnbc.com/2019/01/04/bitcoin-turns-10-the-obscure-technology-that-became-a-household-name.html", "title": "Bitcoin turns 10: The obscure technology that became a household name", "content": "\nVIDEO0:5300:53Happy birthday bitcoin: The cryptocurrency is turning tenCryptocurrency\nThe world's first bitcoins were mined ten years ago this week.Since then the cryptocurrency has been on a wild ride, surviving massive price swings, hackings and intense global scrutiny. Bitcoin's ups and downs have helped the asset go from a little-understood concept to a household name. \"Over the last 10 years we've gone from this didn't exist to now pretty much the entire world understands what it is, whether they agree with it or not,\" Mati Greenspan, senior market analyst at trading platform eToro, told CNBC on Friday.CNBC takes a look at bitcoin's tumultuous price history over the last decade.\n2009\nThe first bitcoins were mined in a block of 50 coins called  \"Genesis Block\" on January 3, 2009. The act of mining bitcoins entails computers trying to solve complex mathematical problems to validate transactions. Computers compete to verify a group of transactions known as a \"block.\" The computer, or miner, that can validate the block the fastest receives a reward in bitcoins.The concept of bitcoin, and its underlying blockchain technology, was laid out in a white paper published in October 2008 by Satoshi Nakamoto, whose true identity remains a mystery today. Nakamoto envisioned bitcoin as an alternative form of electronic cash that would not require the backing of the government or a financial institution.The first-ever bitcoin transaction took place on January 9, 2009 between Nakamoto and software developer Hal Finney.\n\n2010\nIt's widely believed the first real-world bitcoin transaction was made in May 2010 by programmer Laszlo Hanyecz. Hanyecz spent 10,000 bitcoins on two Papa John's pizzas; those pizzas would now be worth more than $30 million at today's bitcoin price.Bitcoin gained public attention later in 2010 with the creation of an exchange called Mt. Gox. The Tokyo-based exchange allowed investors to trade bitcoin, which was priced around $0.07 per coin for most of that year, according to CoinDesk.\n2011\nBitcoin's price hit a milestone $1 in 2011. But a series of hacks on the Mt. Gox exchange that year exposed the cryptocurrency's vulnerability to big price swings.\n2013\nBitcoin topped $1,000 for the first time in November 2013 but the spike didn't last long. The cryptocurrency would close the year trading at around $700, according to data from CoinDesk.\n2014\nMt. Gox, which handled roughly 70 percent of all bitcoin transactions, declared bankruptcy after hackers stole roughly half a billion dollars worth of coins. The hacking exposed the lack of regulation in the cryptocurrency and scared away many investors. By the end of 2014, the price of bitcoin barely breached $300, a level where it would stay for the next three years.\nVIDEO5:2205:22Should you invest in a cryptocurrency?CNBC Explains\n2017\nBitcoin momentum started to build in early 2017, when the price of a coin again crossed $1,000. More investors bought into the idea of a decentralized currency, seeking a safe-haven investment similar to gold.To meet growing demand, two U.S. exchanges, the CME and Cboe, created platforms for customers to trade bitcoin futures.As the cryptocurrency went mainstream, frenzy ensued. Bitcoin's price surged from around $2000 in July to nearly $20,000 in December.\n2018\nBitcoin's price dropped from sky-high levels to kick off 2018 as investors fretted the bubble was bursting. Regulators around the world started to crack down on cryptocurrency trading, causing particularly volatile price swings.Many hedge funds, retail investors and traders who had bet big on bitcoin took heavy losses as the digital asset's price plummeted, closing the end of the year at around $4,000.\nVIDEO4:0404:04What is a bubble?CNBC Explains\n2019\n \"The last 10 years for Bitcoin, whilst broadly telling a hugely successful story, has also not been without difficulty,\" wrote David Thomas co-founder of London-based cryptocurrency exchange GlobalBlock in an email to CNBC on Wednesday.Bitcoin bulls say a comeback is due but retail investors might not want to stomach continued volatility. Regulatory uncertainty is likely to remain one key factor in bitcoin trading this year. \"If, as expected, increased regulation enters the market then Bitcoin will be opened up to a broader investor base, and with increased adoption, we expect to see volatility reduce and stability increase both of which will establish Bitcoin and cryptocurrencies further as an asset class in their own right,\" added Thomas.— CNBC's Kate Rooney and Arjun Kharpal and Reuters contributed to this report.\n", "birthday": "2019-01-04T15:03:26+0000", "date": "2019-01-04 15:03:26", "year": 2019, "month": 1, "day": 4}
{"url": "https://www.cnbc.com/2019/01/04/bitcoin-digital-currencies-experts-stocks.html", "title": "Watch nine experts break down what to expect from cryptocurrencies in 2019", "content": "\nThe crypto-craze started off 2018 with a bang, but 12 months later, bitcoin prices have sunk to below $4,000. Can bitcoin and other digital currencies mount a comeback in 2019? Here's what nine experts say to expect from cryptocurrencies in 2019.\n\n", "birthday": "2019-01-04T22:59:21+0000", "date": "2019-01-04 22:59:21", "year": 2019, "month": 1, "day": 4}
{"url": "https://www.cnbc.com/2019/01/22/one-of-the-worlds-largest-crypto-exchange-looks-to-go-public-in-the-us-through-a-reverse-merger.html", "title": "One of the world's largest crypto exchanges looks to go public in the US through a reverse merger", "content": "\nPedestrians look at monitors showing the prices of virtual currencies at the Bithumb exchange office in Seoul, South Korea, Feb. 2, 2018.SeongJoon Cho | Bloomberg | Getty Images\nOne of the world's largest cryptocurrency exchanges could soon be the first big one to be publicly traded.Singapore-based holding company BTHMB is looking to list in the U.S. by acquiring a publicly traded company here. On Tuesday, a holding company called Blockchain Industries, which trades publicly on U.S. over-the-counter markets under the ticker BCII, announced it had signed a binding letter of intent with BTHMB, which is being renamed Blockchain Exchange Alliance.This so-called reverse merger is a nonconventional way of getting into the public markets and could be much faster than an initial public offering, or IPO. A source told CNBC that Blockchain Exchange Alliance had contemplated listing in Singapore but did not want to wait the year or two it might take to complete an IPO.The combined company plans to eventually  \"up-list,\" meaning it would move from over-the-counter markets, which are known for trading penny stocks, to the New York Stock Exchange or Nasdaq, sources told CNBC. That would also require the company to meet stiffer listing requirements.Blockchain Exchange Alliance would wind up being the majority of the combined company.This would mark the first major cryptocurrency company exchange to be publicly listed. While none have taken this IPO route, this reverse-merger move has already been tested.Former hedge-fund manager Mike Novogratz used the tactic to list his crypto merchant bank on a Canadian stock market. He first bought Canadian crypto start-up Coin Capital, then merged through a reverse takeover with Canadian shell company Bradmer Pharmaceuticals. The renamed company trades as Galaxy Digital Holdings Ltd on Canada's TSX Venture Exchange.But Novogratz's company has struggled along with bitcoin. In the first quarter of 2018, it lost $134 million as cryptocurrencies lost half their value. Since its trading debut on Aug. 1, shares of GLXY have dropped roughly 36 percent.According to an investor deck seen by CNBC, Blockchain Exchange Alliance says it has broader plans in crypto beyond bitcoin. It's planning to buy up and consolidate exchanges across the world. It plans on creating a global crypto exchange alliance, which is already underway. The group intends to have nine exchanges by the end of this year, and as many as 40 by the end of 2020, according to the investor deck.\nCrypto controversy\nBlockchain Exchange Alliance acquired a controlling interest in Bithumb Holdings and as a result now has an interest in Bithumb Korea, according to the documents. The Seoul-based exchange is the second-largest by exchange volume, according to Coinmarketcap.com, and was the largest as of November 2018, according to a recent report by CryptoCompare.The accuracy of that trading volume has come under question.In December, Forbes reported that a cryptocurrency exchange rating service called CER had accused Bithumb of faking more than 90 percent of its trading volume. As of the summer, the exchange ranked among the bottom of the top 10 global exchanges by daily volume. By November, though, CER said it jumped to second on CoinMarketCap.com's list of exchanges measured by volume. CER claimed it was a result of selling and buying at the same time to create misleading and artificial activity, known as  \"wash trading.\"In June, Bithumb was the victim of a high-profile $31 million hack. The exchange said it was temporarily suspending deposit and withdrawal services, that the stolen coins would be covered from its own reserves and that all users' assets were being transferred to safer  \"cold wallets.\"The deal may not sit well with regulators paying close attention to the nefarious sides of crypto. Since transactions are anonymous, many have called out their potential use for money-laundering and criminal activity. If nothing else, the stock may trade at a discount because of that risk, a source told CNBC.Cryptocurrencies have gotten their fair share of criticism, especially as the buying frenzy has cooled and the bitcoin bubble seems to have popped. The price of the world's largest cryptocurrency has dropped more than 70 percent in a year.Some of Wall Street's most closely followed CEOs warned against investing in cryptocurrencies, even at the height of the 2017 boom. J.P. Morgan Chase CEO Jamie Dimon called it a fraud, while Berkshire Hathaway's Warren Buffett has repeatedly warned against investing in it and famously likened the cryptocurrency to  \"rat poison.\" Citadel's billionaire hedge-fund manager Ken Griffin is among the many who have called out similarities between bitcoin and the most famous financial bubble of all time: the Dutch tulip bulb mania of the 1630s.Nouriel Roubini, nicknamed  \"Dr. Doom\" for predicting the financial crisis, is one of the loudest critics, recently telling U.S. senators at a hearing on Capitol Hill that \"crypto is the mother or father of all scams and bubbles.\" He also criticized blockchain, calling it the most  \"over-hyped — and least useful — technology in human history.\"Not everyone has given up on it in 2019, though. Despite the ongoing bear market, both the Intercontinental Exchange, or ICE (parent company of the New York Stock Exchange) and the Nasdaq plan to launch bitcoin futures this year. Multiple attempts to launch the first-ever bitcoin exchange traded fund, or ETF, are still being considered by the Securities and Exchange Commission.\n", "birthday": "2019-01-22T21:51:32+0000", "date": "2019-01-22 21:51:32", "year": 2019, "month": 1, "day": 22}
{"url": "https://www.cnbc.com/2019/01/07/ripple-wants-a-piece-of-the-global-payment-system.html", "title": "Ripple wants a piece of the global payment system while it fights a cryptocurrency 'holy war'", "content": "\nThe logo of blockchain company Ripple is seen at the SIBOS banking and financial conference in Toronto, Ontario, Canada October 19, 2017.Chris Helgren | Reuters\nRipple is one of the most valuable private companies in Silicon Valley. But depending on who you ask, it is also potentially the most divisive.CEO Brad Garlinghouse knows this better than anyone. While Ripple looks to chip away at a multi-trillion-dollar cross-border-payments industry, he and other company executives are constantly clarifying the company's relationship with the cryptocurrency  \"XRP\" and its pack of zealous followers.Confusion around Ripple is warranted — the start-up payments company owns 60 percent of the XRP in existence. The cryptocurrency was for many years even called  \"Ripple\" instead of XRP and listed on some online exchanges that way.\nVIDEO1:1801:18Bitcoin's slumps, dragging ethereum, bitcoin cash and ripple with itClosing Bell\nThe sizable cryptocurrency stake puts Ripple in an almost unheard of position in Silicon Valley of not needing to rely on much venture capital to fund its operations. Instead, it sells XRP on a regular basis. And based on the amount it owns, the company's value is at least $20 billion. The valuation of ride-hailing start-up Lyft, by comparison, is around $15 billion.The price of XRP, and therefore Ripple's value, skyrocketed last year in a buying frenzy led by retail investors. But after the bubble popped, the Ripple-XRP relationship has come under a microscope from skeptics and investors who lost out. \"People got really excited about the potential of a new platform and the hype got ahead of the reality. That unequivocally has happened in this space,\" Garlinghouse said in an interview at CNBC's midtown offices. \"There's religious fervor around all of them — some people seem to think these are the crusades and this is a holy war being fought.\"\nTaking on the banks\nRipple's biggest goal is to allow customers to make cross-border payments. Even while XRP's price slid 90 percent from its peak a year ago, Ripple says it was signing up an average two customers per week last year as it attempted to break into a legacy software and network business that hasn't changed much in 45 years.On Tuesday, Ripple announced it hit the 200-customer milestone, a 350 percent increase in customers sending live payments. It is now operating in more than 40 countries. Still, it has a long way to go before making a dent in global payments, which is dominated by the world's biggest banks.SWIFT, an acronym for the Belgium-based Society of Worldwide InterBank Financial Telecommunications, was established by banks in 1973 as a new way to communicate about cross-border payments, and the messaging system remains the go-to network for more than 10,000 member institutions.Money transmittal between countries can take several days, especially if intermediaries called correspondent banks get involved. Ripple wants to shorten the process to a matter of seconds using something similar to blockchain — the distributed ledger technology that underpins bitcoin and is being tested by companies from Amazon to J.P. Morgan.Much like public blockchains, Ripple's network uses advanced cryptography to make sure transactions are secure. But all parties on the system do not have access to a shared ledger. Unlike cryptocurrency transactions, it can only be seen by those with permission to the network and transactions are not completely anonymous.Even getting a crumb of Swift's business could be a significant win. Global payments ballooned to $1.9 trillion in 2017 and are forecast to grow to $2 trillion by 2020, according to an October report by McKinsey. Philip Bruno, a partner at McKinsey and co-lead of its global payments practice, said mobile telecommunications have raised expectations for how quickly money is transferred from one place to another. \"We've been able to make much faster same day payments domestically with mobile banking,\" Bruno said. \"There's now this expectation that if I can pay my brother or my cousin immediately, when I get to work why can't I do the same thing to pay my global supplier?\"Banks aren't going to let go of their dominance in cross-border payments that easily. Swift has a global payment initiative to speed the flow of information, and HSBC is among the partner banks testing Swift's version and blockchain for payments. But as far as is known, not Ripple's. The bank's head of innovation Jeremy Balkin told CNBC that global banks  \"have a huge competitive advantage\" when it comes to cross-border payments since they have branches and banking relationships across the world.Global banks like Citi make  \"an automatic $8 billion on cross-border payments,\" Ripple's Garlinghouse acknowledged. \"I think Citi will be the last customer we ever sign up because it has the highest vested interest in not changing the status quo.\"\nIt's not all crypto\nRipple's most widely used product is xCurrent, which is software that lets Ripple work with a bank's existing infrastructure to settle payments quickly. In this case, they still need to use a correspondent bank. But instead of just using Swift, Ripple's software sends the message.It calculates the correspondent bank fees, the beneficiary bank fees, and the total cost to the customer before the transaction goes through. It also passes on important compliance details to help financial institutions comply with  \"know your customer\" and \"anti-money laundering\" laws, which allows them to pre-validate payments in real time. For customers that only want to send payments, not receive them, there's a product called xVia.Much of the growth opportunity in payments is seen coming from the Asia-Pacific region, according to McKinsey, where nearly half of Ripple's customers are.Colin Dinn, the chief technology officer at Siam Commercial Bank, one of Thailand's biggest banks, says a lack of old infrastructure makes newer banks the ideal guinea pigs for technology like Ripples'. Dinn said he was looking to get rid of some of the complexity and middlemen needed for international settlements in places like Vietnam, Cambodia and Singapore. So, they began testing xCurrent in 2017. \"We have less embedded infrastructure in the payment systems and are in a position to exploit the growth at a faster pace,\" Dinn said.  \"Certainty and speed are way more important in this modern world.\"Many of the transfers done by Siam are small, remittance payments, or funds that someone might send home to his or her family in another country. That's not a huge business for most U.S. banks that instead focus on payments for global suppliers. But in the case of Siam, these small, often $100 payments are now being sent in a couple of minutes and at a lower cost, Dinn said.\nThe crypto bridge\nRipple's crypto product is called xRapid and officially went live this fall. XRP enthusiasts had long-awaited this announcement, speculating that it might help prices recover. It uses cryptocurrency as a  \"bridge\" between foreign currencies, Garlinghouse said.For example, a bank might want to process a transaction from U.S. dollars to Mexican pesos. In most cases this process requires pre-funded local currency accounts. But by converting U.S. dollars into XRP tokens on an exchange, then converting them back into pesos at the other end, Ripple says the process can happen within fractions of a second.The potential catch is the volatility of crypto, which is known to rise and fall by 15 percent in a single day. Foreign currencies can also be volatile, however, Garlinghouse said, especially if transactions take a couple of days.  \"The average Swift transaction takes three days — but really what we're seeing is three business days. You're taking fiat volatility risk while markets are closed over the weekend,\" Garlinghouse said.London-based foreign exchange service MercuryFX was one of the first to sign up for xRapid to move payments for charitable donations between the U.K. and Mexico.  \"It makes a difference to be able to trace these transactions and know where they are,\" Alastair Constance, founder and director of Mercury FX told CNBC.Still, for this to work, Constance acknowledged that the more activity on the network, the better.  \"Your network is as only as good as your participants,\" he said. \"The trick now is to get more on the network.\"The newest members to the network last year aren't household names: Euro Exim Bank, SendFriend, JNFX, FTCS, Ahli Bank of Kuwait, Transpaygo and BFC Bahrain. Five of those are using the XRP product. Based on tests with companies using XRP, Ripple said the cryptocurrency technology is also proving to be cheaper. For payments between the U.S. and Mexico, Ripple claims financial institutions using xRapid saw a savings of 40 percent to 70 percent compared to what they normally pay foreign exchange brokers.\nRising profile\nIn 2017, cryptocurrencies like bitcoin and XRP went from a niche, online hobby to a retail obsession. XRP attracted speculators, rising to a high of $3.84 in January of last year. It's now the third largest cryptocurrency in existence but has come crashing down to roughly 35 cents since the peak.\n if(\"undefined\"==typeof window.datawrapper)window.datawrapper={};window.datawrapper[\"inQ0u\"]={},window.datawrapper[\"inQ0u\"].embedDeltas={\"100\":486,\"200\":444,\"300\":400,\"400\":400,\"500\":400,\"700\":400,\"800\":400,\"900\":400,\"1000\":400},window.datawrapper[\"inQ0u\"].iframe=document.getElementById(\"datawrapper-chart-inQ0u\"),window.datawrapper[\"inQ0u\"].iframe.style.height=window.datawrapper[\"inQ0u\"].embedDeltas[Math.min(1e3,Math.max(100*Math.floor(window.datawrapper[\"inQ0u\"].iframe.offsetWidth/100),100))]+\"px\",window.addEventListener(\"message\",function(a){if(\"undefined\"!=typeof a.data[\"datawrapper-height\"])for(var b in a.data[\"datawrapper-height\"])if(\"inQ0u\"==b)window.datawrapper[\"inQ0u\"].iframe.style.height=a.data[\"datawrapper-height\"][b]+\"px\"});\nWhile a spike in people wanting to trade XRP may have helped Ripple, it also put a target on their back. Multiple lawsuits have sprung up, including a class-action suit arguing that XRP should have registered as a security. The plaintiff is suing on behalf of all California citizens who bought XRP, seeking $5 million in damages. Brad Garlinghouse is listed among the defendants.At least in the eyes of regulators, bitcoin is  \"decentralized\" enough to exempt it from securities laws. Ether, the world's second largest cryptocurrency, has also been publicly defined as \"not a security.\" XRP is still waiting for that distinction from regulators. \"It's really clear that XRP is not security,\" Garlinghouse said. \"If Ripple the company shut down, XRP would keep trading.\"Another suit by Israeli resident Avner Greenwald, states that there are  \"thousands\" of individuals who lost money after buying XRP, and is asking Ripple to pay $167.7 million in damages.In one of those cases, Ripple is being represented by former Securities and Exchange Commission Chairwoman Mary Jo White, who is one of its many well-known backers. Ripple's board members include American economist Gene Sperling, and Ben Lawsky, the former New York Superintendent of Financial Services who created of the state's bitlicense.\nSelf-funding\nIf XRP ever shut down, Ripple would surely struggle. While revenue comes from selling software to banks and a small amount of venture capital money, the overwhelming majority of its money comes from XRP sales.The founders of Ripple made this possible by gifting the lion's share of the cryptocurrency XRP to Ripple soon after they created it. Unlike some other virtual currencies that have to be  \"mined\" by users, XRP was fully generated before its distribution.Founders Jed McCaleb, David Schwartz and Arthur Britto decided this when they set out to develop a better version of bitcoin. \"The founders were huge fans of bitcoin and believed in its transformative potential but they saw some inefficiencies in its design that would lead to scalability issues and speed problems,\" said Monica Long, one of Ripple's early employees and its senior vice president of marketing.The company put the majority of its stake —55 billion XRP — in a cryptographically-secured escrow account, and sells a little bit of that every month. It has the flexibility to sell as much as 1 billion XRP tokens in a quarter and issues reports on how much it sold. In the third quarter of 2018, it unloaded the equivalent of $163 million.\nBut why XRP?\nWhile Ripple calls XRP the best digital asset for payments, others aren't as enthusiastic.CEO of Messari Ryan Selkis, who is an early crypto investor and vocal Ripple critic, said the company as a stand-alone software business is  \"actually good,\" and their disclosures are about as transparent as it gets in cryptocurrency.But Ripple-XRP relationship makes it the  \"Jekyll and Hyde\" of crypto, Selkis said. From his vantage point, Selkis still thinks XRP and Ripple are still one and the same, \"the industry's worst kept secret.\" \"This was an asset that was sold and centrally managed by Ripple Inc. the company,\" Selkis said, adding that he does not own, or short XRP. \" They've made numerous efforts to disassociate themselves with that language because now it's more risky to be perceived as a sole overseer of XRP.\"He and others wrote off XRP as a legacy byproduct of a system that pivoted from cryptocurrency to enterprise distributed ledger technology. \"The question is, if that cryptocurrency is necessary in the Ripple ecosystem,\" Selkis said. \"The odds of XRP being used by enterprises are very low.\"Tushar Jain, managing partner of Multicoin Capital, is short XRP, meaning he is betting against it. He said if it weren't for Ripple's interest in XRP, there wouldn't be a need for it at all, instead advocating for dollar-backed cryptocurrencies called stable coins. \"If you can look past the class-action lawsuits and other serious regulatory concerns, there's still a slew of reasons to be bearish,\" Jain said. \"XRP's future as a liquidity bridge for banks looks bleak at best.\"\nCrypto shakeout\nGarlinghouse said he and others at the company are used to the criticism and questions of commercial adoption when it comes to xRapid. But Tuesday's announcement, adding five customers to that product in particular, is a  \"punctuation\" that Ripple is making progress, Garlinghouse said.Like the earlier dot-com era, cryptocurrency companies are now going through an inevitable wash-out. Consensys, another well-known and well-funded cryptocurrency start-up. is reportedly firing as much about 60 percent of its 1,200 person staff this year, and many other digital coin offerings are crumbling as regulators take notice.Garlinghouse is hoping that Ripple ends up like the Amazon or Google of that earlier era. \"Ripple took a contrarian view on a bunch of things pretty early and that made us unpopular among the die-hard crypto community,\" Garlinghouse said. \"In the face of those kind of arrows, though, I still have conviction that we're on the right path.\"\n", "birthday": "2019-01-08T15:00:00+0000", "date": "2019-01-08 15:00:00", "year": 2019, "month": 1, "day": 8}
{"url": "https://www.cnbc.com/2019/01/10/bitcoin-stumbles-below-4000-reversing-weekend-gains-.html", "title": "Bitcoin stumbles below $4,000 in sudden overnight drop", "content": "\nVIDEO7:1507:15Nine experts break down what to expect for crypto in 2019Cryptocurrency\nBitcoin's struggles are continuing into 2019.The world's largest cryptocurrency dropped 9 percent on Thursday morning to a low of $3,570.29, according to industry data site CoinDesk. The sudden and sharp drop brings bitcoin's one-year losses to more than 70 percent.Other major cryptocurrencies struggled, too. Ether fell 15 percent while XRP dropped 9 percent, according to CoinDesk.Analysts did not point to any particular catalyst for Thursday's cryptocurrency dip. Mati Greenspan, senior market analyst at eToro, said clients had been asking — but there doesn't seem to be any real reason for this drop,  \"neither technical nor fundamental.\" \"The one interesting thing about this movement is that it seems to be an exact reversal of the surge that happened on Sunday afternoon,\" Greenspan said. \"At this point, the gains made since the start of the year have now been reversed and we're back to a neutral 2019.\"Bitcoin and other cryptocurrencies have failed to recover to their peaks reached around this time last year. The retail mania has certainly worn off as the entire market capitalization has dropped 85 percent in a year, according to Coinmarketcap.com.Investors had been awaiting more institutional adoption this year, and the launch of a series of bitcoin futures. Both the Intercontinental Exchange, or ICE (parent company of the New York Stock Exchange) and the Nasdaq plan to launch bitcoin futures this year, despite the ongoing bear market.So far, the Commodity Futures Trading Commission, which regulates bitcoin, has approved two crypto futures products — one from the Chicago Board Options Exchange and another by the Chicago Mercantile Exchange. Still, SEC Chairman Jay Clayton said in November that he needs to see better custody solutions surveillance before he would feel  \"comfortable\" allowing a crypto exchange traded fund, or ETF, to come to market.WATCH: The crypto craze ended 2018 with a whimper\nVIDEO7:1507:15Nine experts break down what to expect for crypto in 2019Cryptocurrency\n\n", "birthday": "2019-01-10T14:41:27+0000", "date": "2019-01-10 14:41:27", "year": 2019, "month": 1, "day": 10}
{"url": "https://www.cnbc.com/2019/01/07/bitcoin-security-token-and-sto-explained.html", "title": "Apple and Tesla shares on the blockchain could be the next big thing in crypto", "content": "\nThe Apple logo is displayed at the Nasdaq MarketSite just before the opening bell in New York on Thursday, Aug. 25, 2011.Scott Eells | Bloomberg | Getty Images\nCryptocurrencies had a wild 2018, tumbling well below some of the record highs seen toward the end of 2017.Bitcoin, once worth almost $20,000, plunged last year, closing out 2018 at a price below $4,000. Other major virtual currencies, including XRP and ether, also fell steeply.Analysts and executives in the industry are increasingly pointing to a fairly new development that could reinvigorate the space: putting securities like stocks and bonds on the blockchain.So-called security tokens are becoming a new buzzword in crypto. The term is part of a phenomenon in the industry known as  \"tokenization\" — turning real-world assets into digital tokens.In the case of security tokens, tradable assets like equity and fixed income are transformed into digital assets that use blockchain technology, the virtual ledger of activity that underpins cryptocurrencies like bitcoin.Security tokens had been talked about for some time, but now one firm is looking to put them to the test.On Monday, DX.Exchange, an Estonia-based crypto firm, launched a trading platform that lets investors buy shares of popular Nasdaq-listed companies, including Apple, Tesla, Facebook and Netflix, indirectly through security tokens.Each token is backed by one share of the company traders want to invest in and entitles them to the same cash dividends. \"The crypto community has been talking about security tokens for well over a year now without much progress, so we think the impact will be huge,\" Amedeo Moscato, DX's chief operating officer, told CNBC by email over the weekend. \"By tokenizing stocks of some of the biggest publicly-traded companies like Google, Amazon, Facebook and more, we are opening an untapped market of millions of old and new traders around the globe cutting out the middleman. \"\nVIDEO2:4002:40What is a security token?Squawk Box Europe\nInvestors will be able to trade the digital stocks round-the-clock, even after markets close, DX says. \"The ability to trade around the clock, with a range of currencies, offers investors both convenience and liquidity,\" Dan Doney, co-founder and chief executive of fintech firm Securrency told CNBC by email over the weekend.But Doney questioned whether DX's exchange was sound on the regulatory front. \"We're unsure and even skeptical of DX.Exchange's model because we don't think that it's acceptable to list tokenized shares of a company without shareholder consent,\" he said. \"However, we do think that the model can meet regulatory standards if executed properly.\"DX stressed that its digital stocks are classed as derivatives — with the underlying asset being equity of 10 Nasdaq-listed firms — and that its platform is regulated under the European Union's Mifid II directive. Mifid II, a set of reforms to EU investment services regulation, aims to protect investors and increase transparency and confidence in the industry post-crisis.Cyprus-licensed firm MPS MarketPlace Securities is holding the stocks in a segregated account. DX built the platform on top of Nasdaq's Matching Engine technology, which is used across more than 70 international markets.Experts are pointing to the model as one that could provide a solid form of investment for traders — versus cryptocurrencies like bitcoin, which have proven at times to be highly volatile — as well as a new potential source of fundraising for start-ups and large firms alike.\n'STO'\nNew security tokens can be issued and sold to investors, similar to how new digital tokens are sold through a crowdfunding method known as an initial coin offering (ICO). This is what's known as a security token offering (STO).ICOs were a source of much controversy in the crypto sphere in both 2017 and 2018, with China and South Korea banning the practice and the U.S. Securities and Exchange Commission rapping a number of ventures and founders over alleged illegal activities.One supposed cryptocurrency start-up called Giza made off with more than $2 million through a fake ICO scam, a CNBC investigation last year showed.Dubious as the murky world of ICOs is, the funding method at one point eclipsed early-stage venture capital funding. ICO projects raked in almost $6.6 billion in 2017 and $21.5 billion in 2018, according to data provided by ICO listing site CoinSchedule.The difference with STOs, experts say, is that security tokens are asset-backed and fall within regulatory parameters. \"Security tokens use blockchain to allow for efficient transactions like cryptocurrencies, but are different in all other ways,\" Securrency's Doney said. \"(They) emphasize regulatory compliance, automated regulatory reporting, and represent share interest in value-producing assets. This ultimately provides stable value versus the volatility of crypto.\"\n\nCrowdfunding site Indiegogo delved into the world of STOs last year, hosting a platform that let investors indirectly own shares of a luxury ski resort by buying security tokens. That token sale brought in $18 million, according to VentureBeat.Security tokens and STOs have been compared to  \"stablecoins,\" cryptocurrencies pegged 1:1 to government-backed currencies to avoid the volatility typically seen in the cryptocurrency market. Stablecoins are seen as another potential area for growth in the crypto industry.Goldman Sachs-backed fintech start-up Circle launched a stablecoin pegged to the U.S. dollar last year, and Chief Executive Jeremy Allaire has told CNBC he thinks  \"all fiat currency will be crypto\" one day. \"Cryptocurrencies and STOs will continue to evolve, and digital stocks are another step in that process,\" Daniel Skowronski, DX's chief executive, told CNBC by email.\nSTOs to 'ramp into the market' by mid-2019\nAdvocates also say that security tokens could reduce the cost of listing a company on the stock market and that they will make it easier to trade less liquid assets like private equity.And though it may be early days, one expert thinks the trend of tokenizing securities will become a major theme by mid-2019. \"In terms of timing, we hear that mid-2019 is the time-frame when most STOs will be able to ramp into the market,\" Lex Soklin, partner and global director of fintech strategy at Autonomous Research, told CNBC by email. \"Given a longer regulatory approval process for these assets (rather than none for ICOs), entrepreneurs have a slower path to market. But perhaps a more stable one.\"Some even believe that, eventually, everything from artwork to real estate will be transformed into digital tokens. \"Over the next decade, we could very well see the tokenization of the entire financial markets,\" Mati Greenspan, senior market analyst at eToro, said in a note last week. \"Essentially, anything that has value and can be traded can also be represented as a digital token and traded on a blockchain.\"\nWATCH: Should you invest in a cryptocurrency?\nVIDEO5:2205:22Should you invest in a cryptocurrency?CNBC Explains\n\n", "birthday": "2019-01-08T06:27:38+0000", "date": "2019-01-08 06:27:38", "year": 2019, "month": 1, "day": 8}
{"url": "https://www.cnbc.com/2019/01/23/cboe-pulls-its-long-awaited-bitcoin-etf-application-amidst-a-government-shutdown--.html", "title": "ETF Edge", "content": "\nVIDEO2:1402:14CBOE pulls bitcoin ETF filingETF Edge\nHopes for a bitcoin exchange traded fund are being dashed, for now.Cboe Global Markets pulled its application on Wednesday for what would be the first-ever bitcoin exchange traded fund, or ETF, according to a filing with the Securities and Exchange Commission. The SEC's approval is needed before VanEck and SolidX partners would be able to list their fund on Cboe's BZX exchange.Bitcoin advocates have been eagerly awaiting the approval of a bitcoin ETF, which many say would usher in new buyers to the struggling asset class. The world's largest cryptocurrency is down more than 80 percent from its high reached during the retail-driven frenzy in 2017, and was down 1 percent, near $3,540, on Wednesday.The SEC rejected a second attempt by Cameron Winklevoss and Tyler Winklevoss, founders of crypto exchange Gemini, to list shares of a separate bitcoin ETF this summer. The financial watchdog cited concerns over investor protection, fraud and manipulation of bitcoin, especially since much of the trading is done in unregulated offshore markets.SEC Chairman Jay Clayton said in November he needed to see better market surveillance and custody for cryptocurrencies before being  \"comfortable\" with a bitcoin ETF.VanEck's founder and CEO, Jan Van Eck, told CNBC on Wednesday that it is ready to answer many of the SEC's questions. But in order to make its case  \"clearly and convincingly to the regulators\" it needs the government  to reopen. \"We were trying to do that but we obviously can't have meetings when they're shut down,\" VanEck told CNBC's \"ETF Edge. \" \"Instead of trying to slip through or something, we just had the application pulled.\"The ETF approval process, and other SEC applications for things like initial public offerings, remain on hold as Democrats in Congress and President Donald Trump are locked in a stalemate over funding for a border wall.The agency has staff  \"available to respond to emergency situations involving market integrity and investor protection, including law enforcement,\" but most other functions are closed, the agency said on its website.VanEck told CNBC the group will refile and re-engage in bitcoin ETF discussions  \"when the SEC gets going again.\"\n", "birthday": "2019-01-23T22:15:00+0000", "date": "2019-01-23 22:15:00", "year": 2019, "month": 1, "day": 23}
{"url": "https://www.cnbc.com/2019/01/23/jp-morgans-jamie-dimon-takes-no-satisfaction-in-bitcoins-nosedive--.html", "title": "Jamie Dimon predicted bitcoin's nosedive, but isn't celebrating it", "content": "\nJamie Dimon, CEO of JP Morgan Chase, speaking at the 2019 WEF in Davos, Switzerland on Jan. 23rd, 2019.Adam Galica | CNBC\nThe bitcoin price bubble has burst but JP Morgan Chase's Jamie Dimon isn't taking a victory lap.The CEO was among the first and loudest on Wall Street to warn against the cryptocurrency, calling it a  \"fraud\" and warning investors that if they were \"stupid enough to buy it\" they would \"pay the price one day.\"When asked if he took any satisfaction in being right after bitcoin dropped 80 percent, Dimon told CNBC at the World Economic Forum in Davos he  \"didn't take any.\"Still, Dimon is advocating for its underlying technology, blockchain. Despite its own level of corporate hype, he said it's not the perfect fit to disrupt things like equity trades. It's a better replacement for certain online databases, he said. \"Blockchain is a real technology — it's just a database we can all access that's kept up-to-date,\" Dimon told CNBC's Squawk Box.J.P. Morgan is using the technology, which gets rid of the need for a third party intermediary by creating a permanent, open record of all transactions on a network. Buyers and sellers can interact directly and have their exchange recorded on a what's known as a  \"distributed,\" or blockchain ledger.In October 2017, J.P. Morgan Chase announced a blockchain-based system that will  \"significantly reduce\" the number of parties needed to verify global payments, reducing transaction times \"from weeks to hours.\" Royal Bank of Canada and Australia and New Zealand Banking Group are among the bank's partners in the project.Corporate giants Amazon, Facebook, and IBM are among the many others exploring blockchain use cases.Bitcoin meanwhile has failed to stage a recovery. Since its peak in December 2017, the cryptocurrency has fallen 82 percent, according to data from CoinDesk. It has dropped roughly 75 percent over one year, and was trading near $3,570 on Wednesday.\nVIDEO17:3417:34Watch CNBC's full interview with JP Morgan Chase CEO Jamie Dimon at DavosSquawk Box\n\n", "birthday": "2019-01-23T14:53:13+0000", "date": "2019-01-23 14:53:13", "year": 2019, "month": 1, "day": 23}
{"url": "https://www.cnbc.com/2019/01/25/bitcoin-not-an-ideal-hedge-unless-youre-expecting-dystopia-jp-morgan-says.html", "title": "Bitcoin may only be a good hedge in a dystopia, JP Morgan says", "content": "\nA visual representation of the cryptocurrency Bitcoin on November 20, 2018 in London, England.Jordan Mansfield | Getty Images News | Getty Images\nBitcoin might come in handy for some type of dystopian future. But in the meantime, investors may want to look for other safe-haven bets, according to J.P. Morgan.Barring an all-out loss of faith in all major currencies — the dollar, euro, yen and gold — the firm remains doubtful. \"We have long been skeptical of cryptocurrencies' value in most environments other than a dystopian one characterized by a loss of faith in all major reserve assets,\" J.P. Morgan managing director and analyst Jan Loeys wrote in a note to clients this week.Given cryptocurrencies' sky-high returns and low correlation to traditional assets like equities and credit, bitcoin backers had cited it as an ideal way to diversify a traditional portfolio.But J.P. Morgan judges crypto as deficient for two reasons: The trouble of extrapolating past risk-return properties  \"of an emerging financial asset displaying bubble-like properties,\" similar to technology stocks in the 1990s. The second was digital currencies' inability to outperform during periods of equity market draw-downs, like the summer of 2015 and February 2018, \"perhaps due to their own overvaluation.\" \"Even in extreme scenarios such as a recession or financial crises, there are more liquid and less complicated instruments for transacting, investing and hedging, in part due to the scale afforded by fiat currencies' legal tender status,\" Loeys said.As stocks struggled at certain points last year, so did bitcoin. The Dow plunged 1,500 in a single day in February, and bitcoin meanwhile dropped more than 9 percent. The world's largest and best-known cryptocurrency is more than 80 percent off of its almost $20,000 high hit in December 2017. Year-over-year, bitcoin has lost about 70 percent of its value and was trading near $3,587 on Friday.In the report, Loeys predicts bitcoin could tumble as low as $1,260  \"if a bear market persists.\" Its cost support likely sits around $2,400, according to the report.While prices have plummeted in what some are calling  \"crypto winter\" as an opportunity to buy cheap assets. While many initial coin offerings have flopped, cryptocurrency developers continue working on new use cases and M&A has remained strong. Still, J.P. Morgan isn't convinced. \"Developments over the past year have not altered our reservations about these assets' role in global portfolios, even if their novelty value can remain high indefinitely,\" Loeys said.J.P. Morgan's CEO Jamie Dimon has been among the most vocal, well-know critics. The CEO has called it a  \"fraud\" and warned investors that if they were \"stupid enough to buy it\" they would \"pay the price one day.\" When asked at the World Economic Forum in Davos if he took any satisfaction in being right about bitcoin plunging, Dimon told CNBC  \"didn't take any.\"Still, Dimon advocated for its underlying technology, blockchain. But the research note this week outlines hurdles remaining hurdles to its mass adoption. \"Blockchain is unlikely to re-invent the global payments system, but instead can provide marginal improvements to various parts of the process,\" Loeys said. \"Progress has been made to move blockchain adoption beyond experimentation and use in payments, but development has been largely confined to use cases like smart contracts, record keeping and decentralized applications rather than an institutionalized approach.\"WATCH: Bitcoin is disrupting the $45 billion art industry\nVIDEO1:3601:36Bitcoin is disrupting the $45 billion art industryDigital Original\n\n", "birthday": "2019-01-25T16:01:50+0000", "date": "2019-01-25 16:01:50", "year": 2019, "month": 1, "day": 25}
{"url": "https://www.cnbc.com/2019/01/29/crime-still-plague-cryptocurrencies-as-1point7-billion-was-stolen-last-year-.html", "title": "Crime still plagues cryptocurrencies, as $1.7 billion was stolen from investors last year", "content": "\nAndrew Brookes | Cultura | Getty Images\nCryptocurrency has a security problem it hasn't been able to shake.Bad actors stole $1.7 billion worth of cryptocurrencies from investors last year, according to a new report from CipherTrace Cryptocurrency Intelligence published Tuesday. Of that total, roughly $1 billion was taken from exchanges.Even as prices dropped last year, crimes went up. The plunge in cryptocurrencies meant a lower total value for these stolen coins, but the volume of coins stolen in 2018 was 3.6 times higher than it was in 2017 and seven times what it was in 2016, according to the report. \"These numbers only represent the loot from crypto crimes that CipherTrace can validate; we have little doubt that the true number of crypto asset losses is much larger,\" said Dave Jevans, CEO of CipherTrace.The report underscores massive risks in the new asset class. Aside from the reality of losing money as prices erode, the possibility of getting hacked is still one of its biggest challenges to mainstream adoption and acceptance by regulators.Bitcoin became a household name as it rallied 1,300 percent to almost $20,000 at the end of 2017. Media coverage and a frenzy of buyers followed. But unfortunately, so did hackers. Jevans said they saw a  \"residual effect\" after hackers finally figured out how to scam people, even months after the bubble popped.Cryptocurrency payments are recorded on an open ledger known as blockchain, meaning they can be seen by anyone. The team at CipherTrace is able to track them but still might not know the anonymous parties who sent or received the money. The firm also scans the black market and criminal forums for data. The firm monitored chat rooms that advocated for targeting crypto and blockchain start-ups that raised massive amounts of money at the height of the price bubble. \"These aren't street thugs — these are people who have masters degrees in computer science,\" Jevans said. \"We're starting to see more organization in the space with professional gangs bankrolling computer scientists.\"In the beginning of the year, exchange hackers dominated the crypto crime scene, but the report showed a rise in  \"inside jobs\" or fraud in the fourth quarter of last year. Something called SIM-swapping, where a hacker takes over a victim's mobile device to steal credentials, then breaks into wallets or exchanges, was the top threat in 2018, the report said.In addition to outright thefts, investors lost almost $750 million from threats such as  \"exit scams,\" where founders of initial coin offerings simply ran off with the funds they raised. Initial coin offerings, or ICOs,  where people sell \"tokens\" to fund projects, became a popular but controversial way to make money. Many of those were backed by a promise to build a product or software that they never delivered.\nOrganized crime\nA separate report out this week from Chainalysis echoes those findings. But it also shows that the majority of these crimes were carried out by just two organized groups.Philip Gradwell, chief economist at Chainalysis, said the $1.7 billion number was in line with their own findings and that criminal activity has  \"grown significantly\" in the past 18 months. The firm tracks cryptocurrency transactions and provides insights to governments, law enforcement and some hedge funds to help them comply with anti-money-laundering laws. \"When we look at these patterns it's clear these are large, sophisticated hacking groups,\" Gradwell told CNBC.The two groups accounted for $1 billion of the total cryptocurrency hacks and averaged $90 million per hack, according to the report. In order to get away with it, hackers typically move the stolen crypto through a complex web of exchanges and personal wallets. The hackers often observe a quiet period over 40 days or so, and wait until interest has died down before cashing out.The two strategies diverge, though. One group, which the report labels  \"Alpha,\" is more sophisticated and complex. It makes a bigger effort to hide its tracks, \"expertly shuffling funds around in a way that suggests they want to avoid detection.\" To do that, the group moves the stolen cryptocurrency 15,000 times before they sell it on exchange. On average, both hacking groups move funds at least 5,000 times.The Alpha group appears  \"as eager to create havoc as to maximize profits,\" according to the report.The other group, called  \"Beta,\" is smaller and less sophisticated. They seem to be more focused on the money, and \"don't appear to care very much about evading detection, just about getting a clear route to convert illicit assets to clean cash.\"While crypto crime increased in 2018, it made up a smaller slice of a much larger market. The amount taken from exchanges, for example, was 1 percent of bitcoin's value, Gradwell said. \"The level of criminal activity is still relatively low and the main use of crypto is still as a financial asset,\" Gradwell said.\nLooking ahead\nRegulators are acutely aware of the issue.Securities and Exchange Commission Chairman Jay Clayton has repeatedly voiced concerns over security and investor protection. He cited the lack of market surveillance and questions about how to safely store these assets as major roadblocks before he would feel  \"comfortable\" green-lighting a bitcoin ETF. \"We've seen some thefts around digital assets that make you scratch your head,\" Clayton said at CoinDesk's Consensus Invest conference in November. \"We care that the assets underlying that ETF have good custody and that they're not going to disappear.\"Advocates have long awaited a bitcoin ETF, which they hope would help usher in institutional buyers and lift prices. Meanwhile firms including Gemini, Coinbase and Fidelity have stepped in to be the trusted custodian.But security is still an uphill battle as long as hacking remains profitable. \"It's definitely not going to slow down,\" CipherTrace's Jevans said. \"It's still a massive multi-billion-dollar business and has gotten more sophisticated and bigger — what we're seeing in 2018, we'll see through 2019.\"\n", "birthday": "2019-01-29T20:41:57+0000", "date": "2019-01-29 20:41:57", "year": 2019, "month": 1, "day": 29}
{"url": "https://www.cnbc.com/2019/02/06/jack-dorsey-says-the-only-cryptocurrency-he-owns-is-bitcoin.html", "title": "Jack Dorsey says the 'only' cryptocurrency he owns is bitcoin", "content": "\nJack DorseyDavid Paul Morris | Bloomberg | Getty Images\nJack Dorsey, the billionaire founder of tech firms Twitter and Square, is still bullish on the world's most valuable cryptocurrency.Dorsey said in a tweet Tuesday evening that — out of the hundreds of virtual currencies in existence — the only one he currently holds is bitcoin. \"I only have bitcoin,\" the entrepreneur told his followers.Dorsey, whose fintech company Square lets users buy and sell bitcoin via its Cash app, didn't specify how much bitcoin he owned. The digital asset's price has tumbled more than 80 percent since an all-time high near $20,000 it hit in December 2017.That hasn't stopped him from making bullish calls for the digital coin. Dorsey has made the prediction that bitcoin will one day become the single global currency, and said he hopes the cryptocurrency will eventually be the  \"native currency\" of the internet.\n\nDorsey also promoted a social media game called  \"lightning torch,\" where users add funds to a bitcoin payment and then send the \"torch\" along to another person so they can add funds and so on. \"Cool example of #BitcoinTwitter experimenting on the Lightning Network,\" Dorsey said, before passing the \"lightning torch\" onto Elizabeth Stark, CEO of Lightning Labs, a blockchain company he has invested in.The game is part of an effort to promote the so-called  \"Lightning Network,\" an update to the bitcoin network that would work as an additional layer to the existing distributed ledger that underpins bitcoin. The upgrade would, in theory, make bitcoin transactions cheaper and faster.\n", "birthday": "2019-02-06T13:09:57+0000", "date": "2019-02-06 13:09:57", "year": 2019, "month": 2, "day": 6}
{"url": "https://www.cnbc.com/2019/01/30/many-bitcoin-investors-dont-plan-on-reporting-their-losses-to-the-irs.html", "title": "Bitcoin investors lost big in 2018. Some don't plan on telling the IRS", "content": "\nS3studio | Getty Images News | Getty Images\nBitcoin investors may want to forget 2018. First, they should file their taxes. \"[Last year] was essentially a blood bath for most crypto investors,\" said Tyson Cross, a tax attorney in Reno, Nevada.The digital coin began last year trading at around $15,000, compared with $3,400 today.Still, only around half of bitcoin investors plan to report their losses to the IRS, according to a survey of some 1,000 people conducted in November by personal finance company Credit Karma.Their reasons for staying quiet? Not knowing if they can deduct their losses, or believing they don't have to.Perhaps more important: Others could be skittish to report their losses if they never shared their gains with the IRS, said Selva Ozelli, a CPA and tax lawyer. \"Taxpayers didn't [used to] report their Swiss bank accounts,\" Ozelli said. \"These crypto traders could be following the same logic.\"Or, some could be trying to save time, Cross said.  \"Crypto investors probably think it's easier to file their tax return without the crypto losses,\" he said.The bottom line, however:  \"Taxpayers must report any and all asset sales, including sales of crypto,\" Cross said.\nVIDEO2:0002:00If you own bitcoin, here's how much you owe in taxesAdvisor Insight\nThat's because the IRS has no way of knowing whether your sale resulted in a gain or a loss  \"unless you specifically report it that way on your tax return,\" Cross said.Failing to report your losses and gains could have big consequences, said Kevin F. Sweeney, a former federal tax prosecutor and an attorney at Chamberlain Hrdlicka in Philadelphia. \"The IRS has been unequivocal in its intent to crackdown on unreported crypto and is beginning to acquire the records and resources to go after noncompliant taxpayers,\" Sweeney said.Indeed, there's now a virtual currency team at the IRS. And the agency hired a cryptocurrency software company called Chainalysis to  \"trace the movement of money through the bitcoin economy,\" according to a contract obtained by the Daily Beast.\nThe IRS has been unequivocal in its intent to crackdown on unreported crypto.Kevin F. Sweeneya former federal tax prosecutor\nCryptocurrencies, just like bonds or stocks, are taxed at your capital gains rate, which is calculated by subtracting the cost of the asset at time of purchase from the amount at which it was sold. That difference is typically levied at between 15 and 20 percent, depending on your overall income. (If you've held the cryptocurrencies less than a year, gains are taxed at your normal income rate.)This transaction report goes on Form 8949 of your tax return, which then becomes part of Schedule D. Cross recommends that investors use one of the cryptocurrency software services that help people calculate their losses and gains, such as Bitcoin.tax or Cointracking.info.Losses, on the other hand, can be used to offset capital gains from other types of assets, such as stocks or real estate. Up to $3,000 of the investor's net loss can be deducted against ordinary income, Cross said.Lost more than that? You can continue to write off your losses in the following years. \"It would take 166 years to recoup a capital loss of $500,000 if the investor never had any other capital gains and ended up only taking the annual $3,000 deduction against ordinary income,\" Cross said.More from Personal Finance: When it comes to college financial aid, the sooner you file, the betterHow to pay back your student loansHow families pay for college\n", "birthday": "2019-01-30T16:50:53+0000", "date": "2019-01-30 16:50:53", "year": 2019, "month": 1, "day": 30}
